Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: uk

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 faulty_region_1_min: 130.0, 0.0 faulty_region_1_max: 145.0, 40.0 faulty_region_2_min: 225.0, 0.0 faulty_region_2_max: 250.0, 25.0 faulty_region_3_min: 165.0, 95.0 faulty_region_3_max: 205.0, 110.0 faulty_region_4_min: 30.0, 170.0 faulty_region_4_max: 45.0, 210.0
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 faulty_region_1_min: 130,0, 0,0 faulty_region_1_max: 145,0, 40,0 faulty_region_2_min: 225,0, 0,0 faulty_region_2_max: 250,0, 25,0 faulty_region_3_min: 165,0, 95,0 faulty_region_3_max: 205,0, 110,0 faulty_region_4_min: 30,0, 170,0 faulty_region_4_max: 45,0, 210,0

source: Loading the default profile
uk: Завантаження профілю за замовчуванням

source: Previous versions of `bed_mesh` always loaded the profile named *default* on startup if it was present. This behavior has been removed in favor of allowing the user to determine when a profile is loaded. If a user wishes to load the `default` profile it is recommended to add `BED_MESH_PROFILE LOAD=default` to either their `START_PRINT` macro or their slicer's "Start G-Code" configuration, whichever is applicable.
uk: Попередні версії `bed_mesh` завжди завантажували профіль із назвою *default* під час запуску, якщо він був присутній. Цю поведінку було видалено, щоб користувач міг визначати, коли завантажується профіль. Якщо користувач бажає завантажити профіль `за замовчуванням`, рекомендується додати `BED_MESH_PROFILE LOAD=default` або до свого макросу `START_PRINT`, або до конфігурації «Почати G-код» слайсера, залежно від того, що застосовно.

source: Alternatively the old behavior of loading a profile at startup can be restored with a `[delayed_gcode]`:
uk: Крім того, стару поведінку завантаження профілю під час запуску можна відновити за допомогою `[delayed_gcode]`:

source: [delayed_gcode bed_mesh_init] initial_duration: .01 gcode: BED_MESH_PROFILE LOAD=default
uk: [delayed_gcode bed_mesh_init] початкова_тривалість: .01 gcode: BED_MESH_PROFILE LOAD=за умовчанням

source: The Bed Mesh module may be used to compensate for bed surface irregularities to achieve a better first layer across the entire bed. It should be noted that software based correction will not achieve perfect results, it can only approximate the shape of the bed. Bed Mesh also cannot compensate for mechanical and electrical issues. If an axis is skewed or a probe is not accurate then the bed_mesh module will not receive accurate results from the probing process.
uk: Модуль Bed Mesh можна використовувати для компенсації нерівностей поверхні ліжка для досягнення кращого першого шару по всьому ліжку. Слід зазначити, що програмна корекція не дасть ідеальних результатів, вона може лише наблизити форму ліжка. Bed Mesh також не може компенсувати механічні та електричні проблеми. Якщо вісь перекошена або датчик неточний, модуль bed_mesh не отримає точні результати процесу вимірювання.

source: The illustration below shows how the probed points are generated. As you can see, setting the `mesh_origin` to (-10, 0) allows us to specify a larger mesh radius of 85.
uk: На малюнку нижче показано, як генеруються досліджувані точки. Як бачите, встановлення `mesh_origin` на (-10, 0) дозволяє нам вказати більший радіус сітки 85.

source: While its possible to sample the probed matrix directly using simple bi-linear interpolation to determine the Z-Values between probed points, it is often useful to interpolate extra points using more advanced interpolation algorithms to increase mesh density. These algorithms add curvature to the mesh, attempting to simulate the material properties of the bed. Bed Mesh offers lagrange and bicubic interpolation to accomplish this.
uk: У той час як можна відібрати зразки досліджуваної матриці безпосередньо за допомогою простої білінійної інтерполяції для визначення Z-значень між досліджуваними точками, часто корисно інтерполювати додаткові точки за допомогою більш просунутих алгоритмів інтерполяції для збільшення щільності сітки. Ці алгоритми додають сітці кривизну, намагаючись імітувати властивості матеріалу ліжка. Для цього Bed Mesh пропонує інтерполяцію Лагранжа та бікубічну інтерполяцію.

source: Generally the default values for these options are sufficient, in fact the default value of 5mm for the `move_check_distance` may be overkill. However an advanced user may wish to experiment with these options in an effort to squeeze out the optimal first layer.
uk: Зазвичай значень за замовчуванням для цих параметрів достатньо, насправді значення за замовчуванням 5 мм для `move_check_distance` може бути надмірним. Однак досвідчений користувач може захотіти поекспериментувати з цими параметрами, щоб вичавити оптимальний перший шар.

source: `fade_target: 0` *Default Value: The average Z value of the mesh* The `fade_target` can be thought of as an additional Z offset applied to the entire bed after fade completes. Generally speaking we would like this value to be 0, however there are circumstances where it should not be. For example, lets assume your homing position on the bed is an outlier, its .2 mm lower than the average probed height of the bed. If the `fade_target` is 0, fade will shrink the print by an average of .2 mm across the bed. By setting the `fade_target` to .2, the homed area will expand by .2 mm, however, the rest of the bed will be accurately sized. Generally its a good idea to leave `fade_target` out of the configuration so the average height of the mesh is used, however it may be desirable to manually adjust the fade target if one wants to print on a specific portion of the bed.
uk: `fade_target: 0` *Значення за замовчуванням: середнє значення Z сітки* `fade_target` можна розглядати як додаткове зміщення Z, застосоване до всього ліжка після завершення згасання. Загалом ми хотіли б, щоб це значення було 0, однак є обставини, коли воно не повинно бути. Наприклад, припустимо, що ваше початкове положення на станині є викидом, воно на 0,2 мм нижче, ніж середня досліджувана висота станини. Якщо `fade_target` дорівнює 0, зникнення зменшить відбиток у середньому на 0,2 мм по всій поверхні. Встановивши для параметра `fade_target` значення .2, ділянка фіксації розшириться на .2 мм, однак решта ліжка матиме точний розмір. Загалом доцільно залишити `fade_target` поза конфігурацією, щоб використовувати середню висоту сітки, однак може бути бажано вручну налаштувати ціль зникнення, якщо потрібно друкувати на певній частині ліжка.

source: It should be noted that each time a BED_MESH_CALIBRATE occurs, the current state is automatically saved to the *default* profile. The *default* profile can be removed as follows:
uk: Слід зазначити, що кожного разу, коли відбувається BED_MESH_CALIBRATE, поточний стан автоматично зберігається в профілі *за замовчуванням*. Профіль *за замовчуванням* можна видалити таким чином:

source: Configuring the zero reference position
uk: Налаштування нульової позиції відліку

source: Many probes are susceptible to "drift", ie: inaccuracies in probing introduced by heat or interference. This can make calculating the probe's z-offset challenging, particularly at different bed temperatures. As such, some printers use an endstop for homing the Z axis and a probe for calibrating the mesh. In this configuration it is possible offset the mesh so that the (X, Y) `reference position` applies zero adjustment. The `reference postion` should be the location on the bed where a [Z_ENDSTOP_CALIBRATE](./Manual_Level#calibrating-a-z-endstop) paper test is performed. The bed_mesh module provides the `zero_reference_position` option for specifying this coordinate:
uk: Багато зондів сприйнятливі до «дрейфу», тобто до неточностей зондування, викликаних теплом або перешкодами. Це може ускладнити розрахунок зсуву зонда по z, особливо при різних температурах шару. Таким чином, деякі принтери використовують кінцевий упор для наведення осі Z і зонд для калібрування сітки. У цій конфігурації можна зміщувати сітку таким чином, щоб «еталонна позиція» (X, Y) застосовувала коригування нуля. «Еталонною позицією» має бути місце на платформі, де виконується тестування паперу [Z_ENDSTOP_CALIBRATE](./Manual_Level#calibrating-a-z-endstop). Модуль bed_mesh надає параметр `zero_reference_position` для визначення цієї координати:

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 zero_reference_position: 125, 110 probe_count: 5, 3
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 zero_reference_position: 125, 110 probe_count: 5, 3

source: `zero_reference_position: ` *Default Value: None (disabled)* The `zero_reference_position` expects an (X, Y) coordinate matching that of the `reference position` described above. If the coordinate lies within the mesh then the mesh will be offset so the reference position applies zero adjustment. If the coordinate lies outside of the mesh then the coordinate will be probed after calibration, with the resulting z-value used as the z-offset. Note that this coordinate must NOT be in a location specified as a `faulty_region` if a probe is necessary.
uk: `zero_reference_position:` *Значення за замовчуванням: Немає (вимкнено)* `zero_reference_position` очікує, що координата (X, Y) відповідає координаті `еталонної позиції`, описаної вище. Якщо координата лежить у межах сітки, тоді сітка буде зміщена, тому опорна позиція застосовує коригування нуля. Якщо координата лежить за межами сітки, то координата буде досліджена після калібрування, а результуюче значення z використовуватиметься як зсув по z. Зауважте, що ця координата НЕ має бути в місці, зазначеному як `faulty_region`, якщо потрібен зонд.

source: The deprecated relative_reference_index
uk: Застарілий relative_reference_index

source: Existing configurations using the `relative_reference_index` option must be updated to use the `zero_reference_position`. The response to the [BED_MESH_OUTPUT PGP=1](#output) gcode command will include the (X, Y) coordinate associated with the index; this position may be used as the value for the `zero_reference_position`. The output will look similar to the following:
uk: Існуючі конфігурації, що використовують параметр `relative_reference_index`, необхідно оновити, щоб використовувати `zero_reference_position`. Відповідь на команду gcode [BED_MESH_OUTPUT PGP=1](#output) включатиме координату (X, Y), пов’язану з індексом; цю позицію можна використовувати як значення для `zero_reference_position`. Результат виглядатиме приблизно так:

source: // bed_mesh: generated points // Index | Tool Adjusted | Probe // 0 | (1.0, 1.0) | (24.0, 6.0) // 1 | (36.7, 1.0) | (59.7, 6.0) // 2 | (72.3, 1.0) | (95.3, 6.0) // 3 | (108.0, 1.0) | (131.0, 6.0) ... (additional generated points) // bed_mesh: relative_reference_index 24 is (131.5, 108.0)
uk: // bed_mesh: згенеровані точки // Індекс | Інструмент налаштований | Зонд // 0 | (1,0, 1,0) | (24,0, 6,0) // 1 | (36,7, 1,0) | (59,7, 6,0) // 2 | (72,3, 1,0) | (95,3, 6,0) // 3 | (108,0, 1,0) | (131,0, 6,0) ... (додаткові згенеровані бали) // bed_mesh: relative_reference_index 24 дорівнює (131,5, 108,0)

source: *Note: The above output is also printed in `klippy.log` during initialization.*
uk: *Примітка. Наведені вище результати також друкуються в `klippy.log` під час ініціалізації.*

source: Using the example above we see that the `relative_reference_index` is printed along with its coordinate. Thus the `zero_reference_position` is `131.5, 108`.
uk: Використовуючи наведений вище приклад, ми бачимо, що `relative_reference_index` друкується разом із його координатою. Таким чином, `zero_reference_position` становить `131,5, 108`.

source: Adaptive Meshes
uk: Адаптивні сітки

source: Adaptive bed meshing is a way to speed up the bed mesh generation by only probing the area of the bed used by the objects being printed. When used, the method will automatically adjust the mesh parameters based on the area occupied by the defined print objects.
uk: Адаптивна сітка ліжка — це спосіб прискорити генерацію сітки ліжка, досліджуючи лише область ліжка, яку використовують об’єкти, що друкуються. Під час використання метод автоматично регулює параметри сітки на основі площі, зайнятої визначеними об’єктами друку.

source: The adapted mesh area will be computed from the area defined by the boundaries of all the defined print objects so it covers every object, including any margins defined in the configuration. After the area is computed, the number of probe points will be scaled down based on the ratio of the default mesh area and the adapted mesh area. To illustrate this consider the following example:
uk: Адаптована площа сітки буде обчислена з області, визначеної межами всіх визначених об’єктів друку, щоб вона охоплювала кожен об’єкт, включаючи будь-які поля, визначені в конфігурації. Після обчислення площі кількість точок зондування буде зменшено на основі співвідношення площі сітки за замовчуванням і адаптованої площі сітки. Щоб проілюструвати це, розглянемо такий приклад:

source: For a 150mmx150mm bed with `mesh_min` set to `25,25` and `mesh_max` set to `125,125`, the default mesh area is a 100mmx100mm square. An adapted mesh area of `50,50` means a ratio of `0.5x0.5` between the adapted area and default mesh area.
uk: Для ліжка розміром 150 мм x 150 мм із значенням `mesh_min`, установленим на `25,25` і `mesh_max`, встановленим на `125,125`, площа сітки за замовчуванням становить квадрат 100 мм x 100 мм. Адаптована площа сітки «50,50» означає співвідношення «0,5x0,5» між адаптованою площею та площею сітки за замовчуванням.

source: If the `bed_mesh` configuration specified `probe_count` as `7x7`, the adapted bed mesh will use 4x4 probe points (7 * 0.5 rounded up).
uk: Якщо конфігурація `bed_mesh` вказала `probe_count` як `7x7`, адаптована сітка ліжка використовуватиме 4x4 точки зонда (7 * 0,5 округлено в більшу сторону).

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 adaptive_margin: 5
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 adaptive_margin: 5

source: `adaptive_margin` *Default Value: 0* Margin (in mm) to add around the area of the bed used by the defined objects. The diagram below shows the adapted bed mesh area with an `adaptive_margin` of 5mm. The adapted mesh area (area in green) is computed as the used bed area (area in blue) plus the defined margin.
uk: `adaptive_margin` *Значення за замовчуванням: 0* Поле (у мм), яке додається навколо площі ложа, що використовується визначеними об’єктами. На діаграмі нижче показано адаптовану площу сітки ліжка з `adaptive_margin` 5 мм. Адаптована площа сітки (область зеленого кольору) обчислюється як використана площа грядки (область синього кольору) плюс визначений запас.

source: By nature, adaptive bed meshes use the objects defined by the Gcode file being printed. Therefore, it is expected that each Gcode file will generate a mesh that probes a different area of the print bed. Therefore, adapted bed meshes should not be re-used. The expectation is that a new mesh will be generated for each print if adaptive meshing is used.
uk: За своєю природою адаптивні ліжкові сітки використовують об’єкти, визначені файлом Gcode, який друкується. Таким чином, очікується, що кожен файл Gcode генеруватиме сітку, яка досліджує іншу область друкарської поверхні. Тому адаптовані сітки для ліжок не можна використовувати повторно. Очікується, що нова сітка буде створена для кожного друку, якщо використовується адаптивна сітка.

source: It is also important to consider that adaptive bed meshing is best used on machines that can normally probe the entire bed and achieve a maximum variance less than or equal to 1 layer height. Machines with mechanical issues that a full bed mesh normally compensates for may have undesirable results when attempting print moves **outside** of the probed area. If a full bed mesh has a variance greater than 1 layer height, caution must be taken when using adaptive bed meshes and attempting print moves outside of the meshed area.
uk: Важливо також враховувати, що адаптивну сітку шару найкраще використовувати на машинах, які зазвичай можуть досліджувати весь шар і досягати максимальної дисперсії, меншої або рівної 1 висоті шару. Машини з механічними проблемами, які зазвичай компенсує повна сітка, можуть мати небажані результати під час спроб друку рухатися **поза** зони зондування. Якщо повна сітка має дисперсію, що перевищує 1 висоту шару, слід бути обережним, використовуючи адаптивні сітки та намагаючись друкувати за межами сітчастої області.

source: This is useful for printers with multiple independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change. Offsets should be specified relative to the primary extruder. That is, a positive X offset should be specified if the secondary extruder is mounted to the right of the primary extruder, a positive Y offset should be specified if the secondary extruder is mounted "behind" the primary extruder, and a positive ZFADE offset should be specified if the secondary extruder's nozzle is above the primary extruder's.
uk: Це корисно для принтерів із декількома незалежними екструдерами, оскільки зсув необхідний для правильного коригування Z після зміни інструменту. Зміщення слід вказати відносно первинного екструдера. Тобто, якщо вторинний екструдер встановлено праворуч від первинного екструдера, слід вказати позитивне зміщення по осі X, якщо вторинний екструдер встановлено «позаду» первинного екструдера, має бути вказано позитивне зміщення по осі Y, а позитивне зміщення по ZFADE має вказується, якщо сопло вторинного екструдера знаходиться над соплом первинного екструдера.

source: Note that a ZFADE offset does *NOT* directly apply additional adjustment. It is intended to compensate for a `gcode offset` when [mesh fade](#mesh-fade) is enabled. For example, if a secondary extruder is higher than the primary and needs a negative gcode offset, ie: `SET_GCODE_OFFSET Z=-.2`, it can be accounted for in `bed_mesh` with `BED_MESH_OFFSET ZFADE=.2`.
uk: Зауважте, що зміщення ZFADE *НЕ* безпосередньо застосовує додаткові налаштування. Він призначений для компенсації `зсуву gcode`, коли ввімкнено [mesh fade](#mesh-fade). Наприклад, якщо вторинний екструдер вищий за основний і потребує від’ємного зсуву gcode, тобто: `SET_GCODE_OFFSET Z=-.2`, це можна врахувати в `bed_mesh` з `BED_MESH_OFFSET ZFADE=.2`.

source: `mesh_max: 240, 198` *Required* The probed coordinate farthest from the origin. This is not necessarily the last point probed, as the probing process occurs in a zig-zag fashion. As with `mesh_min`, this coordinate is relative to the probe's location.
uk: `mesh_max: 240, 198` *Обов’язковий* Найдальша від початку координат досліджувати координата. Це не обов’язково остання досліджувана точка, оскільки процес зондування відбувається зигзагоподібно. Як і у випадку з `mesh_min`, ця координата є відносною розташування зонда.

source: Surface Scans
uk: Сканування поверхні

source: Some probes, such as the [Eddy Current Probe](./Eddy_Probe.md), are capable of "scanning" the surface of the bed. That is, these probes can sample a mesh without lifting the tool between samples. To activate scanning mode, the `METHOD=scan` or `METHOD=rapid_scan` probe parameter should be passed in the `BED_MESH_CALIBRATE` gcode command.
uk: Деякі зонди, такі як [Вихровий зонд](./Eddy_Probe.md), здатні «сканувати» поверхню ліжка. Тобто ці зонди можуть відбирати сітку, не піднімаючи інструмент між пробами. Щоб увімкнути режим сканування, параметр зонду `METHOD=scan` або `METHOD=rapid_scan` слід передати в команду gcode `BED_MESH_CALIBRATE`.

source: Scan Height
uk: Висота сканування

source: The scan height is set by the `horizontal_move_z` option in `[bed_mesh]`. In addition it can be supplied with the `BED_MESH_CALIBRATE` gcode command via the `HORIZONTAL_MOVE_Z` parameter.
uk: Висота сканування встановлюється параметром `horizontal_move_z` в `[bed_mesh]`. Крім того, його можна надати команді gcode `BED_MESH_CALIBRATE` через параметр `HORIZONTAL_MOVE_Z`.

source: The scan height must be sufficiently low to avoid scanning errors. Typically a height of 2mm (ie: `HORIZONTAL_MOVE_Z=2`) should work well, presuming that the probe is mounted correctly.
uk: Висота сканування має бути достатньо низькою, щоб уникнути помилок сканування. Зазвичай висота 2 мм (тобто: `HORIZONTAL_MOVE_Z=2`) має працювати добре, припускаючи, що зонд встановлено правильно.

source: It should be noted that if the probe is more than 4mm above the surface then the results will be invalid. Thus, scanning is not possible on beds with severe surface deviation or beds with extreme tilt that hasn't been corrected.
uk: Слід зазначити, що якщо зонд знаходиться понад 4 мм над поверхнею, результати будуть недійсними. Таким чином, сканування неможливе на ліжках із сильним відхиленням поверхні або ліжках із екстремальним нахилом, який не було виправлено.

source: Rapid (Continuous) Scanning
uk: Швидке (безперервне) сканування

source: When performing a `rapid_scan` one should keep in mind that the results will have some amount of error. This error should be low enough to be useful on large print areas with reasonably thick layer heights. Some probes may be more prone to error than others.
uk: Виконуючи `rapid_scan`, слід мати на увазі, що результати матимуть певну кількість похибок. Ця помилка має бути достатньо низькою, щоб бути корисною для великих областей друку з досить товстим шаром. Деякі зонди можуть бути більш схильними до помилок, ніж інші.

source: It is not recommended that rapid mode be used to scan a "dense" mesh. Some of the error introduced during a rapid scan may be gaussian noise from the sensor, and a dense mesh will reflect this noise (ie: there will be peaks and valleys).
uk: Не рекомендується використовувати швидкий режим для сканування «щільної» сітки. Деякі помилки, які виникають під час швидкого сканування, можуть бути гаусовим шумом від датчика, і щільна сітка відображатиме цей шум (тобто: будуть піки та спади).

source: Bed Mesh will attempt to optimize the travel path to provide the best possible result based on the configuration. This includes avoiding faulty regions when collecting samples and "overshooting" the mesh when changing direction. This overshoot improves sampling at the edges of a mesh, however it requires that the mesh be configured in a way that allows the tool to travel outside of the mesh.
uk: Bed Mesh намагатиметься оптимізувати шлях руху, щоб забезпечити найкращий можливий результат залежно від конфігурації. Це включає уникнення дефектних областей під час збору зразків і «перевищення» сітки при зміні напрямку. Це перевищення покращує вибірку на краях сітки, однак воно вимагає, щоб сітка була налаштована таким чином, щоб інструмент міг рухатися за межі сітки.

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5 scan_overshoot: 8
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5 scan_overshoot: 8
