Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: uk

source: Basic Configuration
uk: Базова конфігурація

source: Rectangular Beds
uk: Прямокутні ліжка

source: This example assumes a printer with a 250 mm x 220 mm rectangular bed and a probe with an x-offset of 24 mm and y-offset of 5 mm.
uk: У цьому прикладі передбачається, що принтер має прямокутну платформу розміром 250 мм x 220 мм і датчик зі зміщенням по осі Х 24 мм і зміщенням по осі 5 мм.

source: `speed: 120` *Default Value: 50* The speed in which the tool moves between points.
uk: `швидкість: 120` *Значення за замовчуванням: 50* Швидкість, з якою інструмент рухається між точками.

source: `horizontal_move_z: 5` *Default Value: 5* The Z coordinate the probe rises to prior to traveling between points.
uk: `horizontal_move_z: 5` *Значення за замовчуванням: 5* Координата Z, до якої зонд піднімається перед подорожжю між точками.

source: The illustration below demonstrates how the `mesh_min`, `mesh_max`, and `probe_count` options are used to generate probe points. The arrows indicate the direction of the probing procedure, beginning at `mesh_min`. For reference, when the probe is at `mesh_min` the nozzle will be at (11, 1), and when the probe is at `mesh_max`, the nozzle will be at (206, 193).
uk: На ілюстрації нижче показано, як параметри `mesh_min`, `mesh_max` і `probe_count` використовуються для створення точок зондування. Стрілки вказують напрямок процедури зондування, починаючи з `mesh_min`. Для довідки, коли зонд знаходиться на `mesh_min`, сопло буде на (11, 1), а коли зонд на `mesh_max`, сопло буде на (206, 193).

source: Round beds
uk: Круглі ліжка

source: This example assumes a printer equipped with a round bed radius of 100mm. We will use the same probe offsets as the rectangular example, 24 mm on X and 5 mm on Y.
uk: У цьому прикладі передбачається, що принтер оснащений круглою станиною радіусом 100 мм. Ми використовуватимемо ті самі зміщення зонда, що й у прямокутному прикладі, 24 мм на X і 5 мм на Y.

source: `mesh_radius: 75` *Required* The radius of the probed mesh in mm, relative to the `mesh_origin`. Note that the probe's offsets limit the size of the mesh radius. In this example, a radius larger than 76 would move the tool beyond the range of the printer.
uk: `mesh_radius: 75` *Обов’язковий* Радіус досліджуваної сітки в мм відносно `mesh_origin`. Зауважте, що зміщення зонда обмежують розмір радіуса сітки. У цьому прикладі радіус, більший за 76, перемістить інструмент за межі діапазону принтера.

source: `round_probe_count: 5` *Default Value: 5* This is an integer value that defines the maximum number of probed points along the X and Y axes. By "maximum", we mean the number of points probed along the mesh origin. This value must be an odd number, as it is required that the center of the mesh is probed.
uk: `round_probe_count: 5` *Значення за замовчуванням: 5* Це ціле число, яке визначає максимальну кількість досліджуваних точок уздовж осей X і Y. Під «максимумом» ми маємо на увазі кількість точок, досліджених вздовж початку сітки. Це значення має бути непарним числом, оскільки необхідно, щоб центр сітки був досліджений.

source: Advanced Configuration
uk: Розширена конфігурація

source: Below the more advanced configuration options are explained in detail. Each example will build upon the basic rectangular bed configuration shown above. Each of the advanced options apply to round beds in the same manner.
uk: Нижче детально описано більш розширені параметри конфігурації. Кожен приклад базується на базовій прямокутній конфігурації ліжка, показаній вище. Кожна з розширених опцій однаково застосовується до круглих ліжок.

source: Mesh Interpolation
uk: Інтерполяція сітки

source: `algorithm: lagrange` *Default Value: lagrange* The algorithm used to interpolate the mesh. May be `lagrange` or `bicubic`. Lagrange interpolation is capped at 6 probed points as oscillation tends to occur with a larger number of samples. Bicubic interpolation requires a minimum of 4 probed points along each axis, if less than 4 points are specified then lagrange sampling is forced. If `mesh_pps` is set to 0 then this value is ignored as no mesh interpolation is done.
uk: `algorithm: lagrange` *Значення за замовчуванням: lagrange* Алгоритм, який використовується для інтерполяції сітки. Може бути «лагранжа» або «бікубічного». Інтерполяція Лагранжа обмежена 6 досліджуваними точками, оскільки коливання мають тенденцію відбуватися з більшою кількістю зразків. Бікубічна інтерполяція потребує мінімум 4 досліджуваних точок уздовж кожної осі, якщо вказано менше 4 точок, то вибірка Лагранжа виконується примусово. Якщо `mesh_pps` має значення 0, це значення ігнорується, оскільки інтерполяція сітки не виконується.

source: `bicubic_tension: 0.2` *Default Value: 0.2* If the `algorithm` option is set to bicubic it is possible to specify the tension value. The higher the tension the more slope is interpolated. Be careful when adjusting this, as higher values also create more overshoot, which will result in interpolated values higher or lower than your probed points.
uk: `bicubic_tension: 0,2` *Значення за замовчуванням: 0,2* Якщо для параметра `algorithm` встановлено значення bicubic, можна вказати значення натягу. Чим вище натяг, тим більший нахил інтерполюється. Будьте обережні, регулюючи це, оскільки вищі значення також створюють більше перевищення, що призведе до того, що інтерпольовані значення будуть вищими або нижчими, ніж ваші вимірювані точки.

source: The illustration below shows how the options above are used to generate an interpolated mesh.
uk: На ілюстрації нижче показано, як наведені вище параметри використовуються для створення інтерпольованої сітки.

source: Move Splitting
uk: Перемістити розділення

source: `move_check_distance: 5` *Default Value: 5* The minimum distance to check for the desired change in Z before performing a split. In this example, a move longer than 5mm will be traversed by the algorithm. Each 5mm a mesh Z lookup will occur, comparing it with the Z value of the previous move. If the delta meets the threshold set by `split_delta_z`, the move will be split and traversal will continue. This process repeats until the end of the move is reached, where a final adjustment will be applied. Moves shorter than the `move_check_distance` have the correct Z adjustment applied directly to the move without traversal or splitting.
uk: `move_check_distance: 5` *Значення за замовчуванням: 5* Мінімальна відстань для перевірки бажаної зміни Z перед виконанням поділу. У цьому прикладі алгоритм обійде переміщення довжиною понад 5 мм. Через кожні 5 мм буде відбуватися пошук Z сітки, порівнюючи його зі значенням Z попереднього ходу. Якщо дельта досягає порогового значення, встановленого `split_delta_z`, рух буде розділено, а обхід продовжиться. Цей процес повторюється до кінця ходу, де буде застосовано остаточне коригування. Ходи, менші за `move_check_distance`, мають правильне коригування Z, застосоване безпосередньо до ходу без обходу чи поділу.

source: `split_delta_z: .025` *Default Value: .025* As mentioned above, this is the minimum deviation required to trigger a move split. In this example, any Z value with a deviation +/- .025mm will trigger a split.
uk: `split_delta_z: .025` *Значення за замовчуванням: .025* Як згадувалося вище, це мінімальне відхилення, необхідне для запуску розділення ходу. У цьому прикладі будь-яке значення Z із відхиленням +/- 0,025 мм ініціює розділення.

source: Mesh Fade
uk: Сітка Fade

source: When "fade" is enabled Z adjustment is phased out over a distance defined by the configuration. This is accomplished by applying small adjustments to the layer height, either increasing or decreasing depending on the shape of the bed. When fade has completed, Z adjustment is no longer applied, allowing the top of the print to be flat rather than mirror the shape of the bed. Fade also may have some undesirable traits, if you fade too quickly it can result in visible artifacts on the print. Also, if your bed is significantly warped, fade can shrink or stretch the Z height of the print. As such, fade is disabled by default.
uk: Коли ввімкнено «згасання», коригування Z поступово припиняється на відстані, визначеній конфігурацією. Це досягається шляхом застосування невеликих коригувань висоти шару, або збільшення, або зменшення залежно від форми ліжка. Коли вицвітання завершено, регулювання Z більше не застосовується, дозволяючи верхній частині відбитка бути плоским, а не віддзеркалювати форму ложа. Вицвітання також може мати деякі небажані риси, якщо ви вицвітаєте занадто швидко, це може призвести до видимих артефактів на відбитку. Крім того, якщо ваше ліжко значно деформоване, вицвітання може зменшити або розтягнути висоту Z друку. Таким чином, зникнення вимкнено за замовчуванням.

source: `fade_start: 1` *Default Value: 1* The Z height in which to start phasing out adjustment. It is a good idea to get a few layers down before starting the fade process.
uk: `fade_start: 1` *Значення за замовчуванням: 1* Висота Z, з якої починається поетапне припинення коригування. Рекомендується нанести кілька шарів перед початком процесу вицвітання.

source: `fade_end: 10` *Default Value: 0* The Z height in which fade should complete. If this value is lower than `fade_start` then fade is disabled. This value may be adjusted depending on how warped the print surface is. A significantly warped surface should fade out over a longer distance. A near flat surface may be able to reduce this value to phase out more quickly. 10mm is a sane value to begin with if using the default value of 1 for `fade_start`.
uk: `fade_end: 10` *Значення за замовчуванням: 0* Висота Z, на якій має завершитися згасання. Якщо це значення менше, ніж `fade_start`, тоді згасання вимкнено. Це значення можна регулювати залежно від того, наскільки викривлена поверхня для друку. Значно деформована поверхня повинна зникати на більшій відстані. Майже плоска поверхня може зменшити це значення, щоб швидше припинити роботу. 10 мм — це розумне значення для початку, якщо використовувати значення за замовчуванням 1 для `fade_start`.

source: Faulty Regions
uk: Несправні регіони

source: It is possible for some areas of a bed to report inaccurate results when probing due to a "fault" at specific locations. The best example of this are beds with series of integrated magnets used to retain removable steel sheets. The magnetic field at and around these magnets may cause an inductive probe to trigger at a distance higher or lower than it would otherwise, resulting in a mesh that does not accurately represent the surface at these locations. **Note: This should not be confused with probe location bias, which produces inaccurate results across the entire bed.**
uk: Деякі ділянки ліжка можуть повідомляти про неточні результати під час зондування через «несправність» у певних місцях. Найкращим прикладом цього є ліжка з рядом інтегрованих магнітів, які використовуються для утримання знімних сталевих листів. Магнітне поле на цих магнітах і навколо них може призвести до спрацьовування індуктивного зонда на відстані, вищій або нижчій, ніж це було б у іншому випадку, що призведе до сітки, яка не точно представляє поверхню в цих місцях. **Примітка: це не слід плутати зі зміщенням розташування датчика, яке дає неточні результати по всьому ліжку.**

source: The `faulty_region` options may be configured to compensate for this affect. If a generated point lies within a faulty region bed mesh will attempt to probe up to 4 points at the boundaries of this region. These probed values will be averaged and inserted in the mesh as the Z value at the generated (X, Y) coordinate.
uk: Параметри `faulty_region` можуть бути налаштовані для компенсації цього впливу. Якщо згенерована точка лежить у несправній області, сітка ліжка намагатиметься дослідити до 4 точок на межах цієї області. Ці досліджувані значення будуть усереднені та вставлені в сітку як значення Z у створеній (X, Y) координаті.

source: `faulty_region_{1...99}_min` `faulty_region_{1..99}_max` *Default Value: None (disabled)* Faulty Regions are defined in a way similar to that of mesh itself, where minimum and maximum (X, Y) coordinates must be specified for each region. A faulty region may extend outside of a mesh, however the alternate points generated will always be within the mesh boundary. No two regions may overlap.
uk: `faulty_region_{1...99}_min` `faulty_region_{1..99}_max` *Значення за замовчуванням: Немає (вимкнено)* Несправні області визначаються подібно до самої сітки, де мінімум і максимум (X , Y) необхідно вказати координати для кожного регіону. Дефектна область може виходити за межі сітки, однак згенеровані альтернативні точки завжди будуть у межах сітки. Жодні два регіони не можуть перетинатися.

source: The image below illustrates how replacement points are generated when a generated point lies within a faulty region. The regions shown match those in the sample config above. The replacement points and their coordinates are identified in green.
uk: На зображенні нижче показано, як генеруються точки заміни, коли згенерована точка лежить у дефектній області. Показані регіони збігаються з наведеними вище зразками конфігурації. Точки заміни та їх координати позначені зеленим кольором.

source: Bed Mesh Gcodes
uk: G-коди сітки для ліжка

source: Calibration
uk: Калібрування

source: It is possible to specify mesh parameters to modify the probed area. The following parameters are available:
uk: Можна вказати параметри сітки для зміни досліджуваної області. Доступні такі параметри:

source: Rectangular beds (cartesian):
uk: Грядки прямокутні (декартові):

source: Round beds (delta):
uk: Круглі грядки (дельта):

source: All beds:
uk: Всі ліжка:

source: Profiles
uk: Профілі

source: Any other saved profile can be removed in the same fashion, replacing *default* with the named profile you wish to remove.
uk: Будь-який інший збережений профіль можна видалити таким же чином, замінивши *default* на названий профіль, який ви хочете видалити.

source: Output
uk: Вихід

source: Outputs the current mesh state to the terminal. Note that the mesh itself is output
uk: Виводить поточний стан сітки на термінал. Зверніть увагу, що виводиться сама сітка

source: The PGP parameter is shorthand for "Print Generated Points". If `PGP=1` is set, the generated probed points will be output to the terminal:
uk: Параметр PGP є скороченням для «Друк згенерованих точок». Якщо встановлено `PGP=1`, згенеровані перевірені точки будуть виведені на термінал:

source: The "Tool Adjusted" points refer to the nozzle location for each point, and the "Probe" points refer to the probe location. Note that when manually probing the "Probe" points will refer to both the tool and nozzle locations.
uk: Точки «Налаштований інструмент» стосуються розташування сопла для кожної точки, а точки «Зонд» стосуються розташування зонда. Зауважте, що під час вимірювання вручну точки «Зонд» стосуватимуться розташування як інструмента, так і насадки.

source: Clear Mesh State
uk: Очистити стан сітки

source: This gcode may be used to clear the internal mesh state.
uk: Цей gcode можна використовувати для очищення внутрішнього стану сітки.

source: Apply X/Y offsets
uk: Застосувати зміщення X/Y

source: // bed_mesh: generated points // Index | Tool Adjusted | Probe // 0 | (11.0, 1.0) | (35.0, 6.0) // 1 | (62.2, 1.0) | (86.2, 6.0) // 2 | (113.5, 1.0) | (137.5, 6.0) // 3 | (164.8, 1.0) | (188.8, 6.0) // 4 | (216.0, 1.0) | (240.0, 6.0) // 5 | (216.0, 97.0) | (240.0, 102.0) // 6 | (164.8, 97.0) | (188.8, 102.0) // 7 | (113.5, 97.0) | (137.5, 102.0) // 8 | (62.2, 97.0) | (86.2, 102.0) // 9 | (11.0, 97.0) | (35.0, 102.0) // 10 | (11.0, 193.0) | (35.0, 198.0) // 11 | (62.2, 193.0) | (86.2, 198.0) // 12 | (113.5, 193.0) | (137.5, 198.0) // 13 | (164.8, 193.0) | (188.8, 198.0) // 14 | (216.0, 193.0) | (240.0, 198.0)
uk: // bed_mesh: згенеровані точки // Індекс | Інструмент налаштований | Зонд // 0 | (11,0, 1,0) | (35,0, 6,0) // 1 | (62,2, 1,0) | (86,2, 6,0) // 2 | (113,5, 1,0) | (137,5, 6,0) // 3 | (164,8, 1,0) | (188,8, 6,0) // 4 | (216,0, 1,0) | (240,0, 6,0) // 5 | (216,0, 97,0) | (240,0, 102,0) // 6 | (164,8, 97,0) | (188,8, 102,0) // 7 | (113,5, 97,0) | (137,5, 102,0) // 8 | (62,2, 97,0) | (86,2, 102,0) // 9 | (11,0, 97,0) | (35,0, 102,0) // 10 | (11,0, 193,0) | (35,0, 198,0) // 11 | (62,2, 193,0) | (86,2, 198,0) // 12 | (113,5, 193,0) | (137,5, 198,0) // 13 | (164,8, 193,0) | (188,8, 198,0) // 14 | (216,0, 193,0) | (240,0, 198,0)

source: Bed Mesh
uk: Мапа поверхні

source: Initiates the probing procedure for Bed Mesh Calibration.
uk: Ініціює процедуру зондування для калібрування сітки ліжка.

source: Bed Mesh works by intercepting gcode move commands and applying a transform to their Z coordinate. Long moves must be split into smaller moves to correctly follow the shape of the bed. The options below control the splitting behavior.
uk: Bed Mesh працює, перехоплюючи команди переміщення gcode та застосовуючи трансформацію до їх координати Z. Довгі рухи необхідно розділити на менші, щоб правильно відповідати формі ліжка. Параметри нижче керують поведінкою розділення.

source: Prior to Mesh Calibration you will need to be sure that your Probe's Z-Offset is calibrated. If using an endstop for Z homing it will need to be calibrated as well. See [Probe Calibrate](Probe_Calibrate.md) and Z_ENDSTOP_CALIBRATE in [Manual Level](Manual_Level.md) for more information.
uk: Перед калібруванням сітки вам потрібно буде переконатися, що Z-зсув вашого зонда відкалібровано. Якщо використовується кінцевий упор для наведення по осі Z, його також потрібно буде відкалібрувати. Для отримання додаткової інформації див. [Probe Calibrate](Probe_Calibrate.md) і Z_ENDSTOP_CALIBRATE у [Manual Level](Manual_Level.md).

source: See the configuration documentation above for details on how each parameter applies to the mesh.
uk: Перегляньте документацію щодо конфігурації вище, щоб дізнатися, як кожен параметр застосовується до сітки.

source: After a BED_MESH_CALIBRATE has been performed, it is possible to save the current mesh state into a named profile. This makes it possible to load a mesh without re-probing the bed. After a profile has been saved using `BED_MESH_PROFILE SAVE=<name>` the `SAVE_CONFIG` gcode may be executed to write the profile to printer.cfg.
uk: Після виконання BED_MESH_CALIBRATE можна зберегти поточний стан сітки в іменованому профілі. Це дає можливість завантажувати сітку без повторного зондування ложа. Після того як профіль було збережено за допомогою `BED_MESH_PROFILE SAVE=<name>`, можна виконати gcode `SAVE_CONFIG`, щоб записати профіль у printer.cfg.

source: Profiles can be loaded by executing `BED_MESH_PROFILE LOAD=<name>`.
uk: Профілі можна завантажити, виконавши `BED_MESH_PROFILE LOAD=<name>`.

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3

source: `mesh_min: 35, 6` *Required* The first probed coordinate, nearest to the origin. This coordinate is relative to the probe's location.
uk: `mesh_min: 35, 6` *Обов’язковий* Перша досліджена координата, найближча до початку координат. Ця координата відноситься до місця розташування зонда.

source: `probe_count: 5, 3` *Default Value: 3, 3* The number of points to probe on each axis, specified as X, Y integer values. In this example 5 points will be probed along the X axis, with 3 points along the Y axis, for a total of 15 probed points. Note that if you wanted a square grid, for example 3x3, this could be specified as a single integer value that is used for both axes, ie `probe_count: 3`. Note that a mesh requires a minimum probe_count of 3 along each axis.
uk: `probe_count: 5, 3` *Значення за замовчуванням: 3, 3* Кількість точок для перевірки на кожній осі, указана як цілі числа X, Y. У цьому прикладі 5 точок буде досліджено вздовж осі X і 3 точки вздовж осі Y, тобто 15 точок. Зверніть увагу: якщо вам потрібна квадратна сітка, наприклад 3x3, це можна вказати як єдине ціле число, яке використовується для обох осей, тобто `probe_count: 3`. Зауважте, що сітка вимагає мінімум probe_count 3 уздовж кожної осі.

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_radius: 75 mesh_origin: 0, 0 round_probe_count: 5
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_radius: 75 mesh_origin: 0, 0 round_probe_count: 5

source: `mesh_origin: 0, 0` *Default Value: 0, 0* The center point of the mesh. This coordinate is relative to the probe's location. While the default is 0, 0, it may be useful to adjust the origin in an effort to probe a larger portion of the bed. See the illustration below.
uk: `mesh_origin: 0, 0` *Значення за замовчуванням: 0, 0* Центральна точка сітки. Ця координата відноситься до місця розташування зонда. Хоча за замовчуванням встановлено значення 0, 0, може бути корисно налаштувати вихідну точку, щоб досліджувати більшу частину дна. Дивіться ілюстрацію нижче.

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 mesh_pps: 2, 3 algorithm: bicubic bicubic_tension: 0.2
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 mesh_pps: 2, 3 алгоритм: бікубічний бікубічний_натяг: 0,2

source: `mesh_pps: 2, 3` *Default Value: 2, 2* The `mesh_pps` option is shorthand for Mesh Points Per Segment. This option specifies how many points to interpolate for each segment along the X and Y axes. Consider a 'segment' to be the space between each probed point. Like `probe_count`, `mesh_pps` is specified as an X, Y integer pair, and also may be specified a single integer that is applied to both axes. In this example there are 4 segments along the X axis and 2 segments along the Y axis. This evaluates to 8 interpolated points along X, 6 interpolated points along Y, which results in a 13x8 mesh. Note that if mesh_pps is set to 0 then mesh interpolation is disabled and the probed matrix will be sampled directly.
uk: `mesh_pps: 2, 3` *Значення за замовчуванням: 2, 2* Параметр `mesh_pps` є скороченням для точок сітки на сегмент. Цей параметр визначає, скільки точок інтерполювати для кожного сегмента вздовж осей X і Y. Вважайте «сегмент» простором між кожною досліджуваною точкою. Як і `probe_count`, `mesh_pps` вказується як пара цілих чисел X, Y, а також може бути вказано одне ціле число, яке застосовується до обох осей. У цьому прикладі є 4 сегменти вздовж осі X і 2 сегменти вздовж осі Y. Це означає 8 інтерпольованих точок уздовж X, 6 інтерпольованих точок уздовж Y, що призводить до сітки 13x8. Зауважте, що якщо mesh_pps встановлено на 0, то інтерполяція сітки вимкнена, а досліджувана матриця буде взята безпосередньо.

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 move_check_distance: 5 split_delta_z: .025
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 move_check_distance: 5 split_delta_z: 0,025

source: [bed_mesh] speed: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 fade_start: 1 fade_end: 10 fade_target: 0
uk: [bed_mesh] швидкість: 120 horizontal_move_z: 5 mesh_min: 35, 6 mesh_max: 240, 198 probe_count: 5, 3 fade_start: 1 fade_end: 10 fade_target: 0
