Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: uk

source: `scan_overshoot` *Default Value: 0 (disabled)* The maximum amount of travel (in mm) available outside of the mesh. For rectangular beds this applies to travel on the X axis, and for round beds it applies to the entire radius. The tool must be able to travel the amount specified outside of the mesh. This value is used to optimize the travel path when performing a "rapid scan". The minimum value that may be specified is 1. The default is no overshoot.
uk: `scan_overshoot` *Значення за замовчуванням: 0 (вимкнено)* Максимальна величина ходу (у мм), доступна за межами сітки. Для прямокутних ліжок це стосується переміщення по осі X, а для круглих ліжок – по всьому радіусу. Інструмент повинен мати можливість рухатися за межами сітки на вказану величину. Це значення використовується для оптимізації шляху руху під час виконання «швидкого сканування». Мінімальне значення, яке можна вказати, дорівнює 1. За замовчуванням перевищення немає.

source: If no scan overshoot is configured then travel path optimization will not be applied to changes in direction.
uk: Якщо перевищення сканування не налаштовано, оптимізація шляху руху не застосовуватиметься до змін напрямку.

source: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[manual | automatic | scan | rapid_scan] \ [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=[0|1] \ [ADAPTIVE_MARGIN=<value>]` *Default Profile: default* *Default Method: automatic if a probe is detected, otherwise manual* *Default Adaptive: 0* *Default Adaptive Margin: 0*
uk: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[посібник | автоматичний | скам | rapid_scan] \ [<probe_parameter>=<value>] [<mesh_parameter>=<value>] [ADAPTIVE=[0|1] \ [ADAPTIVE_MARGIN=<value>]` *Профіль за замовчуванням: за замовчуванням* *Методи за замовчуванням: автоматичний якщо виявлено зонд , інакше ручну* *Адаптивний за замовчуванням: 0* *Адаптивний поля за замовчуванням: 0*

source: The mesh will be saved into a profile specified by the `PROFILE` parameter, or `default` if unspecified. The `METHOD` parameter takes one of the following values:
uk: Сітка буде збережена в профілі, визначеному параметром `PROFILE`, або `default`, якщо не вказано. Параметр `METHOD` приймає одне з таких значень:

source: `METHOD=manual`: enables manual probing using the nozzle and the paper test
uk: `METHOD=manual`: дозволяє ручне зондування за допомогою насадки та паперового тесту

source: `METHOD=automatic`: Automatic (standard) probing. This is the default.
uk: `METHOD=automatic`: Автоматичне (стандартне) зондування. Це значення за умовчанням.

source: `METHOD=scan`: Enables surface scanning. The tool will pause over each position to collect a sample.
uk: `METHOD=scan`: Вмикає сканування поверхні. Інструмент зупинятиметься над кожною позицією, щоб зібрати зразок.

source: `METHOD=rapid_scan`: Enables continuous surface scanning.
uk: `METHOD=rapid_scan`: вмикає безперервне сканування поверхні.

source: XY positions are automatically adjusted to include the X and/or Y offsets when a probing method other than `manual` is selected.
uk: Положення XY автоматично налаштовуються, щоб включити зміщення X і/або Y, коли вибрано метод зондування, відмінний від `«ручного»`.

source: Bed Mesh Webhooks APIs
uk: API Bed Mesh Webhooks

source: Dumping mesh data
uk: Дамп даних сітки

source: Dumps the configuration and state for the current mesh and all saved profiles.
uk: Дамп конфігурації та стану для поточної сітки та всіх збережених профілів.

source: The `dump_mesh` endpoint takes one optional parameter, `mesh_args`. This parameter must be an object, where the keys and values are parameters available to [BED_MESH_CALIBRATE](#bed_mesh_calibrate). This will update the mesh configuration and probe points using the supplied parameters prior to returning the result. It is recommended to omit mesh parameters unless it is desired to visualize the probe points and/or travel path before performing `BED_MESH_CALIBRATE`.
uk: Кінцева точка `dump_mesh` приймає один необов’язковий параметр, `mesh_args`. Цей параметр має бути об’єктом, де ключі та значення є параметрами, доступними для [BED_MESH_CALIBRATE](#bed_mesh_calibrate). Це оновить конфігурацію сітки та точки зонду за допомогою наданих параметрів перед поверненням результату. Рекомендується опускати параметри сітки, якщо не потрібно візуалізувати точки зонда та/або траєкторію перед виконанням `BED_MESH_CALIBRATE`.

source: Visualization and analysis
uk: Візуалізація та аналіз

source: Most users will likely find that the visualizers included with applications such as Mainsail, Fluidd, and Octoprint are sufficient for basic analysis. However, Klipper's `scripts` folder contains the `graph_mesh.py` script that may be used to perform additional visualizations and more detailed analysis, particularly useful for debugging hardware or the results produced by `bed_mesh`:
uk: Більшість користувачів, ймовірно, виявить, що візуалізаторів, які входять до таких програм, як Mainsail, Fluidd і Octoprint, достатньо для базового аналізу. Проте папка `scripts` Klipper містить сценарій `graph_mesh.py`, який можна використовувати для виконання додаткової візуалізації та більш детального аналізу, особливо корисного для налагодження обладнання або результатів, створених ` bed_mesh`:

source: usage: graph_mesh.py [-h] {list,plot,analyze,dump} ... Graph Bed Mesh Data positional arguments: {list,plot,analyze,dump} list List available plot types plot Plot a specified type analyze Perform analysis on mesh data dump Dump API response to json file options: -h, --help show this help message and exit
uk: використання: графік_mesh.py [-h] {list,plot,analyze,dump} ... Graph Bed Mesh Дані позиціональні аргументи: {list,plot,analyze,dump} список доступних типів ділянок доля Plot вказаний тип аналіз Виконувати аналіз даних сітки Dump API відповідь на файл json варіанти: -h, --help показати це повідомлення про допомогу і вихід

source: Pre-requisites
uk: Передумови

source: Like most graphing tools provided by Klipper, `graph_mesh.py` requires the `matplotlib` and `numpy` python dependencies. In addition, connecting to Klipper via Moonraker's websocket requires the `websockets` python dependency. While all visualizations can be output to an `svg` file, most of the visualizations offered by `graph_mesh.py` are better viewed in live preview mode on a desktop class PC. For example, the 3D visualizations may be rotated and zoomed in preview mode, and the path visualizations can optionally be animated in preview mode.
uk: Як і більшість графічних інструментів, наданих Klipper, `graph_mesh.py` вимагає залежностей `matplotlib` і `numpy` python. Крім того, для підключення до Klipper через веб-сокет Moonraker потрібна залежність `websockets` python. Хоча всі візуалізації можна виводити у файл `svg`, більшість візуалізацій, які пропонує `graph_mesh.py`, краще переглядати в режимі попереднього перегляду на настільному ПК. Наприклад, тривимірні візуалізації можна обертати та масштабувати в режимі попереднього перегляду, а візуалізації шляху можна додатково анімувати в режимі попереднього перегляду.

source: Plotting Mesh data
uk: Побудова даних Mesh

source: The `graph_mesh.py` tool can plot several types of visualizations. Available types can be shown by running `graph_mesh.py list`:
uk: Інструмент `graph_mesh.py` може створювати кілька типів візуалізацій. Доступні типи можна показати, запустивши `graph_mesh.py list`:

source: graph_mesh.py list points Plot original generated points path Plot probe travel path rapid Plot rapid scan travel path probedz Plot probed Z values meshz Plot mesh Z values overlay Plots the current probed mesh overlaid with a profile delta Plots the delta between current probed mesh and a profile
uk: список графімеш.py окуляри Plot оригінальні генеровані точки Шлях Плот пробе подорожі шлях порназоркі Plot швидкий сканування шляху Пробед Plot probed Z значення свінгери Plot сітки Z значення накладка Плоти поточної прокладної сітки перекриття профілю дельта Плоти дельти між поточною прокладкою сітки і профілю

source: Several options are available when plotting visualizations:
uk: Деякі варіанти доступні при візуалізації ділянки:

source: usage: graph_mesh.py plot [-h] [-a] [-s] [-p PROFILE_NAME] [-o OUTPUT] <plot type> <input> positional arguments: <plot type> Type of data to graph <input> Path/url to Klipper Socket or path to json file options: -h, --help show this help message and exit -a, --animate Animate paths in live preview -s, --scale-plot Use axis limits reported by Klipper to scale plot X/Y -p PROFILE_NAME, --profile-name PROFILE_NAME Optional name of a profile to plot for 'probedz' -o OUTPUT, --output OUTPUT Output file path
uk: використання: графімеш.py plot [-h] [-a] [-s] [-p PROFILE_NAME] [-o OUTPUT] <plot type> <input> позиціональні аргументи: <plot тип> Тип даних до графіка <input> Патент/url на Klipper Socket або шлях до json файл варіанти: -h, --help показати це повідомлення про допомогу і вихід -a, --анімат Аніматові доріжки в живому попередньому перегляді --s, - масштаб-plot Використовуйте діапазони осі, які повідомляються Klipper, щоб масштабувати ділянку X / Y -р ПРОФІЛЕ_NAME, --профайл-ім'я ПРОФІЛЕ_NAME Додаткове найменування профілю для 'probedz Р -o OUTPUT, - вихід Вихідний шлях файлу

source: Below is a description of each argument:
uk: Нижче опис кожного аргумента:

source: `plot type`: A required positional argument designating the type of visualization to generate. Must be one of the types output by the `graph_mesh.py list` command.
uk: `plot type`: Потрібні аргументи для створення типу візуалізації. Повинен бути одним з типів `graph_mesh.py list` команди.

source: `input`: A required positional argument containing a path or url to the input source. This must be one of the following:
uk: ` вхід`: Необхідний аргумент позиціонування, що містить шлях або виворіт на джерело введення. Це повинно бути одне з наступних:

source: A path to Klipper's Unix Domain Socket
uk: Шлях до Unix Domain Socket Klipper

source: A url to an instance of Moonraker
uk: URL-адреса екземпляра Moonraker

source: A path to a json file produced by `graph_mesh.py dump <input>`
uk: Шлях до файлу json, створеного `graph_mesh.py dump<input>`

source: `-a`: Optional animation for the `path` and `rapid` visualization types. Animations only apply to a live preview.
uk: `-a`: додаткова анімація для типів візуалізації `path` і `rapid`. Анімації застосовуються лише до попереднього перегляду в реальному часі.

source: `-s`: Optionally scales a plot using the `axis_minimum` and `axis_maximum` values reported by Klipper's `toolhead` object when the dump file was generated.
uk: `-s`: необов’язково масштабує графік, використовуючи значення `axis_minimum` і `axis_maximum`, які повідомляються об'єктом `toolhead` Klipper під час створення файлу дампа.

source: `-p`: A profile name that may be specified when generating the `probedz` 3D mesh visualization. When generating an `overlay` or `delta` visualization this argument must be provided.
uk: `-p`: ім'я профілю, яке можна вказати під час генерації візуалізації тривимірної сітки `probedz`. Під час генерації візуалізації `overlay` або `delta` візуалізації цей аргумент має бути надано.

source: `-o`: An optional file path indicating that the script should save the visualization to this location rather than run in preview mode. Images are saved in `svg` format.
uk: `-o`: додатковий шлях до файлу, який вказує, що сценарій має зберегти візуалізацію в цьому місці, а не запускатися в режимі попереднього перегляду. Зображення зберігаються у форматі `svg`.

source: For example, to plot an animated rapid path, connecting via Klipper's unix socket:
uk: Наприклад, щоб побудувати анімований швидкий шлях, підключившись через Unix-сокет Klipper:

source: graph_mesh.py plot -a rapid ~/printer_data/comms/klippy.sock
uk: графік graph_mesh.py - швидкий ~/printer_data/comms/klippy.sock

source: Or to plot a 3d visualization of the mesh, connecting via Moonraker:
uk: Або побудувати 3D візуалізацію сітки, підключившись через Moonraker:

source: graph_mesh.py plot meshz http://my-printer.local
uk: graph_mesh.py побудувати мережу http://my-printer.local

source: Bed Mesh Analysis
uk: Аналіз сітки ліжка

source: The `graph_mesh.py` tool may also be used to perform an analysis on the data provided by the [bed_mesh/dump_mesh](#dumping-mesh-data) API:
uk: Інструмент `graph_mesh.py` також можна використовувати для аналізу даних, наданих [bed_mesh/dump_mesh](#dumping-mesh-data) API:

source: graph_mesh.py analyze <input>
uk: аналіз graph_mesh.py

source: As with the `plot` command, the `<input>` must be a path to Klipper's unix socket, a URL to an instance of Moonraker, or a path to a json file generated by the dump command.
uk: Як і у випадку з командою `plot`, `<input>` має бути шляхом до Unix-сокету Klipper, URL-адресою екземпляра Moonraker або шляхом до файлу json, створеного командою dump.

source: To begin, the analysis will perform various checks on the points and probe paths generated by `bed_mesh` at the time of the dump. This includes the following:
uk: Для початку аналіз виконає різні перевірки точок і шляхів зонда, згенерованих `bed_mesh` під час створення дампа. Це включає наступне:

source: The number of probe points generated, without any additions
uk: Кількість згенерованих точок зондування без додавання

source: The number of probe points generated including any points generated as the result faulty regions and/or a configured zero reference position.
uk: Кількість згенерованих точок зондування, включно з будь-якими точками, згенерованими як результат несправних областей і/або налаштованої нульової опорної позиції.

source: The number of probe points generated when performing a rapid scan.
uk: Кількість пробних точок, згенерованих під час виконання швидкого сканування.

source: The total number of moves generated for a rapid scan.
uk: Загальна кількість ходів, згенерованих для швидкого сканування.

source: A validation that the probe points generated for a rapid scan are identical to the probe points generated for a standard probing procedure.
uk: Перевірка того, що точки зондування, створені для швидкого сканування, ідентичні точкам тестування, згенерованим для стандартної процедури зондування.

source: A "backtracking" check for both the standard probe path and a rapid scan path. Backtracking can be defined as moving to the same position more than once during the probing procedure. Backtracking should never occur during a standard probe. Faulty regions *can* result in backtracking during a rapid scan in an attempt to avoid entering a faulty region when approaching or leaving a probe location, however should never occur otherwise.
uk: Перевірка "зворотного відстеження" як для стандартного шляху зонда, так і для шляху швидкого сканування. Зворотне відстеження можна визначити як переміщення до однієї позиції більше одного разу під час процедури зондування. Зворотне відстеження ніколи не повинно відбуватися під час стандартного зонду. Несправні області *можуть* призвести до зворотного відстеження під час швидкого сканування в спробі уникнути входу в несправну область під час наближення або виходу з місця зонда, однак ніколи не повинно відбуватися в іншому випадку.

source: Next each probed mesh present in the dump will by analyzed, beginning with the mesh loaded at the time of the dump (if present) and followed by any saved profiles. The following data is extracted:
uk: Далі буде проаналізовано кожну досліджувану сітку, наявну в дампі, починаючи з сітки, завантаженої під час дампа (якщо вона є), а потім будь-які збережені профілі. Витягуються такі дані:

source: Mesh shape (Min X,Y, Max X,Y Probe Count)
uk: Форма сітки (мін. X, Y, макс. X, Y кількість зондів)

source: Mesh Z range, (Minimum Z, Maximum Z)
uk: Сітка Z діапазон, (мінімум Z, максимум Z)

source: Mean Z value in the mesh
uk: Середнє значення Z у сітці

source: Standard Deviation of the Z values in the Mesh
uk: Стандартне відхилення значень Z у сітці

source: In addition to the above, a delta analysis is performed between meshes with the same shape, reporting the following:
uk: На додаток до вищезазначеного, дельта-аналіз виконується між сітками однакової форми, повідомляючи наступне:

source: The range of the delta between to meshes (Minimum and Maximum)
uk: Діапазон дельти між сітками (мінімум і максимум)

source: The mean delta
uk: Середня дельта

source: Standard Deviation of the delta
uk: Стандартне відхилення дельти

source: The absolute maximum difference
uk: Абсолютна максимальна різниця

source: The absolute mean
uk: Абсолютне середнє

source: Save mesh data to a file
uk: Збережіть дані сітки у файл

source: The `dump` command may be used to save the response to a file which can be shared for analysis when troubleshooting:
uk: Команда `dump` може бути використана для збереження відповіді у файл, який можна надати для аналізу під час усунення несправностей:

source: graph_mesh.py dump -o <output file name> <input>
uk: graph_mesh.py дамп -o

source: The `<input>` should be a path to Klipper's unix socket or a URL to an instance of Moonraker. The `-o` option may be used to specify the path to the output file. If omitted, the file will be saved in the working directory, with a file name in the following format:
uk: `<input>` має бути шляхом до unix-сокету Klipper або URL-адресою екземпляра Moonraker. Параметр `-o` можна використовувати для вказівки шляху до вихідного файлу. Якщо пропущено, файл буде збережено в робочому каталозі з назвою файлу в такому форматі:

source: `klipper-bedmesh-{year}{month}{day}{hour}{minute}{second}.json`
uk: `kipper bed mesh-{year}{month}{day}{hour}{minute}{second}.json`
