Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bootloader_Entry.po
Languages: bg, uk

source: Bootloader Entry
bg: Въвеждане на буутлоудъра
uk: Запис завантажувача

source: Klipper can be instructed to reboot into a [Bootloader](Bootloaders.md) in one of the following ways:
bg: Klipper може да бъде инструктиран да рестартира в [Bootloader](Bootloaders.md) по един от следните начини:
uk: Klipper можна наказати перезавантажити [Bootloader](Bootloaders.md) одним із таких способів:

source: Requesting the bootloader
bg: Запитване за буутлоудър
uk: Запит на завантаження

source: Virtual Serial
bg: Виртуален сериен
uk: Віртуальний серій

source: If a virtual (USB-ACM) serial port is in use, pulsing DTR while at 1200 baud will request the bootloader.
bg: Ако се използва виртуален (USB-ACM) сериен порт, импулсирането на DTR при скорост 1200 бода ще изиска зареждане.
uk: Якщо у віртуальному (USB-ACM) серійний порт знаходиться у використанні, пульсує DTR, при цьому на 1200 baud буде вимагати завантаження.

source: Python (with `flash_usb`)
uk: Python (з `flash_usb`)

source: To enter the bootloader using python (using `flash_usb`):
bg: Влизане в буутлоудъра с помощта на питон (чрез `flash_usb`):
uk: Щоб ввести завантажувач за допомогою python (напр. `flash_usb`):

source: > cd klipper/scripts > python3 -c 'import flash_usb as u; u.enter_bootloader("<DEVICE>")' Entering bootloader on <DEVICE>
uk: > cd klipper/scripts > python3 -c "import flash_usb як u; u.enter_bootloader("<DEVICE>") Р Вхід завантажувача на <DEVICE>

source: Where `<DEVICE>` is your serial device, such as `/dev/serial.by-id/usb-Klipper[...]` or `/dev/ttyACM0`
bg: Където `<DEVICE>` е вашето серийно устройство, например `/dev/serial.by-id/usb-Klipper[...]` или `/dev/ttyACM0`.
uk: Де `<DEVICE>` є вашим серійним пристроєм, наприклад ` /dev/serial.by-id/usb-Klipper[...]` або ` /dev/ttyACM0`

source: Note that if this fails, no output will be printed, success is indicated by printing `Entering bootloader on <DEVICE>`.
bg: Обърнете внимание, че при неуспех няма да бъде отпечатан никакъв изход, а успехът се индикира с отпечатването на `Entering bootloader on <DEVICE>`.
uk: Зауважте, що якщо це не вдалося, не буде друкувати, успіх вказується друком `Встановлює завантаження на <DEVICE>`.

source: Picocom
uk: Пікоком

source: `<Ctrl-A><Ctrl-P>` means holding `Ctrl`, pressing and releasing `a`, pressing and releasing `p`, then releasing `Ctrl`
bg: ````<Ctrl-A><Ctrl-P>` означава задържане на `Ctrl`, натискане и освобождаване на `a`, натискане и освобождаване на `p`, след което освобождаване на `Ctrl`
uk: `<Ctrl-A><Ctrl-P>` означає проведення `Ctrl`, пресування та випуск `a`, пресування та випуск `p`, потім випуск `Ctrl`

source: Physical serial
bg: Физическа серия
uk: Фізична послідовність

source: If a physical serial port is being used on the MCU (even if a USB serial adapter is being used to connect to it), sending the string `<SPACE><FS><SPACE>Request Serial Bootloader!!<SPACE>~`.
bg: Ако се използва физически сериен порт на MCU (дори ако се използва USB сериен адаптер за свързване към него), изпратете символния низ `<SPACE><FS><SPACE>Запитване за сериен буутлоудър!!<SPACE>~``.
uk: Якщо на MCU використовується фізичний серійний порт (навіть, якщо USB серійний адаптер використовується для підключення до нього), відправивши рядок `<SPACE><FS><SPACE><SPACE>Запит серійного завантаження!<SPACE>~`.

source: `<SPACE>` is an ASCII literal space, 0x20.
bg: `<SPACE>` е буквален интервал ASCII, 0x20.
uk: `<SPACE>` - ASCII літровий простір, 0x20.

source: `<FS>` is the ASCII File Separator, 0x1c.
bg: `<FS>` е ASCII файловият разделител, 0x1c.
uk: `<FS>` - Сепаратор файлів ASCII, 0x1c.

source: Note that this is not a valid message as per the [MCU Protocol](Protocol.md#micro-controller-interface), but sync characters(`~`) are still respected.
bg: Имайте предвид, че това не е валидно съобщение съгласно [MCU Protocol](Protocol.md#micro-controller-interface), но символите за синхронизация (`~``) все още се спазват.
uk: Зауважте, що це недійсне повідомлення відповідно до [протоколу MCU](Protocol.md#micro-controller-interface), але символи синхронізації (`~`) все ще поважаються.

source: Because this message must be the only thing in the "block" it is received in, prefixing an extra sync character can increase reliability if other tools were previously accessing the serial port.
bg: Тъй като това съобщение трябва да бъде единственото в "блока", в който е получено, добавянето на допълнителен символ за синхронизация може да повиши надеждността, ако преди това други инструменти са имали достъп до серийния порт.
uk: Оскільки це повідомлення має бути єдиною річ в "блокі" він отримується, префіксуючи додатковий символ синхронізації може збільшити надійність, якщо інші інструменти були раніше доступ до серійного порту.

source: Shell
uk: Шпалери

source: stty <BAUD> < /dev/<DEVICE> echo $'~ \x1c Request Serial Bootloader!! ~' >> /dev/<DEVICE>
uk: <a href="http://realtor.if.ua/" title="Агентство нерухомості Ріелтор"></a> Echo $' ~ \x1c Запит Серійний Bootloader! ~' >> /dev/<DEVICE>

source: Where `<DEVICE>` is your serial port, such as `/dev/ttyS0`, or `/dev/serial/by-id/gpio-serial2`, and
bg: Където `<DEVICE>` е вашият сериен порт, например `/dev/ttyS0` или `/dev/serial/by-id/gpio-serial2`, и
uk: Де `<DEVICE>` - ваш серійний порт, наприклад `/dev/ttyS0`, або `/dev/serial/by-id/gpio-serial2`, і

source: `<BAUD>` is the baud rate of the serial port, such as `115200`.
bg: `<BAUD>` е скоростта на предаване на серийния порт, например `115200`.
uk: `<BAUD>` є курсом серійного порту, наприклад `115200`.

source: CANBUS
uk: КАНБУС

source: If CANBUS is in use, a special [admin message](CANBUS_protocol.md#admin-messages) will request the bootloader. This message will be respected even if the device already has a nodeid, and will also be processed if the mcu is shutdown.
bg: Ако се използва CANBUS, специално съобщение [admin message](CANBUS_protocol.md#admin-messages) ще поиска зареждането на системата. Това съобщение ще бъде спазено, дори ако устройството вече има nodeid, и ще бъде обработено и ако mcu е изключен.
uk: Якщо CANBUS є у використанні, спеціальне [адміністрування повідомлення](CANBUS_protocol.md#admin-messages) вимагатиме завантаження. Це повідомлення буде поважати навіть якщо пристрій вже має вузол, а також буде оброблятися, якщо mcu вимкнено.

source: This method also applies to devices operating in [CANBridge](CANBUS.md#usb-to-can-bus-bridge-mode) mode.
bg: Този метод се прилага и за устройства, работещи в режим [CANBridge](CANBUS.md#usb-to-can-bus-bridge-mode).
uk: Цей метод відноситься до пристроїв, що працюють в режимі [CANBridge](CANBUS.md#usb-to-can-bus-bridge-mode).

source: Katapult's flashtool.py
uk: Флеш-інструмент Katapult. пісяють

source: Where `<CAN_IFACE>` is the can interface to use. If using `can0`, both the `-i` and `<CAN_IFACE>` may be omitted.
bg: Където `<CAN_IFACE>` е интерфейсът на кутията, който трябва да се използва. Ако се използва `can0`, може да се пропуснат както `-i`, така и `<CAN_IFACE>`.
uk: Де `<CAN_IFACE>` є інтерфейсом для використання. Якщо ви використовуєте `can0`, як `-i` і `<CAN_IFACE>` може бути підключений.

source: `<UUID>` is the UUID of your CAN device.
bg: `<UUID>` е UUID на вашето CAN устройство.
uk: `<UID>` є UUID вашого пристрою CAN.

source: See the [CANBUS Documentation](CANBUS.md#finding-the-canbus_uuid-for-new-micro-controllers) for information on finding the CAN UUID of your devices.
bg: Вижте документацията [CANBUS Documentation](CANBUS.md#finding-the-canbus_uuid-for-new-micro-controllers) за информация относно намирането на CAN UUID на вашите устройства.
uk: Дивитися [CANBUS Документація](CANBUS.md#finding-the-canbus_uid-for-new-micro-controllers) для отримання інформації про пошук CAN UUID ваших пристроїв.

source: Entering the bootloader
bg: Влизане в буутлоудъра
uk: Введіть завантажувач

source: When klipper receives one of the above bootloader requests:
bg: Когато klipper получи една от горните заявки от bootloader:
uk: Коли klipper отримує одне з вищезазначених запитів завантажувача:

source: If Katapult (formerly known as CANBoot) is available, klipper will request that Katapult stay active on the next boot, then reset the MCU (therefore entering Katapult).
bg: Ако е наличен Katapult (по-рано известен като CANBoot), klipper ще поиска Katapult да остане активен при следващото зареждане, след което ще нулира MCU (следователно ще влезе в Katapult).
uk: Якщо Katapult (колишній відомий як CANBoot) доступний, klipper запитує, що Katapult залишається активним на наступному завантаженні, після чого скидати MCU (для входу в Katapult).

source: If Katapult is not available, klipper will then try to enter a platform-specific bootloader, such as STM32's DFU mode([see note](#stm32-dfu-warning)).
bg: Ако Katapult не е наличен, klipper ще се опита да влезе в специфичен за платформата буутлоудър, като например DFU режима на STM32([вж. бележка](#stm32-dfu-warning)).
uk: Якщо Katapult не доступний, klipper потім намагатиметься ввести платформу-специфічний завантажувач, такі як режим DFU STM32 ([див. замітка](#stm32-dfu-warning)).

source: In short, Klipper will reboot to Katapult if installed, then a hardware specific bootloader if available.
bg: Накратко, Klipper ще рестартира в Katapult, ако е инсталиран, а след това в специфичен за хардуера буутлоудър, ако има такъв.
uk: Коротко, Klipper перезавантажить до Katapult, якщо встановлено, то апаратний конкретний завантажувач, якщо це можливо.

source: For details about the specific bootloaders on various platforms see [Bootloaders](Bootloaders.md)
bg: За подробности относно специфичните буутлоудъри за различните платформи вижте [Bootloaders](Bootloaders.md)
uk: Деталі про конкретні завантажувачі на різних платформах див. [Bootloaders](Bootloaders. мд)

source: Notes
bg: Бележки
uk: Ноти

source: STM32 DFU Warning
bg: Предупреждение за STM32 DFU
uk: СТМ32 ДФУ Зареєструватися

source: Note that on some boards, like the Octopus Pro v1, entering DFU mode can cause undesired actions (such as powering the heater while in DFU mode). It is recommended to disconnect heaters, and otherwise prevent undesired operations when using DFU mode. Consult the documentation for your board for more details.
bg: Обърнете внимание, че при някои платки, като Octopus Pro v1, влизането в режим DFU може да доведе до нежелани действия (например включване на нагревателя, докато сте в режим DFU). Препоръчително е да изключвате нагревателите и по друг начин да предотвратявате нежелани действия, когато използвате режим DFU. За повече подробности се обърнете към документацията за вашата платка.
uk: Зверніть увагу, що на деяких дошках, таких як Octopus Pro v1, введення режиму DFU може викликати небажані дії (наприклад, живлення нагрівача в режимі DFU). Рекомендується відключати нагрівачі, а іншим чином запобігти небажаним операціям при використанні режиму DFU. Консультування документації для отримання більш детальної інформації.
