Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Example_Configs.po
Languages: uk

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
uk: Цей документ містить інструкції щодо додавання прикладу конфігурації Klipper до репозиторію Klipper на github (розміщений у [config directory](../config/)).

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
uk: Зверніть увагу, що це [Klipper Community Discourse server](https://community.klipper3d.org) також корисний ресурс для пошуку та обміну конфігураційними файлами.

source: Guidelines
uk: Інструкції

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
uk: Приставка `generic` використовується для плат, які можуть використовуватись у різних 3D принтерах.

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
uk: `kit` префікс для 3D принтерів, які зібрані відповідно до широко використовуваної специфікації. Ці принтери "kit" зазвичай відрізняються від звичайних "принтерів", в яких вони не продаються виробником.

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
uk: `sample` префікс використовується для налаштування "snippets", який може копіювати і приклеїти в основний файл конфігурації.

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
uk: `example` префікс використовується для опису кінематики принтера. Цей тип конфігурації, як правило, тільки додано разом з кодом для нового типу принтера kinematics.

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
uk: Klipper має мати можливість запускати файл конфігурації `printer`, `generic` і `kit` без помилок. Ці конфігураційні файли слід додати до регресійного тесту [test/klippy/printers.test](../test/klippy/printers.test). Додайте нові конфігураційні файли до цього тестового випадку у відповідному розділі та в алфавітному порядку в цьому розділі.

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
uk: Прикладна конфігурація повинна бути для конфігурації "панель" принтера. (Примітки дуже багато "згоджені" для відстеження в основній репозитори Klipper.) Аналогічно, ми додаємо лише приклад конфігурації файлів для принтерів, комплектів та дошки, які мають основну популярність (наприклад, є не менше 100 з них у активному використанні). Переглядайте використання [Klipper Community Discourse server](https://community.klipper3d.org) для інших конфігурацій.

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
uk: Тільки вкажіть ті пристрої, присутні на даній принтері або дошці. Не вказуйте налаштування, специфічні для вашого конкретного налаштування. Для `generic` config files, слід описати лише ті пристрої на клавіатурі. Наприклад, це не має сенс додати розділ налаштування дисплея на "генеричну" конфігурацію, як ніхто не знає, якщо дошка буде прикріплена до цього типу відображення. Якщо дошка має конкретний апаратний порт, щоб полегшити необов'язковий периферичний (наприклад, порт розмиття) потім можна додати розділ "з'єднання" для даного пристрою.

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
uk: Не вказуйте `pressure_advance` в прикладі config, так як це значення специфічне для подачі, а не обладнання для принтера. Аналогічно, не вказуйте `max_extrude_only_velocity` ні `max_extrude_only_accel` налаштування.

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
uk: Не вкажіть розділ налаштування, що містить шлях хосту або апаратне обладнання. Наприклад, не вказуйте `[virtual_sdcard]`, ані `[темперія_host]` розділи налаштувань.

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
uk: Тільки визначаються макроси, які використовують функціональність, специфічні для даного принтера або для визначення g-кодів, які зазвичай видаються скибочками, налаштованими для даного принтера.

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
uk: Де це можливо, краще використовувати те ж саме слово, фразування, відступання та оформлення замовлення як існуючі файли конфігурації. У верхній частині кожного конфігураційного файлу необхідно вказати тип мікроконтролера, який користувач повинен вибрати під час "настроювання меню". Слід також мати посилання на "доки/Config_Reference.md".

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
uk: Не скопіюйте польову документацію на прикладі конфігураційних файлів. (Для того, щоб створити технічне навантаження, як оновлення до документації, потрібно змінити його в багатьох місцях.)

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
uk: Приклад конфігураційних файлів не містить розділу "SAVE_CONFIG". При необхідності скопіюйте відповідні поля з розділу SAVE_CONFIG до відповідного розділу в основній області налаштування.

source: Use `field: value` syntax instead of `field=value`.
uk: Використовуйте ` поле: значення` синтаксису замість `field=value`.

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
uk: Уникайте визначення значень поля, які встановлюються на їх значення за замовчуванням. Наприклад, не слід вказати `min_extrude_temp: 170`, оскільки це вже значення за замовчуванням.

source: Where possible, lines should not exceed 80 columns.
uk: Де можна, лінії не повинні перевищувати 80 стовпчиків.

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
uk: Уникайте додавання повідомлень налаштування або переадресації до файлів налаштувань. (Приміром, не додаючи рядків, таких як "це файл був створений ...". Місце атрибуту і зміни історії в git-комунальному повідомленні.

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
uk: Не відключити систему безпеки за замовчуванням у файлі налаштування прикладу. Наприклад, конфігурація не повинна вказувати на користувача `max_extrude_cross_section`. Не увімкніть функції відключення. Наприклад, не повинно бути `force_move`.

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
uk: Приклад конфігураційних файлів подаються за допомогою створення github "Запитати запит". Будь ласка, дотримуйтесь інструкцій у [contributing документа](CONTRIBUTING.md).

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
uk: `printer` префікс використовується для принтерів запасів, які продаються виробником основного потоку.

source: Example configurations
uk: Приклад конфігурації

source: Select the appropriate config filename prefix:
uk: Виберіть відповідну префіксацію імені config:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
uk: Всі файли конфігурації повинні закінчитися в `.cfg` suffix. `printer` config files повинні закінчитися в рік, після чого `.cfg` (наприклад, `-2019.cfg`). У цьому випадку рік є приблизним роком, який був проданий принтер.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
uk: Не використовуйте пробіли або спеціальні символи в назві конфігурації. Назва файлу повинна містити тільки символи `A-Z`, `a-z`, `0-9`, `-`, і ``.

source: Do not use any deprecated features in the example config file.
uk: Не використовуйте будь-які застарілі функції у файлі налаштування прикладу.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
uk: При додаванні екструдера `rotation_distance` бажано вказати `gear_ratio` якщо екструдер має механізм передачі. Ми очікуємо обертання_distance в прикладі конфігурацій для кореляції з окружністю захоплених передач в екструдера - це зазвичай в діапазоні від 20 до 35 мм. При уточненні `gear_ratio` бажано вказати фактичні редуктори на механізмі (наприклад, віддати перевагу `gear_ratio: 80:20` над `gear_ratio: 4:1`). Дивитися [вихідний документ](Rotation_Distance.md#using-a-gear_ratio) для отримання додаткової інформації.

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
uk: Усі відомі плати, які підтримує Klipper, можуть використовувати послідовну швидкість передачі за замовчуванням 250 000 бод. Не рекомендуйте іншу швидкість передачі даних у прикладі файлу конфігурації.
