Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/FAQ.po
Languages: uk

source: How can I donate to the project?
uk: Як я можу пожертвувати проект?

source: How do I calculate the rotation_distance config parameter?
uk: Як я розрахувати параметр налаштування_distance?

source: See the [rotation distance document](Rotation_Distance.md).
uk: Дивитися [вихідний документ](Rotation_Distance.md).

source: Where's my serial port?
uk: Де мій серійний порт?

source: The general way to find a USB serial port is to run `ls /dev/serial/by-id/*` from an ssh terminal on the host machine. It will likely produce output similar to the following:
uk: Загальний спосіб пошуку послідовного порту USB полягає в тому, щоб запустити `ls /dev/serial/by-id/*` з терміналу Ssh на машині. Імовірно виготовляти вихід, схожий на наступні:

source: The name found in the above command is stable and it is possible to use it in the config file and while flashing the micro-controller code. For example, a flash command might look similar to:
uk: Назва, що міститься в вищезазначеній команді, є стабільною і її можна використовувати в файлі конфігурації і при цьому миготуванні коду мікроконтролера. Наприклад, флеш-компанія може виглядати як:

source: and the updated config might look like:
uk: і оновлена конфігурація може виглядати як:

source: Be sure to copy-and-paste the name from the "ls" command that you ran above as the name will be different for each printer.
uk: Обов'язково скопіювати і скопіювати ім'я від команди "лс", яку ви побігли над назвою буде різним для кожного принтера.

source: If you are using multiple micro-controllers and they do not have unique ids (common on boards with a CH340 USB chip) then follow the directions above using the command `ls /dev/serial/by-path/*` instead.
uk: Якщо ви використовуєте декілька мікроконтролерів, і вони не мають унікальних потоків (комона на дошках з чіпом USB CH340), то слідуйте за напрямами, описаними вище за допомогою команди `ls/dev/serial/by-path/*`.

source: When the micro-controller restarts the device changes to /dev/ttyUSB1
uk: Коли мікроконтролер перезавантажує зміни пристрою до /dev/ttyUSB1

source: Follow the directions in the "[Where's my serial port?](#wheres-my-serial-port)" section to prevent this from occurring.
uk: Дотримуйтеся вказівок у розділі «[Де мій послідовний порт?](#wheres-my-serial-port)», щоб цього не сталося.

source: The "make flash" command doesn't work
uk: Команда «make flash» не працює

source: The code attempts to flash the device using the most common method for each platform. Unfortunately, there is a lot of variance in flashing methods, so the "make flash" command may not work on all boards.
uk: Код намагається зафіксувати пристрій, використовуючи найбільш поширений метод для кожної платформи. На жаль, існує багато варіантних методів, тому команда «мейк флеш» не може працювати на всіх платах.

source: If you're having an intermittent failure or you do have a standard setup, then double check that Klipper isn't running when flashing (sudo service klipper stop), make sure OctoPrint isn't trying to connect directly to the device (open the Connection tab in the web page and click Disconnect if the Serial Port is set to the device), and make sure FLASH_DEVICE is set correctly for your board (see the [question above](#wheres-my-serial-port)).
uk: Якщо у вас є проміжна відмова або у вас є стандартна настройка, то подвійний перевірте, що Klipper не працює при миготуванні (підключення служби klipper), переконайтеся, що OctoPrint не намагається підключити безпосередньо до пристрою (відкрийте вкладку підключення в веб-сторінку та натисніть кнопку Від'єднатися, якщо Serial Port встановлюється на пристрій), і переконайтеся, що FLASH_DEVICE встановлюється правильно для вашої дошки (див. [запит вище](#де-my-serial-port)).

source: However, if "make flash" just doesn't work for your board, then you will need to manually flash. See if there is a config file in the [config directory](../config) with specific instructions for flashing the device. Also, check the board manufacturer's documentation to see if it describes how to flash the device. Finally, it may be possible to manually flash the device using tools such as "avrdude" or "bossac" - see the [bootloader document](Bootloaders.md) for additional information.
uk: Але якщо «зробити флешку» просто не працює для вашої дошки, то вам потрібно буде вручну спалахати. Переглядайте, чи є файл налаштування в каталозі [config](./config) з певними інструкціями для миття пристрою. Також перевірте документацію виробника дошки, щоб побачити, чи йдеться про те, як спалахувати пристрій. Нарешті, це може бути можливо вручну за допомогою інструментів, таких як "avrdude" або "bossac" - див. [завантажувальний документ](Bootloaders.md) для додаткової інформації.

source: How do I change the serial baud rate?
uk: Як змінити частоту паводка?

source: The recommended baud rate for Klipper is 250000. This baud rate works well on all micro-controller boards that Klipper supports. If you've found an online guide recommending a different baud rate, then ignore that part of the guide and continue with the default value of 250000.
uk: Рекомендований курс для Klipper - 250000. Цей курс добре працює на всіх мікроконтролерних дошках, які підтримує Klipper. Якщо ви знайшли онлайн-довідник, який рекомендує різну частоту baud, то ігноруйте цю частину керівництва і продовжуйте значення за замовчуванням 250000.

source: If you want to change the baud rate anyway, then the new rate will need to be configured in the micro-controller (during **make menuconfig**) and that updated code will need to be compiled and flashed to the micro-controller. The Klipper printer.cfg file will also need to be updated to match that baud rate (see the [config reference](Config_Reference.md#mcu) for details). For example:
uk: Якщо ви хочете змінити частоту буду в будь-який час, то новий курс буде потрібно налаштувати в мікроконтролері (принад **make менюconfig**) і цей оновлений код буде потрібно скомпільувати і зафіксувати до мікроконтролера. Файл Klipper принтер.cfg також потрібно оновлювати, щоб відповідати цьому курсу baud (див. посилання [config](Config_Reference.md#mcu) для деталей). Наприклад:

source: The baud rate shown on the OctoPrint web page has no impact on the internal Klipper micro-controller baud rate. Always set the OctoPrint baud rate to 250000 when using Klipper.
uk: На веб-сторінці OctoPrint не впливає на внутрішній рівень мікроконтролера кліппера. Завжди налаштуйте курс OctoPrint до 250000 при використанні Klipper.

source: The Klipper micro-controller baud rate is not related to the baud rate of the micro-controller's bootloader. See the [bootloader document](Bootloaders.md) for additional information on bootloaders.
uk: Частота мікроконтролера Klipper не пов'язана з частотою забору мікроконтролера. Дивитися [завантажити документ](Bootloaders.md) для додаткової інформації про завантажувачі.

source: Can I run Klipper on something other than a Raspberry Pi 3?
uk: Чи можу я запустити Klipper на щось інше, ніж Raspberry Pi 3?

source: The recommended hardware is a Raspberry Pi 2, Raspberry Pi 3, or Raspberry Pi 4.
uk: Рекомендоване обладнання - Малина Пі 2, Малина Пі 3, або Малина Пі 4.

source: Klipper will run on a Raspberry Pi 1 and on the Raspberry Pi Zero, but these boards don't have enough processing power to run OctoPrint well. It is common for print stalls to occur on these slower machines when printing directly from OctoPrint. (The printer may move faster than OctoPrint can send movement commands.) If you wish to run on one one of these slower boards anyway, consider using the "virtual_sdcard" feature when printing (see [config reference](Config_Reference.md#virtual_sdcard) for details).
uk: Klipper буде курсувати на Малина Пі 1 і на Малина Пі Зеро, але ці дошки не мають достатньої потужності обробки, щоб запустити OctoPrint добре. Зазвичай для друку конструкцій, які відбуваються на цих повільних машинах при друку безпосередньо з OctoPrint. (Принтер може рухатися швидше, ніж OctoPrint може надсилати команди руху.) Якщо ви хочете запустити на одному з цих повільних дощок в будь-який час, розгляньте за допомогою функції "virtual_sdcard" при друку (див. [посилання на налаштування](Config_Reference.md#virtual_sdcard) для деталей).

source: Klipper has been run on other machines. The Klipper host software only requires Python running on a Linux (or similar) computer. However, if you wish to run it on a different machine you will need Linux admin knowledge to install the system prerequisites for that particular machine. See the [install-octopi.sh](../scripts/install-octopi.sh) script for further information on the necessary Linux admin steps.
uk: Кліппер працює на інших машинах. Програмне забезпечення для хіппера вимагає завантаження Python на Linux (або аналогічний) комп'ютер. Однак, якщо ви хочете запустити його на іншій машині, вам потрібно знати Linux адміністратора для установки реквізитів системи для цієї конкретної машини. Дивитися скрипт [install-octopi.sh](./scripts/install-octopi.sh) для подальшої інформації про необхідні кроки адміністратора Linux.

source: If you are looking to run the Klipper host software on a low-end chip, then be aware that, at a minimum, a machine with "double precision floating point" hardware is required.
uk: Якщо ви шукаєте запустити програмне забезпечення Klipper на низькій струзі, то пам'ятайте, що, в мінімальному, машині з "подвійною точкою плавлення" необхідно обладнання.

source: If you are looking to run the Klipper host software on a shared general-purpose desktop or server class machine, then note that Klipper has some real-time scheduling requirements. If, during a print, the host computer also performs an intensive general-purpose computing task (such as defragmenting a hard drive, 3d rendering, heavy swapping, etc.), then it may cause Klipper to report print errors.
uk: Якщо ви шукаєте запустити програмне забезпечення Klipper на спільній універсальній настільній або серверній машині, то зауважте, що Klipper має деякі вимоги до виконання в режимі реального часу. Якщо, під час друку, хостовий комп'ютер також виконує інтенсивне завдання з обчислення загального призначення (наприклад, дефрагментація жорсткого диска, 3d рендеринга, важке ковзання і т.д.), то це може викликати Klipper, щоб повідомити помилки друку.

source: Note: If you are not using an OctoPi image, be aware that several Linux distributions enable a "ModemManager" (or similar) package that can disrupt serial communication. (Which can cause Klipper to report seemingly random "Lost communication with MCU" errors.) If you install Klipper on one of these distributions you may need to disable that package.
uk: Примітка: Якщо ви не використовуєте зображення OctoPi, будь ласка, вкажіть, що кілька дистриб'юторів Linux дозволяють пакету "ModemManager" (або аналогічний), який може порушити послідовне спілкування. (Жіч може викликати Klipper, щоб звітувати, здавалося б, випадкові "Останні комунікації з MCU" помилки.) Якщо ви встановите Klipper на одному з цих розподілів, вам може знадобитися відключити цей пакет.

source: Can I run multiple instances of Klipper on the same host machine?
uk: Чи можу я запустити кілька екземплярів Klipper на одному хост-машини?

source: It is possible to run multiple instances of the Klipper host software, but doing so requires Linux admin knowledge. The Klipper installation scripts ultimately cause the following Unix command to be run:
uk: Ви можете запустити декілька екземплярів програмного забезпечення Klipper, але це вимагає знань адміністратора Linux. Скрипки установки Klipper в кінцевому підсумку викликають команду Unix:

source: One can run multiple instances of the above command as long as each instance has its own printer config file, its own log file, and its own pseudo-tty. For example:
uk: Один може запустити кілька екземплярів вищевказаної команди, доки кожен екземпляр має власний файл налаштування принтера, власний файл журналу, і власний псевдо-тty. Наприклад:

source: If you choose to do this, you will need to implement the necessary start, stop, and installation scripts (if any). The [install-octopi.sh](../scripts/install-octopi.sh) script and the [klipper-start.sh](../scripts/klipper-start.sh) script may be useful as examples.
uk: Якщо ви обираєте це зробити, вам потрібно буде виконати необхідний запуск, зупинку та інсталяційні скрипти (за наявності). [install-octopi.sh](./scripts/install-octopi.sh) скрипт і [klipper-start.sh](./scripts/klipper-start.sh) скрипт може бути корисний як приклади.

source: Do I have to use OctoPrint?
uk: Чи можу я використовувати OctoPrint?

source: The Klipper software is not dependent on OctoPrint. It is possible to use alternative software to send commands to Klipper, but doing so requires Linux admin knowledge.
uk: Програмне забезпечення Klipper не залежить від OctoPrint. Ви можете використовувати альтернативне програмне забезпечення для відправки команд до Klipper, але це вимагає знання адміністратора Linux.

source: Klipper creates a "virtual serial port" via the "/tmp/printer" file, and it emulates a classic 3d-printer serial interface via that file. In general, alternative software may work with Klipper as long as it can be configured to use "/tmp/printer" for the printer serial port.
uk: Klipper створює "віртуальний серійний порт" через файл "/tmp/printer", і він емульгує класичний 3d-printer послідовний інтерфейс через цей файл. В цілому альтернативне програмне забезпечення може працювати з Klipper до тих пір, поки він може бути налаштований для використання "/tmp/printer" для принтера серійного порту.

source: Why can't I move the stepper before homing the printer?
uk: Чому я не можу перемістити степпер перед затіненням принтера?

source: The code does this to reduce the chance of accidentally commanding the head into the bed or a wall. Once the printer is homed the software attempts to verify each move is within the position_min/max defined in the config file. If the motors are disabled (via an M84 or M18 command) then the motors will need to be homed again prior to movement.
uk: Код дозволяє зменшити ймовірність випадкового виконання голови в ліжко або стіну. Після того, як принтер додається спробам програмного забезпечення, щоб перевірити кожен рух, знаходиться в позиції_min/max, визначеному в файлі конфігурації. Якщо двигуни відключені (через команду M84 або M18), то двигуни потрібно знову добиратися до руху.

source: If you want to move the head after canceling a print via OctoPrint, consider changing the OctoPrint cancel sequence to do that for you. It's configured in OctoPrint via a web browser under: Settings->GCODE Scripts
uk: Якщо ви хочете перемістити голову після скасування друку через OctoPrint, розгляньте зміни послідовності скасування OctoPrint для цього для вас. Настроювання в OctoPrint через веб-браузер під: Налаштування -> GCODE скрипти

source: If you want to move the head after a print finishes, consider adding the desired movement to the "custom g-code" section of your slicer.
uk: Якщо ви хочете перемістити голову після обробки друку, врахуйте, додавши бажаний рух до розділу "кутом g-коду".

source: If the printer requires some additional movement as part of the homing process itself (or fundamentally does not have a homing process) then consider using a safe_z_home or homing_override section in the config file. If you need to move a stepper for diagnostic or debugging purposes then consider adding a force_move section to the config file. See [config reference](Config_Reference.md#customized_homing) for further details on these options.
uk: Якщо принтер вимагає певного додаткового руху в складі самого процесу хмінгу (або принципово не має процесу хмінгу) то розглянемо за допомогою безпечного_z_home або homing_override в розділі налаштування. Якщо вам необхідно перемістити кроковий інструмент для діагностики або видалення цілей, після чого слід додати в файл config_move. Див. [Налаштування посилання](Config_Reference.md#customized_homing) для подальших деталей на цих параметрах.

source: Why is the Z position_endstop set to 0.5 in the default configs?
uk: Чому Z позиції_endstop встановити на 0.5 в налаштуваннях за замовчуванням?

source: For cartesian style printers the Z position_endstop specifies how far the nozzle is from the bed when the endstop triggers. If possible, it is recommended to use a Z-max endstop and home away from the bed (as this reduces the potential for bed collisions). However, if one must home towards the bed then it is recommended to position the endstop so it triggers when the nozzle is still a small distance away from the bed. This way, when homing the axis, it will stop before the nozzle touches the bed. See the [bed level document](Bed_Level.md) for more information.
uk: Для картоперіанського стилю друкує позицію Z_endstop визначає, наскільки далеко сопла знаходиться з ліжка, коли торцеві тригери. Якщо це можливо, рекомендується використовувати Z-max endstop і додому від ліжка (як це знижує потенціал при зіткненні ліжка). Однак, якщо необхідно будинок до ліжка, то рекомендується розташовувати торцеву стільницю, щоб вона запускає, коли насадка ще невелика відстань від ліжка. Таким чином, коли замішуючи вісь, вона зупиниться перед насадкою доторкається ліжка. Дивитися документ рівня [bedded](Bed_Level.md) для отримання додаткової інформації.

source: I converted my config from Marlin and the X/Y axes work fine, but I just get a screeching noise when homing the Z axis
uk: Я перетворю свою настройку з Марліна і X / Y ось працюють дрібно, але я просто отримую шум скребкування при хмінгу осі Z

source: Short answer: First, make sure you have verified the stepper configuration as described in the [config check document](Config_checks.md). If the problem persists, try reducing the max_z_velocity setting in the printer config.
uk: Коротка відповідь: По-перше, переконайтеся, що ви перевірили конфігурацію stepper, як описано в [config check документ](Config_checks.md). Якщо проблема зберігається, спробуйте зменшити налаштування макс_z_velocity у налаштуваннях принтера.

source: Long answer: In practice Marlin can typically only step at a rate of around 10000 steps per second. If it is requested to move at a speed that would require a higher step rate then Marlin will generally just step as fast as it can. Klipper is able to achieve much higher step rates, but the stepper motor may not have sufficient torque to move at a higher speed. So, for a Z axis with a high gearing ratio or high microsteps setting the actual obtainable max_z_velocity may be smaller than what is configured in Marlin.
uk: Довгий відповідь: У практиці Марлін може як правило, тільки крок за курсом близько 10000 кроків на другий. Якщо це запитується, щоб перейти на швидкість, яка вимагає більш високої швидкості, тоді Марлін, як правило, просто крок, як це може. Кліппер здатний досягти значно більш високих показників кроку, але кроковий двигун не може мати достатній крутний момент для переміщення на більшій швидкості. Таким чином, для осі Z з високим коефіцієнтом передачі або високими мікрокропами, що встановлюють фактичну прибуткову максимальну_z_velocity, може бути меншим, ніж який налаштовується в Марліні.

source: My TMC motor driver turns off in the middle of a print
uk: Драйвер My TMC вимкнений в середині друку

source: If using the TMC2208 (or TMC2224) driver in "standalone mode" then make sure to use the [latest version of Klipper](#how-do-i-upgrade-to-the-latest-software). A workaround for a TMC2208 "stealthchop" driver problem was added to Klipper in mid-March of 2020.
uk: При використанні драйвера TMC2208 (або драйвера TMC2224) в режимі "standalone" потім переконайтеся, що використання [найширшої версії Klipper](#how-do-i-upgrade-to-latest-software). До Klipper в середині березня 2020 року додана робота для драйвера ТМC2208 «stealthchop».

source: I keep getting random "Lost communication with MCU" errors
uk: Я тримаю випадкові помилки "Lost спілкування з MCU"

source: This is commonly caused by hardware errors on the USB connection between the host machine and the micro-controller. Things to look for:
uk: Це, як правило, викликано апаратними помилками на USB-з'єднання між хост-машиною та мікроконтролером. Що подивитися на:

source: Use a good quality USB cable between the host machine and micro-controller. Make sure the plugs are secure.
uk: Використовуйте гарну якість кабелю USB між хост-машиною та мікроконтролерами. Переконайтеся, що застібки безпечні.

source: Make sure the printer's power supply is not being overloaded. (Power fluctuations to the micro-controller's USB chip may result in resets of that chip.)
uk: Переконайтеся, що джерело живлення принтера не перевантажується. (Флуктуації живлення до чіпа micro-controller може призвести до скидання цього чіпа.)

source: Verify stepper, heater, and other printer wires are not crimped or frayed. (Printer movement may place stress on a faulty wire causing it to lose contact, briefly short, or generate excessive noise.)
uk: Переконайтеся, що дроти крокового кроку, нагрівача та інших принтерів не зігнуті та не потерті. (Рух принтера може спричинити навантаження на несправний дріт, що призведе до втрати контакту, короткочасного замикання або створення надмірного шуму.)

source: There have been reports of high USB noise when both the printer's power supply and the host's 5V power supply are mixed. (If you find that the micro-controller powers on when either the printer's power supply is on or the USB cable is plugged in, then it indicates the 5V power supplies are being mixed.) It may help to configure the micro-controller to use power from only one source. (Alternatively, if the micro-controller board can not configure its power source, one may modify a USB cable so that it does not carry 5V power between the host and micro-controller.)
uk: У зв'язку з технологічними роботами, ми можемо надати інформацію про високий рівень USB, коли як джерело живлення принтера, так і джерело живлення 5В. (Якщо ви виявите, що потужність мікроконтролера, коли або джерело живлення принтера знаходиться на або USB-кабель, то це вказує на живлення 5В, змішані.) Це може допомогти налаштовувати мікроконтролер для використання потужності з одного джерела. (Включно, якщо дошка мікроконтролера не може налаштовувати джерело живлення, можна змінити USB-кабель так, що вона не несе живлення 5В між хостом і мікроконтролером.)

source: My Raspberry Pi keeps rebooting during prints
uk: Мій Малина Пі зберігає перезавантаження під час друку

source: This is most likely do to voltage fluctuations. Follow the same troubleshooting steps for a ["Lost communication with MCU"](#i-keep-getting-random-lost-communication-with-mcu-errors) error.
uk: Це, швидше за все, до коливання напруги. Дотримуйтесь тих же кроків з усунення неполадок на [[Lost спілкування з MCU"](#i-keep-geting-random-lost- Communications-with-mcu-errors) помилки.

source: Some old versions of the AVR bootloader have a known bug in watchdog event handling. This typically manifests when the printer.cfg file has restart_method set to "command". When the bug occurs, the AVR device will be unresponsive until power is removed and reapplied to the device (the power or status LEDs may also blink repeatedly until the power is removed).
uk: Деякі старі версії AVR завантажувача мають відоме помилки в перегляді подій. Це, як правило, проявляється, коли принтер.cfg файл має перезавантаження_метод встановити до "команду". При виникненні клопотання, пристрій AVR буде нечутливим до моменту видалення потужності і перезаряджається до пристрою (сила або статус світлодіодів також може періодично зв'язуватися до моменту видалення живлення).
