Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/FAQ.po
Languages: uk

source: The workaround is to use a restart_method other than "command" or to flash an updated bootloader to the AVR device. Flashing a new bootloader is a one time step that typically requires an external programmer - see [Bootloaders](Bootloaders.md) for further details.
uk: Робота є використовувати решту_метод, крім "команди" або натиснути оновлений завантажувач до пристрою AVR. Висвітлення нового завантажувача є одним кроком, який зазвичай вимагає зовнішнього програматора - див. [Bootloaders](Bootloaders.md) для подальших деталей.

source: Will the heaters be left on if the Raspberry Pi crashes?
uk: Чи залишаться нагрівачі, якщо збитки малини?

source: The software has been designed to prevent that. Once the host enables a heater, the host software needs to confirm that enablement every 5 seconds. If the micro-controller does not receive a confirmation every 5 seconds it goes into a "shutdown" state which is designed to turn off all heaters and stepper motors.
uk: Програма призначена для запобігання цього. Після того, як хост дозволяє нагрівачу, хостове програмне забезпечення необхідно підтвердити, що увімкнення кожні 5 секунд. Якщо мікроконтролер не отримує підтвердження кожні 5 секунд, він переходить в стан "повороту", який призначений для виключення всіх нагрівачів і крокових двигунів.

source: See the "config_digital_out" command in the [MCU commands](MCU_Commands.md) document for further details.
uk: Дивитися команду "config_digital_out" в [MCU команди](MCU_Commands.md) для подальших деталей.

source: In addition, the micro-controller software is configured with a minimum and maximum temperature range for each heater at startup (see the min_temp and max_temp parameters in the [config reference](Config_Reference.md#extruder) for details). If the micro-controller detects that the temperature is outside of that range then it will also enter a "shutdown" state.
uk: Крім того, програмне забезпечення micro-controller налаштоване з мінімальним і максимальним діапазоном температур для кожного обігрівача при запуску (див. параметри Min_temp і max_temp в [посилання на налаштування](Config_Reference.md#extruder) для деталей). Якщо мікроконтролер виявить, що температура зовні цього діапазону, то вона також буде входити в стан «пошуку».

source: Separately, the host software also implements code to check that heaters and temperature sensors are functioning correctly. See the [config reference](Config_Reference.md#verify_heater) for further details.
uk: Окремо, хостове програмне забезпечення також реалізує код, щоб перевірити, що нагрівачі та датчики температури функціонують правильно. Див. [Налаштування посилання](Config_Reference.md#verify_heater) для подальших деталей.

source: How do I convert a Marlin pin number to a Klipper pin name?
uk: Як перетворити марлін контактний номер на ім'я клиппера?

source: Short answer: A mapping is available in the [sample-aliases.cfg](../config/sample-aliases.cfg) file. Use that file as a guide to finding the actual micro-controller pin names. (It is also possible to copy the relevant [board_pins](Config_Reference.md#board_pins) config section into your config file and use the aliases in your config, but it is preferable to translate and use the actual micro-controller pin names.) Note that the sample-aliases.cfg file uses pin names that start with the prefix "ar" instead of "D" (eg, Arduino pin `D23` is Klipper alias `ar23`) and the prefix "analog" instead of "A" (eg, Arduino pin `A14` is Klipper alias `analog14`).
uk: Коротка відповідь: У файлі [sample-aliases.cfg](./config/sample-aliases.cfg). Використовуйте цей файл як керівництво для пошуку фактичних мікроконтролерів контактних імен. (Так само можна копіювати відповідні [board_pins](Config_Reference.md#board_pins) розділ конфігурації в файл config і використовувати псевдоніми в налаштуваннях, але бажано перевести і використовувати фактичні мікроконтролерні імена штифтів.) Зверніть увагу, що зразок-aliases.cfg файл використовує контактні імена, які починаються з префікса "ar" замість "D" (наприклад, Arduino pin `D23` є Klipper alias `ar23`) і префікс "алог" замість "A" (наприклад, Arduino pin `A14` є Klipper alias `analog14`).

source: Long answer: Klipper uses the standard pin names defined by the micro-controller. On the Atmega chips these hardware pins have names like `PA4`, `PC7`, or `PD2`.
uk: Довгий відповідь: Кліппер використовує стандартні імена штифтів, визначені мікроконтролером. На чіпах Atmega ці апаратні шпильки мають імена, такі як `PA4`, `PC7`, або `PD2`.

source: Long ago, the Arduino project decided to avoid using the standard hardware names in favor of their own pin names based on incrementing numbers - these Arduino names generally look like `D23` or `A14`. This was an unfortunate choice that has lead to a great deal of confusion. In particular the Arduino pin numbers frequently don't translate to the same hardware names. For example, `D21` is `PD0` on one common Arduino board, but is `PC7` on another common Arduino board.
uk: Довгий тому, проект Arduino вирішив уникнути використання стандартних фурнітурних імен на користь власних контактних імен на основі вхідних чисел - ці назви Arduino зазвичай виглядають як `D23` або `A14`. Це був непристойний вибір, який веде до великої угоди. Зокрема, номери Arduino часто не переходять на ті самі апаратні імена. Наприклад, `D21` `PD0` на одній загальній дошці Arduino, але `PC7` на іншій загальній дошці Arduino.

source: To avoid this confusion, the core Klipper code uses the standard pin names defined by the micro-controller.
uk: Щоб уникнути цього конфузії, основний код Кліппер використовує стандартні імена штифтів, визначені мікроконтролером.

source: Do I have to wire my device to a specific type of micro-controller pin?
uk: Чи повинен я проводити пристрій до певного типу мікроконтролера?

source: It depends on the type of device and type of pin:
uk: Залежно від типу пристрою і типу штифта:

source: ADC pins (or Analog pins): For thermistors and similar "analog" sensors, the device must be wired to an "analog" or "ADC" capable pin on the micro-controller. If you configure Klipper to use a pin that is not analog capable, Klipper will report a "Not a valid ADC pin" error.
uk: ADC шпильки (або Аналогові шпильки): Для лічильників і аналогічних «аналогових» датчиків, пристрій необхідно проводити до «аналізу» або «ADC», здатного притискати на мікроконтролер. Якщо ви налаштуєте Klipper для використання шпильки, який не є аналогом, Klipper повідомить про помилку "Не дійсний ADC pin".

source: PWM pins (or Timer pins): Klipper does not use hardware PWM by default for any device. So, in general, one may wire heaters, fans, and similar devices to any general purpose IO pin. However, fans and output_pin devices may be optionally configured to use `hardware_pwm: True`, in which case the micro-controller must support hardware PWM on the pin (otherwise, Klipper will report a "Not a valid PWM pin" error).
uk: PWM шпильки (або таймерні шпильки): Klipper не використовує апаратні PWM за замовчуванням для будь-якого пристрою. Таким чином, в цілому, один може нагрівачі, вентилятори та аналогічні пристрої до будь-якого загального призначення IO шпильки. Однак, вентилятори та вихідні_pin пристрої можуть бути додатково налаштовані для використання `hardware_pwm: Правда`, в якому випадку, коли мікроконтролер повинен підтримувати апаратні засоби PWM на шпилькі (інше, Klipper повідомить про помилку "Не діє PWM".

source: IRQ pins (or Interrupt pins): Klipper does not use hardware interrupts on IO pins, so it is never necessary to wire a device to one of these micro-controller pins.
uk: IRQ шпильки (або Interrupt шпильки): Кліппер не використовує апаратні переривання на IO шпильках, тому він ніколи не потрібно проводити пристрій до одного з цих мікроконтролерних штифтів.

source: SPI pins: When using hardware SPI it is necessary to wire the pins to the micro-controller's SPI capable pins. However, most devices can be configured to use "software SPI", in which case any general purpose IO pins may be used.
uk: SPI шпильки: При використанні апаратних SPI необхідно проводити шпильки до мікроконтролера SPI здатні шпильки. Тим не менш, більшість пристроїв можуть бути налаштовані на використання "software SPI", в якому можна використовувати будь-які загальні цілі IO шпильки.

source: I2C pins: When using I2C it is necessary to wire the pins to the micro-controller's I2C capable pins.
uk: I2C шпильки: При використанні I2C необхідно проводити шпильки до мікроконтролера I2C здатні шпильки.

source: Other devices may be wired to any general purpose IO pin. For example, steppers, heaters, fans, Z probes, servos, LEDs, common hd44780/st7920 LCD displays, the Trinamic UART control line may be wired to any general purpose IO pin.
uk: Інші пристрої можуть бути передані до будь-якого загального призначення IO шпильки. Наприклад, steppers, обігрівачі, вентилятори, Z зонди, servos, світлодіоди, загальний hd44780/st7920 РК-дисплей, лінія керування Trinamic UART може бути проведена до будь-якого загального призначення IO шпильки.

source: How do I cancel an M109/M190 "wait for temperature" request?
uk: Як скасувати M109/M190 "відплата за температуру"?

source: Navigate to the OctoPrint terminal tab and issue an M112 command in the terminal box. The M112 command will cause Klipper to enter into a "shutdown" state, and it will cause OctoPrint to disconnect from Klipper. Navigate to the OctoPrint connection area and click on "Connect" to cause OctoPrint to reconnect. Navigate back to the terminal tab and issue a FIRMWARE_RESTART command to clear the Klipper error state. After completing this sequence, the previous heating request will be canceled and a new print may be started.
uk: Навігація на вкладку OctoPrint і виписка команди M112 в терміналі. Команда M112 спричинить Klipper, щоб ввести в стан "пошуку", і це призведе до OctoPrint для відключення від Klipper. Навігація на область з'єднання OctoPrint і натисніть на кнопку "Connect", щоб викликати OctoPrint для відключення. Навігація назад до вкладки терміналу і виписка FIRMWARE_ Команда RESTART для очищення стану помилок Klipper. Після завершення цієї послідовності, попередній запит на опалення буде скасовано, і може бути розпочато новий друк.

source: Can I find out whether the printer has lost steps?
uk: Чи можу я дізнатися, чи втратив принтер?

source: In a way, yes. Home the printer, issue a `GET_POSITION` command, run your print, home again and issue another `GET_POSITION`. Then compare the values in the `mcu:` line.
uk: Так. Головна принтера, виписка `GET_SETTING` команда, запустити свій друк, додому знову і випустити інший `GET_SETTING`. Далі порівнювати значення в рядку `mcu:`.

source: This might be helpful to tune settings like stepper motor currents, accelerations and speeds without needing to actually print something and waste filament: just run some high-speed moves in between the `GET_POSITION` commands.
uk: Це може бути корисним, щоб налаштувати налаштування, такі як кроковий двигун струми, прискорення та швидкості, не потрібно, щоб фактично друкувати щось та відходи ниток, просто запустити деякі швидкісні переміщення між командами `GET_SETTING`.

source: Note that endstop switches themselves tend to trigger at slightly different positions, so a difference of a couple of microsteps is likely the result of endstop inaccuracies. A stepper motor itself can only lose steps in increments of 4 full steps. (So, if one is using 16 microsteps, then a lost step on the stepper would result in the "mcu:" step counter being off by a multiple of 64 microsteps.)
uk: Зверніть увагу, що ендостоп перемикає себе, як правило, викликається на незначних різних позиціях, тому різниця пари мікрокропів, швидше за все, результат ендостопної неточності. Сам кроковий двигун може тільки втратити кроки в надбавках 4 повних кроків. (Так, якщо один використовує 16 мікрокропів, то загублений крок на степпері призведе до «мку:» крокової стійки, що відключається декількома мікрокрокрокропами 64.)

source: Why does Klipper report errors? I lost my print!
uk: Чому помилки звіту Klipper? Я втратив свій друк!

source: Short answer: We want to know if our printers detect a problem so that the underlying issue can be fixed and we can obtain great quality prints. We definitely do not want our printers to silently produce low quality prints.
uk: Коротка відповідь: Ми хочемо знати, якщо наші принтери виявляють проблему, щоб базовий номер можна виправити, і ми можемо отримати відмінні якості друку. Ми обов'язково не хочемо, щоб наші принтери мовчали виготовили низькі якості друку.

source: Long answer: Klipper has been engineered to automatically workaround many transient problems. For example, it automatically detects communication errors and will retransmit; it schedules actions in advance and buffers commands at multiple layers to enable precise timing even with intermittent interference. However, should the software detect an error that it can not recover from, if it is commanded to take an invalid action, or if it detects it is hopelessly unable to perform its commanded task, then Klipper will report an error. In these situations there is a high risk of producing a low-quality print (or worse). It is hoped that alerting the user will empower them to fix the underlying issue and improve the overall quality of their prints.
uk: Довгий відповідь: Klipper був розроблений, щоб автоматично працювати багато проблем. Наприклад, автоматично виявляє помилки зв'язку і переадресує; він розкладає дії заздалегідь і буфери команди на декількох шарах, щоб забезпечити точний час, навіть з перешкодами. Однак, слід виявити помилку, що вона не може відновитися від, якщо вона командується, щоб прийняти недійсну дію, або якщо вона виявить, що це неможливе, щоб виконати своє командне завдання, то Klipper повідомить про помилку. У цих ситуаціях існує високий ризик створення неякісного друку (або гірше). Сподіваємось, що оповіщення користувача надасть їм можливість виправити основну проблему і підвищити загальну якість їх друку.

source: There are some related questions: Why doesn't Klipper pause the print instead? Report a warning instead? Check for errors before the print? Ignore errors in user typed commands? etc? Currently Klipper reads commands using the G-Code protocol, and unfortunately the G-Code command protocol is not flexible enough to make these alternatives practical today. There is developer interest in improving the user experience during abnormal events, but it is expected that will require notable infrastructure work (including a shift away from G-Code).
uk: Питання та відповіді Чому б не зафіксувати друк? Повідомити про це повідомлення? Перевірити помилки до друку? Ігнорувати помилки у користувацьких командах? і т.д. Зараз Klipper читати команди за допомогою протоколу G-Code, і, на жаль, протокол команд G-Code не є достатньо гнучким, щоб зробити ці альтернативи практичними сьогодні. Зацікавлення розробника при покращенні досвіду користувачів при аноматичних подіях, але очікується, що вимагатиметься нездійсненна інфраструктурна робота (включаючи відключення від G-Code).

source: How do I upgrade to the latest software?
uk: Як оновити до останнього програмного забезпечення?

source: The first step to upgrading the software is to review the latest [config changes](Config_Changes.md) document. On occasion, changes are made to the software that require users to update their settings as part of a software upgrade. It is a good idea to review this document prior to upgrading.
uk: Першим кроком для оновлення програмного забезпечення є огляд останніх [Налаштування змін](Config_Changes.md) документа. Звісно, зміни внесені до програмного забезпечення, яке вимагає від користувачів оновлювати свої налаштування в рамках оновлення програмного забезпечення. Це гарна ідея для перегляду цього документа до оновлення.

source: When ready to upgrade, the general method is to ssh into the Raspberry Pi and run:
uk: Коли готовий оновити, загальний метод полягає в тому, щоб сса в Малини Пі і запустити:

source: Then one can recompile and flash the micro-controller code. For example:
uk: Після чого можна перезгорнути і зафіксувати мікроконтролерний код. Наприклад:

source: However, it's often the case that only the host software changes. In this case, one can update and restart just the host software with:
uk: Тим не менш, часто справа, що тільки зміни програмного забезпечення. У цьому випадку можна оновити та перезавантажити лише програмне забезпечення для проведення:

source: If after using this shortcut the software warns about needing to reflash the micro-controller or some other unusual error occurs, then follow the full upgrade steps outlined above.
uk: Якщо після використання цього ярлика програмне забезпечення попереджає про необхідність рефлешування мікроконтролера або деяких інших незвичайних помилок, то слідувати за повними кроками оновлення, викладеними вище.

source: If any errors persist then double check the [config changes](Config_Changes.md) document, as you may need to modify the printer configuration.
uk: Якщо будь-які помилки зберігаються, то подвійний перевірте [Налаштування змін](Config_Changes.md) документ, як ви можете змінити налаштування принтера.

source: Note that the RESTART and FIRMWARE_RESTART g-code commands do not load new software - the above "sudo service klipper restart" and "make flash" commands are needed for a software change to take effect.
uk: Зверніть увагу, що RESTART та FIRMWARE_ Команда RESTART g-code не завантажує нове програмне забезпечення - вище "sudo service klipper restart" і команди "make flash" потрібні для зміни програмного забезпечення, щоб прийняти ефект.

source: How do I uninstall Klipper?
uk: Як видалити Klipper?

source: On the firmware end, nothing special needs to happen. Just follow the flashing directions for the new firmware.
uk: В кінці прошивки нічого особливого необхідно стати. Просто стежте за напрямами спалаху нової прошивки.

source: On the raspberry pi end, an uninstall script is available in [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh). For example:
uk: В кінці малинового стовпа можна видалити скрипт [scripts/klipper-uninstall.sh](./scripts/klipper-uninstall.sh). Наприклад:

source: sudo service klipper stop make flash FLASH_DEVICE=/dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0 sudo service klipper start
uk: sudo обслуговування klipper стоп зробити флеш FLASH_DEVICE=/dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0 sudo сервіс klipper старт

source: [mcu] serial: /dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0
uk: [mcu] Серія: /dev/serial/by-id/usb-1a86_USB2.0-Serial-if00-port0

source: [mcu] baud: 250000
uk: [mcu] дужина: 250000

source: cd ~/klipper git pull ~/klipper/scripts/install-octopi.sh
uk: cd ~ / клиппер git тягнути javascript licenses api веб-сайт go1.13.8

source: make menuconfig make clean make sudo service klipper stop make flash FLASH_DEVICE=/dev/ttyACM0 sudo service klipper start
uk: налаштування меню Чистий Зроби sudo обслуговування klipper стоп зробити флеш FLASH_DEVICE=/dev/ttyACM0 sudo сервіс klipper старт

source: cd ~/klipper git pull sudo service klipper restart
uk: cd ~ / клиппер git тягнути sudo обслуговування klipper кварц

source: sudo ~/klipper/scripts/klipper-uninstall.sh rm -rf ~/klippy-env ~/klipper
uk: javascript licenses api веб-сайт go1.13.8 rm -rf ~/klippy-env ~/клиппер

source: Frequently Asked Questions
uk: Поширені питання та відповіді на них

source: For running on the Beaglebone, see the [Beaglebone specific installation instructions](Beaglebone.md).
uk: Для запуску на Beaglebone див. в розділі [Налаштування конкретної інсталяції](Beaglebone.md).

source: If using a Raspberry Pi, use a [good quality power supply](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) for the Raspberry Pi and use a [good quality USB cable](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) to connect that power supply to the Pi. If you get "under voltage" warnings from OctoPrint, this is related to the power supply and it must be fixed.
uk: Якщо ви використовуєте Raspberry Pi, скористайтеся [Високою якістю харчування](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) для Малина Пі та скористайтеся [good якість USB-кабель](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) для підключення цього джерела живлення на Пі. Якщо ви отримуєте "під напругою" попередження від OctoPrint, це пов'язано з живленням і його необхідно зафіксувати.

source: When I set `restart_method=command` my AVR device just hangs on a restart
uk: Коли я поставив `restart_method=command` мій AVR пристрій просто висить на решті

source: Thank you for your support. See the [Sponsors page](Sponsors.md) for information.
uk: Дякуємо за підтримку. Дивитися сторінку [Спонсори](Спонсори.md) для інформації.
