Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: uk

source: The data can be processed later by the following scripts: `scripts/graph_accelerometer.py` and `scripts/calibrate_shaper.py`. Both of them accept one or several raw csv files as the input depending on the mode. The graph_accelerometer.py script supports several modes of operation:
uk: `scripts/graph_accelerometer.py` і `scripts/calibrate_shaper.py`. Обидва вони приймають один або кілька сирих CSV файлів, як вхід в залежності від режиму. Граф_accelerometer.py скрипт підтримує кілька режимів роботи:

source: plotting raw accelerometer data (use `-r` parameter), only 1 input is supported;
uk: побудова необроблених даних акселерометра (використовуйте параметр `-r`), підтримується лише 1 вхід;

source: plotting a frequency response (no extra parameters required), if multiple inputs are specified, the average frequency response is computed;
uk: позначення періодичної реакції (не обов’язкові параметри), якщо вказані кілька вводів, комп’ютерна реакція середньої частоти;

source: comparison of the frequency response between several inputs (use `-c` parameter); you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used);
uk: порівняння частотної реакції між декількома входами (користування `-c` параметра); можна додатково вказати, яку осі акселерометра, щоб розглянути через `-a x`, `-a y` або `-a z` (якщо не вказано, сума вібрацій для всіх осей використовується);

source: plotting the spectrogram (use `-s` parameter), only 1 input is supported; you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used).
uk: розділяє спектрограму (використання `-s` параметра), підтримується тільки 1 вхід; можна додатково вказати, яку осі акселерометра, щоб розглянути за допомогою `-a x`, `-a y` або `-a z` (якщо не вказано, сума вібрацій для всіх осей використовується).

source: Note that graph_accelerometer.py script supports only the raw_data\*.csv files and not resonances\*.csv or calibration_data\*.csv files.
uk: Зауважте, що граф_accelerometer.py скрипт підтримує лише сиру_data\*.csv файли і не резонанси\*. JavaScript licenses API Веб-сайт Go1.13.8.

source: For example,
uk: Наприклад,

source: will plot the comparison of several `/tmp/raw_data_x_*.csv` files for Z axis to `/tmp/resonances_x.png` file.
uk: розділить порівняння кількох `/tmp/raw_data_x_*.csv` файлів для осі Z до `/tmp/resonances_x.png` файл.

source: The shaper_calibrate.py script accepts 1 or several inputs and can run automatic tuning of the input shaper and suggest the best parameters that work well for all provided inputs. It prints the suggested parameters to the console, and can additionally generate the chart if `-o output.png` parameter is provided, or the CSV file if `-c output.csv` parameter is specified.
uk: Скрипт формаr_calibrate.py приймає 1 або кілька вводів і може запустити автоматичне налаштування вхідної форми і запропонувати кращі параметри, які добре працюють для всіх наданих вводів. Друковано запропоновані параметри до консолі, а також може додатково генерувати діаграму, якщо параметр `-o вихід.png` надається, або файл CSV, якщо `-c вихід.csv`.

source: Providing several inputs to shaper_calibrate.py script can be useful if running some advanced tuning of the input shapers, for example:
uk: Надання декількох входів до форматора_calibrate.py скрипт може бути корисний, якщо запустити деякі розширені настройки вхідної форми, наприклад:

source: Running `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (and `Y` axis) for a single axis twice on a bed slinger printer with the accelerometer attached to the toolhead the first time, and the accelerometer attached to the bed the second time in order to detect axes cross-resonances and attempt to cancel them with input shapers.
uk: Запуск `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (і `Y`) для одноосьового вісь двічі на прибиральному принтері з акселерометром, прикріпленим до інструментального керівника першого разу, а акселерометр прикріплюється до ліжка другий раз для виявлення осей крос-резонансів і спроб скасування їх вводними форматорами.

source: Running `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` twice on a bed slinger with a glass bed and a magnetic surfaces (which is lighter) to find the input shaper parameters that work well for any print surface configuration.
uk: `TEST_ RESONANCES AXIS=Y OUTPUT=raw_data` двічі на вкладній шляпці зі скляним ліжком та магнітними поверхнями (який легше) знайти параметри вводу, які добре працюють для будь-якої конфігурації поверхні друку.

source: Combining the resonance data from multiple test points.
uk: Поєднання резонансних даних з декількох тестових точок.

source: Combining the resonance data from 2 axis (e.g. on a bed slinger printer to configure X-axis input_shaper from both X and Y axes resonances to cancel vibrations of the *bed* in case the nozzle 'catches' a print when moving in X axis direction).
uk: Комбінація резонансних даних з осі 2 (наприклад, на постільному принтері для налаштовування вводу X-і осі X-резонансних резонансів для скасування вібрацій *bed* у випадку, якщо насадка 'catches' друку при переході в осі X).

source: ~/klippy-env/bin/pip install -v numpy
uk: ~/klippy-env/bin/pip встановлення -v numpy

source: Recv: // adxl345 values (x, y, z): 470.719200, 941.438400, 9728.196800
uk: Рев: // ADxl345 значення (x, y, z): 470.719200, 941.438400, 9728.196800

source: [resonance_tester] accel_chip: adxl345 accel_per_hz: 50 # default is 75 probe_points: ...
uk: [resonance_tester] accel_chip: adxl345 accel_per_hz: 50 # за замовчуванням 75 точки_зонду: ...

source: Fitted shaper 'zv' frequency = 34.4 Hz (vibrations = 4.0%, smoothing ~= 0.132) To avoid too much smoothing with 'zv', suggested max_accel <= 4500 mm/sec^2 Fitted shaper 'mzv' frequency = 34.6 Hz (vibrations = 0.0%, smoothing ~= 0.170) To avoid too much smoothing with 'mzv', suggested max_accel <= 3500 mm/sec^2 Fitted shaper 'ei' frequency = 41.4 Hz (vibrations = 0.0%, smoothing ~= 0.188) To avoid too much smoothing with 'ei', suggested max_accel <= 3200 mm/sec^2 Fitted shaper '2hump_ei' frequency = 51.8 Hz (vibrations = 0.0%, smoothing ~= 0.201) To avoid too much smoothing with '2hump_ei', suggested max_accel <= 3000 mm/sec^2 Fitted shaper '3hump_ei' frequency = 61.8 Hz (vibrations = 0.0%, smoothing ~= 0.215) To avoid too much smoothing with '3hump_ei', suggested max_accel <= 2800 mm/sec^2 Recommended shaper is mzv @ 34.6 Hz
uk: В'язана формар 'zv' частота = 34.4 Hz (vibrations = 4.0%, розгладжування ~= 0.132) Щоб уникнути занадто багато розгладжування з 'zv', запропонував макс_accel <= 4500 мм/сек^2 В'язана формар 'mzv' частота = 34.6 Hz (vibrations = 0.0%, розгладжування ~= 0.170) Щоб уникнути занадто багато плавлення з 'mzv', запропонував макс_accel <= 3500 мм/сек^2 В'язана формар 'е' частота = 41.4 Hz (vibrations = 0.0%, розгладжування ~= 0.188) Щоб уникнути занадто багато розгладжування з 'ei', запропонував макс_accel <= 3200 мм/сек^2 В'язана формар '2hump_ei' частота = 51.8 Hz (vibrations = 0.0%, розгладжування ~= 0.201) Щоб уникнути занадто багато розгладжування з '2hump_ei', запропонував макс_accel <= 3000 мм/сек^2 В'язана формар '3hump_ei' частота = 61.8 Hz (vibrations = 0.0%, розгладжування ~= 0.215) Щоб уникнути занадто багато розгладжування з '3hump_ei', запропонував макс_accel <= 2800 мм/сек^2 Рекомендований форматор - mzv @ 34.6 ХХз

source: [input_shaper] shaper_freq_x: ... shaper_type_x: ... shaper_freq_y: 34.6 shaper_type_y: mzv [printer] max_accel: 3000 # should not exceed the estimated max_accel for X and Y axes
uk: [input_shaper] JavaScript licenses API Веб-сайт Go1.13.8 JavaScript licenses API Веб-сайт Go1.13.8 JavaScript licenses API Веб-сайт Go1.13.8 JavaScript licenses API Веб-сайт Go1.13.8 [принтер] max_accel: 3000 # не повинен перевищувати оцінений макс_accel для X і Y осі

source: [adxl345 hotend] # Assuming `hotend` chip is connected to an RPi cs_pin: rpi:None [adxl345 bed] # Assuming `bed` chip is connected to a printer MCU board cs_pin: ... # Printer board SPI chip select (CS) pin [resonance_tester] # Assuming the typical setup of the bed slinger printer accel_chip_x: adxl345 hotend accel_chip_y: adxl345 bed probe_points: ...
uk: [adxl345 hotend] # Припустимо, що мікросхему `hotend` підключено до RPi cs_pin: rpi: немає [adxl345 ліжко] # Припустимо, що мікросхему `bed` підключено до плати MCU принтера cs_pin: ... # Вибір мікросхеми SPI плати принтера (CS). [resonance_tester] # Припустимо типове налаштування принтера bed sling accel_chip_x: adxl345 hotend accel_chip_y: ліжко adxl345 точки_зонду: ...

source: Fitted shaper 'zv' frequency = 57.8 Hz (vibrations = 20.3%, smoothing ~= 0.053) To avoid too much smoothing with 'zv', suggested max_accel <= 13000 mm/sec^2 Fitted shaper 'mzv' frequency = 34.8 Hz (vibrations = 3.6%, smoothing ~= 0.168) To avoid too much smoothing with 'mzv', suggested max_accel <= 3600 mm/sec^2 Fitted shaper 'ei' frequency = 48.8 Hz (vibrations = 4.9%, smoothing ~= 0.135) To avoid too much smoothing with 'ei', suggested max_accel <= 4400 mm/sec^2 Fitted shaper '2hump_ei' frequency = 45.2 Hz (vibrations = 0.1%, smoothing ~= 0.264) To avoid too much smoothing with '2hump_ei', suggested max_accel <= 2200 mm/sec^2 Fitted shaper '3hump_ei' frequency = 48.0 Hz (vibrations = 0.0%, smoothing ~= 0.356) To avoid too much smoothing with '3hump_ei', suggested max_accel <= 1500 mm/sec^2 Recommended shaper is 2hump_ei @ 45.2 Hz
uk: В'язана формар 'zv' частота = 57.8 Hz (vibrations = 20.3%, розгладжування ~= 0.053) Щоб уникнути занадто багато розгладжування з 'zv', запропонував макс_accel <= 13000 мм/сек^2 В'язана формар 'mzv' частота = 34.8 Hz (vibrations = 3.6%, розгладжування ~= 0.168) Щоб уникнути занадто багато плавлення з 'mzv', запропонував макс_accel <= 3600 мм/сек^2 В'язана формар 'е' частота = 48.8 Hz (vibrations = 4.9%, розгладжування ~= 0.135) Щоб уникнути занадто багато розгладжування з 'ei', запропонував макс_accel <= 4400 мм/сек^2 В'язана формар '2hump_ei' частота = 45.2 Hz (vibrations = 0.1%, розгладжування ~= 0.264) Щоб уникнути занадто багато розгладжування з '2hump_ei', запропонував макс_accel <= 2200 мм/sec^2 В'язана формар '3hump_ei' частота = 48.0 Hz (vibrations = 0.0%, розгладжування ~= 0.356) Щоб уникнути занадто багато плавлення з '3hump_ei', запропонував макс_accel <= 1500 мм/сек^2 Рекомендований форматор 2hump_ei @ 45.2 ХХз

source: Fitted shaper 'zv' frequency = 55.4 Hz (vibrations = 19.7%, smoothing ~= 0.057) To avoid too much smoothing with 'zv', suggested max_accel <= 12000 mm/sec^2 Fitted shaper 'mzv' frequency = 34.6 Hz (vibrations = 3.6%, smoothing ~= 0.170) To avoid too much smoothing with 'mzv', suggested max_accel <= 3500 mm/sec^2 Fitted shaper 'ei' frequency = 48.2 Hz (vibrations = 4.8%, smoothing ~= 0.139) To avoid too much smoothing with 'ei', suggested max_accel <= 4300 mm/sec^2 Fitted shaper '2hump_ei' frequency = 52.0 Hz (vibrations = 2.7%, smoothing ~= 0.200) To avoid too much smoothing with '2hump_ei', suggested max_accel <= 3000 mm/sec^2 Fitted shaper '3hump_ei' frequency = 72.6 Hz (vibrations = 1.4%, smoothing ~= 0.155) To avoid too much smoothing with '3hump_ei', suggested max_accel <= 3900 mm/sec^2 Recommended shaper is 3hump_ei @ 72.6 Hz
uk: В'язана формар 'zv' частота = 55.4 Hz (vibrations = 19.7%, розгладжування ~= 0.057) Щоб уникнути занадто багато розгладжування з 'zv', запропонував макс_accel <= 12000 мм/сек^2 В'язана формар 'mzv' частота = 34.6 Hz (vibrations = 3.6%, розгладжування ~= 0.170) Щоб уникнути занадто багато плавлення з 'mzv', запропонував макс_accel <= 3500 мм/сек^2 В'язана формар 'е' частота = 48.2 Hz (vibrations = 4.8%, розгладжування ~= 0.139) Щоб уникнути занадто багато розгладжування з 'ei', запропонував макс_accel <= 4300 мм/сек^2 В'язана формар '2hump_ei' частота = 52.0 Hz (vibrations = 2.7%, розгладжування ~= 0.200) Щоб уникнути занадто багато розгладжування з '2hump_ei', запропонував макс_accel <= 3000 мм/сек^2 В'язана формар '3hump_ei' частота = 72.6 Hz (vibrations = 1,4%, розгладжування ~= 0.155) Щоб уникнути занадто багато розгладжування з '3hump_ei', запропонував макс_accel <= 3900 мм/сек^2 Рекомендований формар 3hump_ei @ 72.6 ХХз

source: [resonance_tester] accel_chip: ... probe_points: ... max_smoothing: 0.25 # an example
uk: [resonance_tester] accel_chip: ... теги: ... max_smoothing: 0.25 # приклад

source: Calculating the best input shaper parameters for y axis Fitted shaper 'zv' frequency = 39.0 Hz (vibrations = 13.2%, smoothing ~= 0.105) To avoid too much smoothing with 'zv', suggested max_accel <= 5900 mm/sec^2 Fitted shaper 'mzv' frequency = 36.8 Hz (vibrations = 1.7%, smoothing ~= 0.150) To avoid too much smoothing with 'mzv', suggested max_accel <= 4000 mm/sec^2 Fitted shaper 'ei' frequency = 36.6 Hz (vibrations = 2.2%, smoothing ~= 0.240) To avoid too much smoothing with 'ei', suggested max_accel <= 2500 mm/sec^2 Fitted shaper '2hump_ei' frequency = 48.0 Hz (vibrations = 0.0%, smoothing ~= 0.234) To avoid too much smoothing with '2hump_ei', suggested max_accel <= 2500 mm/sec^2 Fitted shaper '3hump_ei' frequency = 59.0 Hz (vibrations = 0.0%, smoothing ~= 0.235) To avoid too much smoothing with '3hump_ei', suggested max_accel <= 2500 mm/sec^2 Recommended shaper_type_y = mzv, shaper_freq_y = 36.8 Hz
uk: Розрахунок кращих параметрів вводу для осі я В'язана формар 'zv' частота = 39.0 Hz (vibrations = 13.2%, розгладжування ~= 0.105) Щоб уникнути занадто багато розгладжування з 'zv', запропонував макс_accel <= 5900 мм/сек^2 В'язана формар 'mzv' частота = 36.8 Hz (vibrations = 1.7%, розгладжування ~= 0.150) Щоб уникнути занадто багато розгладжування з 'mzv', запропонував макс_accel <= 4000 мм/сек^2 В'язана формар 'я' частота = 36.6 Hz (vibrations = 2.2%, розгладжування ~= 0.240) Щоб уникнути занадто багато розгладжування з 'ei', запропонував макс_accel <= 2500 мм/сек^2 В'язана формар '2hump_ei' частота = 48.0 Hz (vibrations = 0.0%, розгладжування ~= 0.234) Щоб уникнути занадто багато розгладжування з '2hump_ei', запропонував макс_accel <= 2500 мм/сек^2 В'язана формар '3hump_ei' частота = 59.0 Hz (vibrations = 0.0%, розгладжування ~= 0.235) Щоб уникнути занадто багато розгладжування з '3hump_ei', запропонував макс_accel <= 2500 мм/сек^2 Рекомендований форматор_type_y = mzv, формаr_freq_y = 36.8 ХХз

source: SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0 TEST_RESONANCES AXIS=X OUTPUT=raw_data
uk: СЕТ_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0 TEST_RESONANCES AXIS=X OUTPUT=raw_data

source: ~/klipper/scripts/graph_accelerometer.py /tmp/raw_data_x_*.csv -o /tmp/resonances_x.png -c -a z
uk: javascript licenses api веб-сайт go1.13.8 javascript licenses api веб-сайт go1.13.8

source: Testing custom axes
uk: Тестування користувальницьких осей

source: `TEST_RESONANCES` command supports custom axes. While this is not really useful for input shaper calibration, it can be used to study printer resonances in-depth and to check, for example, belt tension.
uk: `TEST_RESONANCES` команда підтримує користувацькі осі. В той час як це не дуже корисно для калібрування вводу, його можна використовувати для вивчення резонансів принтера глибоко і для перевірки, наприклад, натяг стрічки.

source: To check the belt tension on CoreXY printers, execute
uk: Для перевірки натягу стрічки на принтерах CoreXY, виконання

source: and use `graph_accelerometer.py` to process the generated files, e.g.
uk: `graph_accelerometer.py` для обробки створених файлів, наприклад.

source: which will generate `/tmp/resonances.png` comparing the resonances.
uk: `/tmp/resonances.png` порівняння резонансів.

source: For Delta printers with the default tower placement (tower A ~= 210 degrees, B ~= 330 degrees, and C ~= 90 degrees), execute
uk: Для принтерів Delta з розміщенням за замовчуванням (підтримка A ~= 210 градусів, B ~=330 градусів, а C ~= 90 градусів), виконання

source: and then use the same command
uk: а потім використовувати однакову команду

source: to generate `/tmp/resonances.png` comparing the resonances.
uk: щоб створити `/tmp/resonances.png` для порівняння резонансів.

source: [mcu rpi] serial: /tmp/klipper_host_mcu [adxl345] cs_pin: rpi:None [resonance_tester] accel_chip: adxl345 probe_points: 100, 100, 20 # an example
uk: [mcu rpi] /tmp/klipper_host_mcu [adxl345] JavaScript licenses API Веб-сайт Go1.13.8 [resonance_tester] accel_chip: adxl345 Теги: 100, 100, 20 # приклад

source: The raw data can also be obtained by running the command `ACCELEROMETER_MEASURE` command twice during some normal printer activity - first to start the measurements, and then to stop them and write the output file. Refer to [G-Codes](G-Codes.md#adxl345) for more details.
uk: Сирі дані також можуть бути отримані за допомогою запуску команди `ACCELEROMETER_MEASURE` команди двічі під час нормальної активності принтера - спочатку почати вимірювання, а потім зупинити їх і написати вихідний файл. [G-Codes](G-Codes.md#adxl345) Детальніше.

source: MPU-9250 pin
uk: МПУ-9250 шпилька

source: Note that resonance measurements and shaper auto-calibration require additional software dependencies not installed by default. First, run on your Raspberry Pi the following commands:
uk: Зверніть увагу, що резонансні вимірювання та автоматичне калібрування формувача вимагають додаткових залежностей програмного забезпечення, не встановлених за замовчуванням. Спочатку запустіть на Raspberry Pi наступні команди:

source: Next, in order to install NumPy in the Klipper environment, run the command:
uk: Далі, щоб встановити NumPy в середовищі Klipper, запустити команду:

source: Note that, depending on the performance of the CPU, it may take *a lot* of time, up to 10-20 minutes. Be patient and wait for the completion of the installation. On some occasions, if the board has too little RAM the installation may fail and you will need to enable swap.
uk: Зауважте, що в залежності від продуктивності ЦП може знадобитися *a багато* часу, до 10-20 хвилин. Будьте хворими і чекайте завершення монтажу. У деяких випадках, якщо дошка занадто мало оперативної пам'яті, установка може бути неможливим, і вам буде потрібно включити застібку.

source: [mcu rpi] serial: /tmp/klipper_host_mcu [mpu9250] i2c_mcu: rpi i2c_bus: i2c.1 [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # an example
uk: [mcu rpi] /tmp/klipper_host_mcu [mpu9250] i2c_mcu: свінгери i2c_bus: i2c.1 [resonance_tester] accel_chip: mpu9250 теги: 100, 100, 20 # приклад

source: ***Double-check your wiring before powering up to prevent damaging your MCU/Raspberry Pi or the accelerometer.***
uk: ***Подвійний контроль перед живленням, щоб запобігти знешкодженню MCU/Raspberry Pi або акселерометра.***

source: SPI Accelerometers
uk: SPI Акселерометри

source: GND+MISO 3.3V+MOSI SCLK+CS
uk: ГНД+МІСО 3.3В+МОСИ СКЛК+КС

source: ADXL345
uk: АДСЛ345

source: I2C Accelerometers
uk: I2C Акселерометри

source: 3.3V+SDA GND+SCL
uk: 3.3В+СД ГНД+СКЛ

source: MPU-9250/MPU-9255/MPU-6515/MPU-6050/MPU-6500
uk: МПУ-9250/МПУ-9255/МПУ-6515/МПУ-6050/МПУ-6500

source: Recommended connection scheme for I2C on the Raspberry Pi:
uk: Рекомендована схема підключення I2C на Малина Пі:

source: VCC
uk: ВКЦ

source: RP2040 pin
uk: RP2040 шпилька

source: 3v3
uk: 3в3

source: Configure ADXL345 With RPi
uk: Налаштування ADXL345 з RPi

source: Add the following to the printer.cfg file:
uk: Додати наступний до файлу принтера.cfg:

source: Configure MPU-6000/9000 series With RPi
uk: Налаштування серії MPU-6000/9000 з RPi

source: Make sure the Linux I2C driver is enabled and the baud rate is set to 400000 (see [Enabling I2C](RPi_microcontroller.md#optional-enabling-i2c) section for more details). Then, add the following to the printer.cfg:
uk: Переконайтеся, що драйвер Linux I2C ввімкнено, а курс baud встановлюється до 400000 (див. [Включення I2C](RPi_microcontroller.md#optional-enabling-i2c) для більш детальної інформації). Потім додайте наступний до принтера.cfg:

source: Direct to Raspberry Pi
uk: Пряма до Малина Пі

source: 3.3V DC power
uk: 3.3V DC потужність

source: Using Raspberry Pi Pico
uk: Використання Raspberry Pico

source: You may connect the ADXL345 to your Raspberry Pi Pico and then connect the Pico to your Raspberry Pi via USB. This makes it easy to reuse the accelerometer on other Klipper devices, as you can connect via USB instead of GPIO. The Pico does not have much processing power, so make sure it is only running the accelerometer and not performing any other duties.
uk: Ви можете підключити ADXL345 до вашого Raspberry Pico, а потім підключити Pico до вашого Малина Пі через USB. Це дозволяє легко використовувати акселерометр на інших пристроях Klipper, оскільки ви можете підключити через USB замість GPIO. Піко не має багатої потужності обробки, тому переконайтеся, що це тільки працює акселерометр і не виконує ніяких інших обов'язків.

source: In order to avoid damage to your RPi make sure to connect the ADXL345 to 3.3V only. Depending on the board's layout, a level shifter may be present, which makes 5V dangerous for your RPi.
uk: Для того, щоб уникнути пошкодження RPi переконайтеся, що підключення ADXL345 до 3.3V тільки. В залежності від макета дошки може бути присутнім перехідник рівня, що робить 5V небезпечним для вашого RPi.

source: Pico pin
uk: Піко шпильки

source: Pico pin name
uk: Назва поштового штифта Pico

source: Wiring diagrams for some of the ADXL345 boards:
uk: Схема підключення для деяких плат ADXL345:

source: Configure ADXL345 With Pi Pico
uk: Налаштування ADXL345 з Pico

source: Flash the Pico Firmware
uk: Прошивка Pico

source: On your Raspberry Pi, compile the firmware for the Pico.
uk: На Raspberry Pi, компіляція прошивки для Pico.

source: cd ~/klipper make clean make menuconfig
uk: cd ~ / клиппер чистий налаштування меню

source: ![Pico menuconfig](img/klipper_pico_menuconfig.png)
uk: ![Pico менюconfig](img/klipper_pico_menuconfig.png)

source: Now, while holding down the `BOOTSEL` button on the Pico, connect the Pico to the Raspberry Pi via USB. Compile and flash the firmware.
uk: Тепер, утримуючи `BOOTSEL` кнопка на Піко, підключіть Піко до Малини Пі через USB. Прошивка і прошивка.

source: make flash FLASH_DEVICE=first
uk: зробити флеш FLASH_DEVICE=перший

source: If that fails, you will be told which `FLASH_DEVICE` to use. In this example, that's `make flash FLASH_DEVICE=2e8a:0003`. ![Determine flash device](img/flash_rp2040_FLASH_DEVICE.png)
uk: Якщо ви не змогли, ви сказали, що `FLASH_DEVICE` для використання. У цьому прикладі, що ` змія флеш FLASH_DEVICE=2e8a:0003`. ![Визначення флеш-пристрою](img/flash_rp2040_FLASH_DEVICE.png)

source: Configure the Connection
uk: Налаштування підключення

source: The Pico will now reboot with the new firmware and should show up as a serial device. Find the pico serial device with `ls /dev/serial/by-id/*`. You can now add an `adxl.cfg` file with the following settings:
uk: Піко тепер перезавантажить нову прошивку і повинен показати як серійний пристрій. Знайдіть послідовний пристрій піко з `ls /dev/serial/by-id/*`. Тепер можна додати файл `adxl.cfg` з наступними налаштуваннями:
