Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: uk

source: [mcu adxl] # Change <mySerial> to whatever you found above. For example, # usb-Klipper_rp2040_E661640843545B2E-if00 serial: /dev/serial/by-id/usb-Klipper_rp2040_<mySerial> [adxl345] cs_pin: adxl:gpio1 spi_bus: spi0a axes_map: x,z,y [resonance_tester] accel_chip: adxl345 probe_points: # Somewhere slightly above the middle of your print bed 147,154, 20 [output_pin power_mode] # Improve power stability pin: adxl:gpio23
uk: [mcu adxl] Нема Змініть <mySerial>, щоб дізнатися вище. Наприклад, # usb-Klipper_rp2040_E661640843545B2E-if00 /dev/serial/by-id/usb-Klipper_rp2040_<mySerial> [adxl345] cs_pin: adxl:gpio1 spi_bus: spi0a JavaScript licenses API Веб-сайт Go1.13.8 [resonance_tester] accel_chip: adxl345 Теги: # Десь трохи вище середини вашого принту ліжко 147,154, 20 [вихід_pin power_mode] # Підвищення стабільності потужності шпилька: adxl:gpio23

source: If setting up the ADXL345 configuration in a separate file, as shown above, you'll also want to modify your `printer.cfg` file to include this:
uk: Якщо налаштування конфігурації ADXL345 в окремому файлі, як показано вище, ви також хочете змінити файл `printer.cfg`, щоб включити цей:

source: [include adxl.cfg] # Comment this out when you disconnect the accelerometer
uk: [включає adxl.cfg] # Comment this out, коли ви відключите акселерометр

source: If you get an error like `Invalid adxl345 id (got xx vs e5)`, where `xx` is some other ID, immediately try again. There's an issue with SPI initialization. If you still get an error, it is indicative of the connection problem with ADXL345, or the faulty sensor. Double-check the power, the wiring (that it matches the schematics, no wire is broken or loose, etc.), and soldering quality.
uk: Якщо ви отримуєте помилку, як `Invalid adxl345 id (got xx vs e5)`, де `xx` є інший ID, негайно спробуйте знову. Питання ініціалізації SPI. Якщо ви все ще отримуєте помилку, це індексує проблему з'єднання з ADXL345 або датчиком несправності. Подвійне зчепити потужність, електропроводка (тобто вона відповідає схемі, не зламаний дріт або пухкий і т.д.), і якість пайки.

source: Note that alternatively you can run the input shaper auto-calibration from Klipper [directly](#input-shaper-auto-calibration), which can be convenient, for example, for the input shaper [re-calibration](#input-shaper-re-calibration).
uk: Зауважте, що альтернативно ви можете запустити вводну формувальну автоматичну калібрацію з Klipper [прямо](#input-shaper-auto-calibration), яка може бути зручною, наприклад, для вхідної форми [re-calibration](#input-shaper-re-calibration).

source: **Warning!** It is not advisable to run the shaper auto-calibration very frequently (e.g. before every print, or every day). In order to determine resonance frequencies, auto-calibration creates intensive vibrations on each of the axes. Generally, 3D printers are not designed to withstand a prolonged exposure to vibrations near the resonance frequencies. Doing so may increase wear of the printer components and reduce their lifespan. There is also an increased risk of some parts unscrewing or becoming loose. Always check that all parts of the printer (including the ones that may normally not move) are securely fixed in place after each auto-tuning.
uk: **Налаштування!** Не доцільно запустити автоматичну калібрацію фігурки дуже часто (наприклад, перед кожним друком або кожним днем). Для визначення резонансних частот автокальібрація створює інтенсивні коливання на кожному з осей. Зазвичай принтери 3D не призначені для витримки тривалого впливу коливань біля резонансних частот. Дозування може збільшити знос компонентів принтера і зменшити термін служби. Також є підвищений ризик виникнення певних частин, що незламні або стають пухкими. Завжди перевірте, що всі частини принтера (в тому числі тих, які можуть зазвичай не переходити) надійно зафіксовані в місці після кожного автовиїзду.

source: Klipper has built-in support for the ADXL345, MPU-9250 and LIS2DW compatible accelerometers which can be used to measure resonance frequencies of the printer for different axes, and auto-tune [input shapers](Resonance_Compensation.md) to compensate for resonances. Note that using accelerometers requires some soldering and crimping. The ADXL345/LIS2DW can be connected to the SPI interface of a Raspberry Pi or MCU board (it needs to be reasonably fast). The MPU family can be connected to the I2C interface of a Raspberry Pi directly, or to an I2C interface of an MCU board that supports 400kbit/s *fast mode* in Klipper.
uk: Klipper має вбудовану підтримку ADXL345, MPU-9250 та LIS2DW сумісні акселерометри, які можуть бути використані для вимірювання резонансних частот принтера для різних осей, а також автоматичного відключення [вхідних форм](Resonance_Compensation.md) для компенсації резонансів. Зауважте, що за допомогою акселерометрів вимагає деяких паяльників і ламків. ADXL345/LIS2DW може бути підключений до інтерфейсу SPI Raspberry Pi або MCU (потрібно бути досить швидко). Сім'я МПУ може бути підключена до інтерфейсу I2C Raspberry Pi безпосередньо, або до інтерфейсу I2C дошки МКУ, яка підтримує 400kbit/s *fast режим* в Klipper.

source: When sourcing accelerometers, be aware that there are a variety of different PCB board designs and different clones of them. If it is going to be connected to a 5V printer MCU ensure it has a voltage regulator and level shifters.
uk: При стисканні акселерометрів слід розуміти, що існують різні зразки друкованої плати та різні клони їх. Якщо він буде підключений до принтера 5V MCU, щоб він має регулятор напруги та перемикачі рівня.

source: For ADXL345s/LIS2DWs, make sure that the board supports SPI mode (a small number of boards appear to be hard-configured for I2C by pulling SDO to GND).
uk: Для ADXL345s/LIS2DWs переконайтеся, що дошка підтримує режим SPI (дрібна кількість дощок з'являються, щоб бути важко налаштованими для I2C шляхом витягування SDO до GND).

source: For MPU-9250/MPU-9255/MPU-6515/MPU-6050/MPU-6500s there are also a variety of board designs and clones with different I2C pull-up resistors which will need supplementing.
uk: Для MPU-9250/MPU-9255/MPU-6515/MPU-6050/MPU-6500 є також різноманітними платними конструкціями та клонами з різними резисторами I2C, які потребують доповнення.

source: MCUs with Klipper I2C *fast-mode* Support
uk: MCU з Klipper I2C *fast-mode* Підтримка

source: MCU Family
uk: МКУ Сім'я

source: MCU(s) Tested
uk: MCU(s) Тестовані

source: MCU(s) with Support
uk: MCU(s) з підтримкою

source: Raspberry Pi
uk: Малина Пі

source: 3B+, Pico
uk: 3B+, Піко

source: 3A, 3A+, 3B, 4
uk: 3А, 3А+, 3Б, 4

source: AVR ATmega
uk: АВР АМПА

source: AVR AT90
uk: ВІДЕОРЕЄСТРАТОР AT90

source: An ethernet cable with shielded twisted pairs (cat5e or better) is recommended for signal integrity over a long distance. If you still experience signal integrity issues (SPI/I2C errors):
uk: Кабель ethernet з щитоподібними закрученими парами (кат5e або краще) рекомендується для цілісності сигналу на віддаленій відстані. Якщо ви все ще відчуваєте питання про цілісність сигналів (SPI/I2C):

source: Double check the wiring with a digital multimeter for:
uk: Подвійний контроль проводки з цифровим мультиметром для:

source: Correct connections when turned off (continuity)
uk: Правильні з'єднання при вимкненні (константильність)

source: Correct power and ground voltages
uk: Правильна потужність і напруги

source: I2C only:
uk: I2C тільки:

source: Check the SCL and SDA lines' resistances to 3.3V are in the range of 900 ohms to 1.8K
uk: Перевірити стійкість SCL і SDA ліній до 3.3V в діапазоні 900 ом до 1.8K

source: For full technical details consult [chapter 7 of the I2C-bus specification and user manual UM10204](https://www.pololu.com/file/0J435/UM10204.pdf) for *fast-mode*
uk: Для отримання повної технічної інформації [chapter 7 специфікації та посібник користувача UM10204](https://www.pololu.com/file/0J435/UM10204.pdf) для *fast-mode*

source: Shorten the cable
uk: Скорочення кабелю

source: Connect ethernet cable shielding only to the MCU board/Pi ground.
uk: Підключення електромережі тільки до плати МКУ/Пі мелені.

source: Suggested twisted pair order for three twisted pairs:
uk: Найяскравіший закручений парний порядок для трьох закручених пар:

source: Note that unlike a cable shield, GND must be connected at both ends.
uk: Зверніть увагу, що на відміну від кабельного щита, GND повинен бути підключений як на кінцях.

source: **Note: Many MCUs will work with an ADXL345 in SPI mode (e.g. Pi Pico), wiring and configuration will vary according to your specific board and available pins.**
uk: **Примітка: Багато MCUs буде працювати з ADXL345 в режимі SPI (наприклад, Pico), електропроводка і конфігурація будуть відрізнятися відповідно до вашої конкретної дошки і доступні шпильки **

source: Suggested twisted pair order for three pairs (preferred):
uk: Найяскравіший закручений парний порядок для трьох пар (попередньо):

source: 3.3V+GND SDA+GND SCL+GND
uk: 3.3В+ГНК СДА+GND СКЛ+GND

source: or for two pairs:
uk: або для двох пар:

source: Note that unlike a cable shield, any GND(s) should be connected at both ends.
uk: Зауважте, що на відміну від кабельного щита, будь-які GND(s) повинні бути підключені до обох кінців.

source: These accelerometers have been tested to work over I2C on the RPi, RP2040 (Pico) and AVR at 400kbit/s (*fast mode*). Some MPU accelerometer modules include pull-ups, but some are too large at 10K and must be changed or supplemented by smaller parallel resistors.
uk: Ці акселерометри були протестовані для роботи над I2C на RPi, RP2040 (Pico) та AVR на 400kbit/s (*fast mode*). Деякі модулі акселерометра МПУ включають витяги, але деякі занадто великі на 10K і повинні бути змінені або доповнені меншими паралельними резисторами.

source: The RPi has buit-in 1.8K pull-ups on both SCL and SDA.
uk: RPi має buit-in 1.8K тяги на обох SCL і SDA.

source: ![MPU-9250 connected to Pi](img/mpu9250-PI-fritzing.png)
uk: ![MPU-9250 підключений до Pi](img/mpu9250-PI-fritzing.png)

source: Recommended connection scheme for I2C (i2c0a) on the RP2040:
uk: Рекомендована схема підключення до I2C (i2c0a) на RP2040:

source: RP2040 pin name
uk: RP2040 Назва штифта

source: The Pico does not include any built-in I2C pull-up resistors.
uk: Піко не включає в себе будь-які вбудовані резистори I2C.

source: ![MPU-9250 connected to Pico](img/mpu9250-PICO-fritzing.png)
uk: ![MPU-9250 підключений до Pico](img/mpu9250-PICO-fritzing.png)

source: Recommended connection scheme for I2C(TWI) on the AVR ATmega328P Arduino Nano:
uk: Рекомендована схема підключення до I2C(TWI) на AVR ATmega328P Ардуїно Nano:

source: Atmega328P TQFP32 pin
uk: Atmega328P TQFP32 шпилька

source: Atmega328P pin name
uk: Атмега328П контактна назва

source: Arduino Nano pin
uk: Arduino Нано шпилька

source: The Arduino Nano does not include any built-in pull-up resistors nor a 3.3V power pin.
uk: Arduino Nano не включає в себе будь-які вбудовані резистори витяжки, ані 3.3V силовий штифт.

source: First, check and follow the instructions in the [RPi Microcontroller document](RPi_microcontroller.md) to setup the "linux mcu" on the Raspberry Pi. This will configure a second Klipper instance that runs on your Pi.
uk: По-перше, перевірте та дотримуйтесь інструкцій в [RPi Microcontroller документ](RPi_microcontroller.md) для налаштування "linux mcu" на Raspberry Pi. Це налаштує другий екземпляр кліппера, який працює на Пі.

source: Configure LIS2DW series
uk: Налаштування серії LIS2DW

source: [mcu lis] # Change <mySerial> to whatever you found above. For example, # usb-Klipper_rp2040_E661640843545B2E-if00 serial: /dev/serial/by-id/usb-Klipper_rp2040_<mySerial> [lis2dw] cs_pin: lis:gpio1 spi_bus: spi0a axes_map: x,z,y [resonance_tester] accel_chip: lis2dw probe_points: # Somewhere slightly above the middle of your print bed 147,154, 20
uk: [mcu lis] Нема Змініть <mySerial>, щоб дізнатися вище. Наприклад, # usb-Klipper_rp2040_E661640843545B2E-if00 /dev/serial/by-id/usb-Klipper_rp2040_<mySerial> [lis2dw] cs_pin: lis:gpio1 spi_bus: spi0a JavaScript licenses API Веб-сайт Go1.13.8 [resonance_tester] accel_chip: lis2dw Теги: # Десь трохи вище середини вашого принту ліжко 147,154, 20

source: Configure MPU-9520 Compatibles With Pico
uk: Налаштування MPU-9520 Сумісний з Pico

source: Pico I2C is set to 400000 on default. Simply add the following to the printer.cfg:
uk: Pico I2C встановлюється до 400000 за замовчуванням. Просто додайте наступний до принтера.cfg:

source: [mcu pico] serial: /dev/serial/by-id/<your Pico's serial ID> [mpu9250] i2c_mcu: pico i2c_bus: i2c0a [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # an example [static_digital_output pico_3V3pwm] # Improve power stability pins: pico:gpio23
uk: [mcu pico] послідовність: /dev/serial/by-id/<your Серійний ID Pico> [mpu9250] i2c_mcu: pico i2c_bus: i2c0a [resonance_tester] accel_chip: mpu9250 Теги: 100, 100, 20 # приклад [static_digital_вихід pico_3V3pwm] # Підвищення стабільності потужності шпильки: pico:gpio23

source: Configure MPU-9520 Compatibles with AVR
uk: Налаштування MPU-9520 Сумісний з AVR

source: AVR I2C will be set to 400000 by the mpu9250 option. Simply add the following to the printer.cfg:
uk: AVR I2C буде встановлена до 400000 по параметру mpu9250. Просто додайте наступний до принтера.cfg:

source: [mcu nano] serial: /dev/serial/by-id/<your nano's serial ID> [mpu9250] i2c_mcu: nano [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # an example
uk: [mcu нано] послідовність: /dev/serial/by-id/<your нано послідовний ідентифікатор> [mpu9250] i2c_mcu: нано [resonance_tester] accel_chip: mpu9250 Теги: 100, 100, 20 # приклад

source: **If you are using a MPU-9250 compatible accelerometer and it shows up as `mpu-unknown`, use with caution! They are probably refurbished chips!**
uk: **Якщо ви використовуєте сумісний акселерометр MPU-9250 і він показує як `mpu-unknown```, скористайтеся обережністю! Вони, ймовірно, відремонтовані чіпси! **

source: However, you can also connect two accelerometers simultaneously, though the ADXL345 must be connected to different boards (say, to an RPi and printer MCU board), or to two different physical SPI interfaces on the same board (rarely available). Then they can be configured in the following manner:
uk: Тим не менш, ви також можете підключити два акселерометри одночасно, хоча ADXL345 повинні бути підключені до різних дощок (програш, до плати RPi і принтера MCU), або до двох різних фізичних інтерфейсів SPI на одній дошці (тільки доступні). Далі вони можуть бути налаштовані таким чином:

source: Two MPUs can share one I2C bus, but they **cannot** measure simultaneously as the 400kbit/s I2C bus is not fast enough. One must have its AD0 pin pulled-down to 0V (address 104) and the other its AD0 pin pulled-up to 3.3V (address 105):
uk: Два MPU можуть поділитися одним автобусом I2C, але вони **cannot** вимірювати одночасно як 400kbit/s I2C автобус не дуже швидко. Потрібно мати шпильку AD0 до 0V (адреса 104) і інші її шпильки AD0 до 3.3V (адреса 105):

source: [mpu9250 hotend] i2c_mcu: rpi i2c_bus: i2c.1 i2c_address: 104 # This MPU has pin AD0 pulled low [mpu9250 bed] i2c_mcu: rpi i2c_bus: i2c.1 i2c_address: 105 # This MPU has pin AD0 pulled high [resonance_tester] # Assuming the typical setup of the bed slinger printer accel_chip_x: mpu9250 hotend accel_chip_y: mpu9250 bed probe_points: ...
uk: [mpu9250 hotend] i2c_mcu: rpi i2c_bus: i2c.1 i2c_address: 104 # Цей MPU має низький рівень контакту AD0 [ліжко mpu9250] i2c_mcu: rpi i2c_bus: i2c.1 i2c_address: 105 # Цей MPU має високий висновок AD0 [resonance_tester] # Припустимо типове налаштування принтера bed sling accel_chip_x: mpu9250 hotend accel_chip_y: ліжко mpu9250 точки_зонду: ...

source: [Test with each MPU individually before connecting both to the bus for easy debugging.]
uk: [Тест з кожним МПУ в індивідуальному порядку перед підключенням до автобуса для легкого знеболювання.]

source: sudo apt update sudo apt install python3-numpy python3-matplotlib libatlas-base-dev libopenblas-dev
uk: sudo apt оновлення sudo apt встановити python3-numpy python3-matplotlib libatlas-base-dev libopenblas-dev

source: Keep in mind that the maximum acceleration without too much smoothing depends on the `square_corner_velocity`. The general recommendation is not to change it from its default value 5.0, and this is the value used by default by the `calibrate_shaper.py` script. If you did change it though, you should inform the script about it by passing `--square_corner_velocity=...` parameter, e.g.
uk: Враховуйте, що максимальне прискорення без зайвих зусиль залежить від `square_corner_velocity`. Загальні рекомендації не можна змінити його з його значення за замовчуванням 5.0, і це значення, яке використовується за замовчуванням `calibrate_shaper.py` скрипт. Якщо ви змінили його, ви повинні повідомити скрипт про це, пройшовши `-square_corner_velocity=...` параметр, наприклад.

source: so that it can calculate the maximum acceleration recommendations correctly. Note that the `SHAPER_CALIBRATE` command already takes the configured `square_corner_velocity` parameter into account, and there is no need to specify it explicitly.
uk: таким чином, можна правильно розрахувати максимальні рекомендації прискорення. Зауважте, що `SHAPER_CALIBRATE` команда вже приймає налаштовувані `square_corner_velocity` параметр враховується, і немає необхідності уточнювати його явно.

source: This will generate 2 CSV files (`/tmp/resonances_x_*.csv` and `/tmp/resonances_y_*.csv`). These files can be processed with the stand-alone script on a Raspberry Pi. This script is intended to be run with a single CSV file for each axis measured, although it can be used with multiple CSV files if you desire to average the results. Averaging results can be useful, for example, if resonance tests were done at multiple test points. Delete the extra CSV files if you do not desire to average them.
uk: Це генерує файли 2 CSV (`/tmp/resonances_x_*.csv` та `/tmp/resonances_y_*.csv`). Ці файли можна обробити за допомогою стаціонарного сценарію на Raspberry Pi. Цей скрипт призначений для запуску з одним файлом CSV для кожної осі вимірюється, хоча він може використовуватися з декількома файлами CSV, якщо ви хочете в середньому результати. Результати дослідження можуть бути корисними, наприклад, якщо резонансні тести були зроблені на декількох тестових точках. Видалення додаткових файлів CSV, якщо ви не бажаєте в середньому їх.
