Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: uk

source: Measuring Resonances
uk: Вимірювання Резонансів

source: Installation instructions
uk: Інструкція по монтажу

source: Wiring
uk: Прованс

source: You need to connect ADXL345 to your Raspberry Pi via SPI. Note that the I2C connection, which is suggested by ADXL345 documentation, has too low throughput and **will not work**. The recommended connection scheme:
uk: Вам потрібно підключити ADXL345 до Raspberry Pi через SPI. Зауважте, що підключення I2C, що пропонується документацією ADXL345, має занадто низький пропускний зв'язок і ** не працювати**. Рекомендована схема підключення:

source: ADXL345 pin
uk: ADXL345 шпилька

source: RPi pin
uk: RPI шпильки

source: RPi pin name
uk: Назва RPi

source: 3V3 (or VCC)
uk: 3V3 (або VCC)

source: 3.3v DC power
uk: 3.3v DC потужність

source: GND
uk: ГНД

source: Ground
uk: Головна

source: CS
uk: Р

source: SDO
uk: СДО

source: SDA
uk: СДА

source: SCL
uk: СКЛ

source: Fritzing wiring diagrams for some of the ADXL345 boards:
uk: Фрицтінг схем електропроводки для деяких плат ADXL345:

source: Mounting the accelerometer
uk: Монтаж акселерометра

source: The accelerometer must be attached to the toolhead. One needs to design a proper mount that fits their own 3D printer. It is better to align the axes of the accelerometer with the printer's axes (but if it makes it more convenient, axes can be swapped - i.e. no need to align X axis with X and so forth - it should be fine even if Z axis of accelerometer is X axis of the printer, etc.).
uk: Акселерометр повинен бути прикріплений до панелі інструментів. Для оформлення правильної кріплень, яка підходить для власних принтерів 3D. Краще вирівняти осі акселерометра з осями принтера (але якщо він робить його більш зручним, токси можуть бути опуклими - тобто не потрібно вирівняти вісь X з X і так далі - це повинно бути відмінно навіть якщо вісь акселерометра X осі принтера і т.д.).

source: An example of mounting ADXL345 on the SmartEffector:
uk: Приклад монтажу ADXL345 на SmartEffector:

source: ![ADXL345 on SmartEffector](img/adxl345-mount.jpg)
uk: ![ADXL345 на SmartEffector](img/adxl345-mount.jpg)

source: Note that on a bed slinger printer one must design 2 mounts: one for the toolhead and one for the bed, and run the measurements twice. See the corresponding [section](#bed-slinger-printers) for more details.
uk: Зауважте, що на станковому стропальному принтері необхідно розробити 2 кріплення: одне для інструментальної головки та інше для станини, а також виконати вимірювання двічі. Додаткову інформацію див. у відповідному [розділі](#bed-slinger-printers).

source: **Attention:** make sure the accelerometer and any screws that hold it in place do not touch any metal parts of the printer. Basically, the mount must be designed such as to ensure the electrical isolation of the accelerometer from the printer frame. Failing to ensure that can create a ground loop in the system that may damage the electronics.
uk: **Вміст:** переконайтеся, що акселерометр і будь-які гвинти, які тримати його в місці, не доторкнутися до будь-яких металевих деталей принтера. В основному, кріплення повинні бути розроблені таким чином, щоб забезпечити електричну ізоляцію акселерометра з коробки принтера. Включаючи для того, щоб створити заземну петлю в системі, яка може пошкодити електроніку.

source: Software installation
uk: Встановлення програмного забезпечення

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
uk: Переконайтеся, що драйвер Linux SPI працює `sudo raspi-config` і дозволяє SPI під меню «Інфракційні параметри».

source: It is advised to start with 1 probe point, in the middle of the print bed, slightly above it.
uk: Повідомляємо про початок з 1 точки зору, в середині принту, трохи вище.

source: Restart Klipper via the `RESTART` command.
uk: Рештарт Кліппер через команду `RESTART`.

source: Measuring the resonances
uk: Вимірювання резонансів

source: Checking the setup
uk: Перевірка налаштування

source: Now you can test a connection.
uk: Тепер можна перевірити підключення.

source: For "non bed-slingers" (e.g. one accelerometer), in Octoprint, enter `ACCELEROMETER_QUERY`
uk: Для «не постільних речей» (наприклад, один акселерометр), в Octoprint, введіть `ACCELEROMETER_QUERY`

source: For "bed-slingers" (e.g. more than one accelerometer), enter `ACCELEROMETER_QUERY CHIP=<chip>` where `<chip>` is the name of the chip as-entered, e.g. `CHIP=bed` (see: [bed-slinger](#bed-slinger-printers)) for all installed accelerometer chips.
uk: Для "дягачів" (наприклад, більше одного акселерометра), введіть `ACCELEROMETER_QUERY CHIP=<chip>`, де `<chip>` є ім'ям чіпа, як-вхідний, наприклад, `CHIP=bed` (див.: [bed-slinger](#bed-slinger-printers) для всіх встановлених акселерометрових чіпів.

source: You should see the current measurements from the accelerometer, including the free-fall acceleration, e.g.
uk: Ви повинні бачити поточні вимірювання від акселерометра, включаючи прискорення вільного падіння, наприклад.

source: Next, try running `MEASURE_AXES_NOISE` in Octoprint, you should get some baseline numbers for the noise of accelerometer on the axes (should be somewhere in the range of ~1-100). Too high axes noise (e.g. 1000 and more) can be indicative of the sensor issues, problems with its power, or too noisy imbalanced fans on a 3D printer.
uk: Далі намагатися бігти `MEASURE_AXES_NOISE` в Октопринті, ви повинні отримати деякі базові номери для шуму акселерометра на осі (зварити десь в діапазоні ~1-100). Занадто високий шум осі (наприклад, 1000 і більше) можна індексувати проблеми датчика, проблеми зі своєю потужністю, або занадто незбалансовані вентилятори на 3D принтері.

source: Now you can run some real-life tests. Run the following command:
uk: Тепер ви можете запустити деякі реальні тести. Запустіть команду:

source: Note that it will create vibrations on X axis. It will also disable input shaping if it was enabled previously, as it is not valid to run the resonance testing with the input shaper enabled.
uk: Зверніть увагу, що він створить вібрації на осі X. Він також буде відключити формулювання введення, якщо він був включений раніше, оскільки він не є дійсним для запуску резонансного тестування з ввімкненою формою введення.

source: **Attention!** Be sure to observe the printer for the first time, to make sure the vibrations do not become too violent (`M112` command can be used to abort the test in case of emergency; hopefully it will not come to this though). If the vibrations do get too strong, you can attempt to specify a lower than the default value for `accel_per_hz` parameter in `[resonance_tester]` section, e.g.
uk: **Пригода!** Обов'язково дотримуватися принтера вперше, щоб переконатися, що коливання не стали занадто жорстокими (`M112` команди можна використовувати для видалення тесту в разі надзвичайної ситуації, сподіваємось, що це не прийде до цього. Якщо вібрація є занадто сильною, ви можете намагатися вказати нижче значення за замовчуванням для параметра `accel_per_hz` у розділі `[resonance_tester]`, наприклад.

source: If it works for X axis, run for Y axis as well:
uk: Якщо він працює для осі X, запустіть для осі Y:

source: This script will generate the charts `/tmp/shaper_calibrate_x.png` and `/tmp/shaper_calibrate_y.png` with frequency responses. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup. For example:
uk: Цей скрипт буде генерувати діаграми `/tmp/shaper_calibrate_x.png` і `/tmp/shaper_calibrate_y.png` з частотними відгуками. Ви також отримаєте запропоновані частоти для кожного ідентифікатора вводу, а також які вводні форми рекомендується для налаштування. Наприклад:

source: ![Resonances](img/calibrate-y.png)
uk: ![Резонанси](img/calibrate-y.png)

source: The suggested configuration can be added to `[input_shaper]` section of `printer.cfg`, e.g.:
uk: У розділі `printer.cfg`, наприклад:

source: or you can choose some other configuration yourself based on the generated charts: peaks in the power spectral density on the charts correspond to the resonance frequencies of the printer.
uk: або ви можете вибрати іншу конфігурацію самостійно на основі створених графіків: піків в потужності спектральної щільності на діаграмах відповідають резонансним частотам принтера.

source: Bed-slinger printers
uk: Принтери постільної білизни

source: If your printer is a bed slinger printer, you will need to change the location of the accelerometer between the measurements for X and Y axes: measure the resonances of X axis with the accelerometer attached to the toolhead and the resonances of Y axis - to the bed (the usual bed slinger setup).
uk: Якщо ваш принтер являє собою плащовий принтер, потрібно буде змінити місце розташування акселерометра між вимірюваннями для X і Y осі: вимірювати резонанси осі X з акселерометром, прикріпленим до панелі інструментів і резонансами осі Y - до ліжка (звичайне налаштування постільної білизни).

source: Then the commands `TEST_RESONANCES AXIS=X` and `TEST_RESONANCES AXIS=Y` will use the correct accelerometer for each axis.
uk: Потім команди `TEST_RESONANCES AXIS=X` і `TEST_RESONANCES AXIS=Y` використовувати правильний акселерометр для кожної осі.

source: Max smoothing
uk: Макс плавлення

source: Keep in mind that the input shaper can create some smoothing in parts. Automatic tuning of the input shaper performed by `calibrate_shaper.py` script or `SHAPER_CALIBRATE` command tries not to exacerbate the smoothing, but at the same time they try to minimize the resulting vibrations. Sometimes they can make a sub-optimal choice of the shaper frequency, or maybe you simply prefer to have less smoothing in parts at the expense of a larger remaining vibrations. In these cases, you can request to limit the maximum smoothing from the input shaper.
uk: Враховуйте, що вводний формувач може створити деякий розгладжування деталей. Автоматичне тюнінг вхідної форми, що виконується `calibrate_shaper.py` скрипт або `SHAPER_CALIBRATE` команда намагається не згасити плавлення, але в той же час вони намагаються мінімізувати отримані вібрації. Іноді вони можуть зробити субоптимальний вибір частоти фігури, або, можливо, ви просто віддаєте перевагу менше розгладжування деталей за рахунок більшої решти коливань. У цих випадках ви можете запитувати, щоб обмежити максимальне згладжування від вхідної форми.

source: Let's consider the following results from the automatic tuning:
uk: Давайте розглянемо наступні результати з автоматичного тюнінгу:

source: ![Resonances](img/calibrate-x.png)
uk: ![Резонанси](img/calibrate-x.png)

source: Note that the reported `smoothing` values are some abstract projected values. These values can be used to compare different configurations: the higher the value, the more smoothing a shaper will create. However, these smoothing scores do not represent any real measure of smoothing, because the actual smoothing depends on [`max_accel`](#selecting-max-accel) and `square_corner_velocity` parameters. Therefore, you should print some test prints to see how much smoothing exactly a chosen configuration creates.
uk: Зверніть увагу, що повідомлені значення «згладжування» є деякими абстрактними прогнозованими значеннями. Ці значення можна використовувати для порівняння різних конфігурацій: чим вище значення, тим більше згладжування створить шейпер. Однак ці показники згладжування не представляють реальної міри згладжування, оскільки фактичне згладжування залежить від параметрів [`max_accel`](#selecting-max-accel) і `square_corner_velocity`. Тому вам слід надрукувати кілька пробних відбитків, щоб побачити, наскільки згладжування створює саме вибрана конфігурація.

source: In the example above the suggested shaper parameters are not bad, but what if you want to get less smoothing on the X axis? You can try to limit the maximum shaper smoothing using the following command:
uk: На прикладі вище запропоновані параметри формера не погані, але що якщо ви хочете отримати менше розгладжування на осі X? Ви можете намагатися обмежити максимальне вирівнювання фігури за допомогою наступної команди:

source: which limits the smoothing to 0.2 score. Now you can get the following result:
uk: яка обмежує розгладжування до 0,2 балу. Тепер ви можете отримати наступний результат:

source: ![Resonances](img/calibrate-x-max-smoothing.png)
uk: ![Резонанси](img/calibrate-x-max-smoothing.png)

source: If you compare to the previously suggested parameters, the vibrations are a bit larger, but the smoothing is significantly smaller than previously, allowing larger maximum acceleration.
uk: Якщо порівняти раніше запропоновані параметри, коли коливання трохи більше, але плавлення значно менше, ніж раніше, що дозволяє збільшити максимальне прискорення.

source: When deciding which `max_smoothing` parameter to choose, you can use a trial-and-error approach. Try a few different values and see which results you get. Note that the actual smoothing produced by the input shaper depends, primarily, on the lowest resonance frequency of the printer: the higher the frequency of the lowest resonance - the smaller the smoothing. Therefore, if you request the script to find a configuration of the input shaper with the unrealistically small smoothing, it will be at the expense of increased ringing at the lowest resonance frequencies (which are, typically, also more prominently visible in prints). So, always double-check the projected remaining vibrations reported by the script and make sure they are not too high.
uk: При вирішенні, які `max_smoothing` параметр вибрати, ви можете використовувати пробний і-error підхід. Спробуйте кілька різних значень, які ви отримуєте. Зверніть увагу, що фактичне згладжування, вироблене за допомогою вхідного формера залежить, в першу чергу, на найнижчій частоті резонансу принтера: чим вище частота найнижчого резонансу - тим менша плавка. Таким чином, якщо ви запитуєте сценарій, щоб знайти конфігурацію вхідної форми з нереально малим розгладжуванням, це буде за рахунок збільшення кільця за найнижчими частотами резонансу (які, як правило, також більш помітні в друку). Таким чином, завжди подвійна точка проекту, що залишилися коливання, які повідомляються скриптом і переконайтеся, що вони не занадто високі.

source: Note that if you chose a good `max_smoothing` value for both of your axes, you can store it in the `printer.cfg` as
uk: Зверніть увагу, що якщо ви вибрали добре `max_smoothing` значення для обох ваших осей, ви можете зберігати його в `printer.cfg` як

source: Then, if you [rerun](#input-shaper-re-calibration) the input shaper auto-tuning using `SHAPER_CALIBRATE` Klipper command in the future, it will use the stored `max_smoothing` value as a reference.
uk: Потім, якщо ви [rerun](#input-shaper-re-calibration) за допомогою вхідної форми за допомогою `SHAPER_CALIBRATE` Команда Klipper в майбутньому, вона буде використовувати збережені `max_smoothing` значення як посилання.

source: Selecting max_accel
uk: Вибір макс_accel

source: Since the input shaper can create some smoothing in parts, especially at high accelerations, you will still need to choose the `max_accel` value that does not create too much smoothing in the printed parts. A calibration script provides an estimate for `max_accel` parameter that should not create too much smoothing. Note that the `max_accel` as displayed by the calibration script is only a theoretical maximum at which the respective shaper is still able to work without producing too much smoothing. It is by no means a recommendation to set this acceleration for printing. The maximum acceleration your printer is able to sustain depends on its mechanical properties and the maximum torque of the used stepper motors. Therefore, it is suggested to set `max_accel` in `[printer]` section that does not exceed the estimated values for X and Y axes, likely with some conservative safety margin.
uk: Оскільки вводний форматор може створити деяке розгладжування деталей, особливо при високих прискореннях, вам все ще потрібно вибрати `max_accel` значення, яке не створює занадто багато розгладжування в друкованих частинах. Скрипт калібрування забезпечує оцінку параметра `max_accel`, який не повинен створювати занадто багато згладжування. Зауважте, що `max_accel`, як показано сценарій калібрування, є лише теоретичним, максимальним, при якому відповідний формар все ще здатний працювати без отримання занадто багато згладжування. Не можна рекомендувати для встановлення цього прискорення для друку. Максимальне прискорення вашого принтера дозволяє залишатися в залежності від механічних властивостей і максимального крутного моменту використовуваних крокових двигунів. Отже, пропонується встановити `max_accel` в розділі `[printer]`, яка не перевищує оцінені значення для X і Y осі, ймовірно, з деякими консервативними запасами безпеки.

source: Alternatively, follow [this](Resonance_Compensation.md#selecting-max_accel) part of the input shaper tuning guide and print the test model to choose `max_accel` parameter experimentally.
uk: Крім того, слідувати [this](Resonance_Compensation.md#selecting-max_accel) частини інструкції з налаштування вводу та друку тестової моделі для вибору `max_accel` експериментально.

source: The same notice applies to the input shaper [auto-calibration](#input-shaper-auto-calibration) with `SHAPER_CALIBRATE` command: it is still necessary to choose the right `max_accel` value after the auto-calibration, and the suggested acceleration limits will not be applied automatically.
uk: Те ж повідомлення відноситься до вхідного формера [auto-calibration](#input-shaper-auto-calibration) з `SHAPER_CALIBRATE` команда: вона все ще потрібно вибрати правильний `max_accel` значення після автоматичного калібрування, і запропоновані обмеження прискорення не будуть застосовуватися автоматично.

source: If you are doing a shaper re-calibration and the reported smoothing for the suggested shaper configuration is almost the same as what you got during the previous calibration, this step can be skipped.
uk: Якщо ви виконуєте рекалібрацію формувача і повідомляється розгладжування за запропонованою конфігурацією формера практично таким же, що ви отримали під час попереднього калібрування, цей крок можна пропустити.

source: Input Shaper auto-calibration
uk: Вхідний шейпер автоматичного калібрування

source: Besides manually choosing the appropriate parameters for the input shaper feature, it is also possible to run the auto-tuning for the input shaper directly from Klipper. Run the following command via Octoprint terminal:
uk: Крім ручного вибору відповідних параметрів для функції вводу, можна також запустити автовизначення для вхідної форми безпосередньо від Klipper. Запустіть команду за допомогою терміналу Octoprint:

source: This will run the full test for both axes and generate the csv output (`/tmp/calibration_data_*.csv` by default) for the frequency response and the suggested input shapers. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup, on Octoprint console. For example:
uk: Це буде запустити повну тест для обох осей і генерувати вихід csv (`/tmp/calibration_data_*.csv` за замовчуванням) для відповіді частоти і запропонованих форм введення. Ви також отримаєте запропоновані частоти для кожного ідентифікатора вводу, а також який вводний формувач рекомендується для налаштування, на Octoprint консолі. Наприклад:

source: If you agree with the suggested parameters, you can execute `SAVE_CONFIG` now to save them and restart the Klipper. Note that this will not update `max_accel` value in `[printer]` section. You should update it manually following the considerations in [Selecting max_accel](#selecting-max_accel) section.
uk: Якщо ви погоджуєтесь з запропонованими параметрами, ви можете виконувати `SAVE_CONFIG`, щоб зберегти їх і перезапустити Klipper. Зверніть увагу, що це не буде оновлено `max_accel` значення в розділі `[printer]`. Ви повинні оновити її вручну за розглядами в розділі [Виберіть максимальну кількість_accel](#selecting-max_accel).

source: If your printer is a bed slinger printer, you can specify which axis to test, so that you can change the accelerometer mounting point between the tests (by default the test is performed for both axes):
uk: Якщо ваш принтер являє собою плащовий принтер, ви можете вказати яку віссю для тестування, так що ви можете змінити точку кріплення акселерометра між тестами (за замовчуванням тест виконується як для обох осей):

source: You can execute `SAVE_CONFIG` twice - after calibrating each axis.
uk: Ви можете виконувати `SAVE_CONFIG` двічі - після калібрування кожної осі.

source: However, if you connected two accelerometers simultaneously, you simply run `SHAPER_CALIBRATE` without specifying an axis to calibrate the input shaper for both axes in one go.
uk: Тим не менш, якщо ви підключені два акселерометри одночасно, ви просто запустіть `SHAPER_CALIBRATE`, не вказавши вісь, щоб калібрувати вводну форму для обох осі в одному ходу.

source: Input Shaper re-calibration
uk: Вхідний шейпер re-calibration

source: `SHAPER_CALIBRATE` command can be also used to re-calibrate the input shaper in the future, especially if some changes to the printer that can affect its kinematics are made. One can either re-run the full calibration using `SHAPER_CALIBRATE` command, or restrict the auto-calibration to a single axis by supplying `AXIS=` parameter, like
uk: `SHAPER_CALIBRATE` команда також може використовуватися для повторного калібрування вхідного форматора в майбутньому, особливо якщо деякі зміни принтера, які можуть вплинути на його кінематику. Один може або перебіг повного калібрування за допомогою `SHAPER_CALIBRATE`, або обмежити автоматичне калібрування на одну вісь, подаючи `AXIS=` параметр, як і

source: Also, due to some noise in measurements, it is possible that the tuning results will be slightly different from one calibration run to another one. Still, it is not expected that the noise will affect the print quality too much. However, it is still advised to double-check the suggested parameters, and print some test prints before using them to confirm they are good.
uk: Крім того, через деякий шум при вимірюванні, можливо, що результати тюнінга будуть трохи відрізнятися від одного калібрування за один до одного. Тим не менш, не очікується, що шум впливає на якість друку занадто багато. Тим не менш, він ще радий подвійним вирізом запропонованих параметрів і друкувати деякі тестові відбитки, перш ніж використовувати їх, щоб підтвердити, що вони добре.

source: Offline processing of the accelerometer data
uk: Офлайн обробки даних акселерометра

source: It is possible to generate the raw accelerometer data and process it offline (e.g. on a host machine), for example to find resonances. In order to do so, run the following commands via Octoprint terminal:
uk: Генерувати дані акселерометра і обробляти її автономно (наприклад, на хост-машину), наприклад, для пошуку резонансів. Для того, щоб зробити це, запустіть наступні команди через термінал Octoprint:

source: ignoring any errors for `SET_INPUT_SHAPER` command. For `TEST_RESONANCES` command, specify the desired test axis. The raw data will be written into `/tmp` directory on the RPi.
uk: ігнорування будь-яких помилок `SET_INPUT_SHAPER` команди. Для `TEST_RESONANCES` команда, вкажіть бажану вісь тесту. Сирі дані будуть записані в каталог `/tmp` на RPi.
