Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Status_Reference.po
Languages: bg

source: This document is a reference of printer status information available in Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display), and via the [API Server](API_Server.md).
bg: Този документ представлява справка за информацията за състоянието на принтера, налична в Klipper [макроси](Command_Templates.md), [полета за показване](Config_Reference.md#display) и чрез [API Server](API_Server.md).

source: The fields in this document are subject to change - if using an attribute be sure to review the [Config Changes document](Config_Changes.md) when upgrading the Klipper software.
bg: Полетата в този документ могат да се променят - ако използвате даден атрибут, не забравяйте да прегледате документа [Config Changes](Config_Changes.md) при обновяване на софтуера Klipper.

source: The following information is available in the [bed_mesh](Config_Reference.md#bed_mesh) object:
bg: Следната информация е налична в обекта [bed_mesh](Config_Reference.md#bed_mesh):

source: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Information on the currently active bed_mesh.
bg: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Информация за активния в момента bed_mesh.

source: configfile
bg: конфигурационен файл

source: The following information is available in the `configfile` object (this object is always available):
bg: Следната информация е налична в обекта `configfile` (този обект е винаги наличен):

source: `settings.<section>.<option>`: Returns the given config file setting (or default value) during the last software start or restart. (Any settings changed at run-time will not be reflected here.)
bg: `settings.<section>.<option>`: Връща зададената настройка на конфигурационния файл (или стойността по подразбиране) по време на последното стартиране или рестартиране на софтуера. (Всички настройки, променени по време на работа, няма да бъдат отразени тук.)

source: `config.<section>.<option>`: Returns the given raw config file setting as read by Klipper during the last software start or restart. (Any settings changed at run-time will not be reflected here.) All values are returned as strings.
bg: `config.<section>.<option>`: Връща зададената сурова настройка на конфигурационния файл, прочетена от Klipper по време на последното стартиране или рестартиране на софтуера. (Всички настройки, променени по време на работа, няма да бъдат отразени тук.) Всички стойности се връщат като низове.

source: The following information is available in the `display_status` object (this object is automatically available if a [display](Config_Reference.md#display) config section is defined):
bg: Следната информация е налична в обекта `display_status` (този обект е автоматично наличен, ако е дефинирана секция [display](Config_Reference.md#display) на конфигурацията):

source: `progress`: The progress value of the last `M73` G-Code command (or `virtual_sdcard.progress` if no recent `M73` received).
bg: `progress`: Стойността на прогреса на последната `M73` G-Code команда (или `virtual_sdcard.progress`, ако не е получена скорошна `M73`).

source: `message`: The message contained in the last `M117` G-Code command.
bg: `message`: Съобщението, съдържащо се в последната G-кодова команда `M117`.

source: The following information is available in the [endstop_phase](Config_Reference.md#endstop_phase) object:
bg: Следната информация е налична в обекта [endstop_phase](Config_Reference.md#endstop_phase):

source: `last_home.<stepper name>.phase`: The phase of the stepper motor at the end of the last home attempt.
bg: `last_home.<име на степер>.phase`: Фазата на стъпковия двигател в края на последния домашен опит.

source: `last_home.<stepper name>.phases`: The total number of phases available on the stepper motor.
bg: `last_home.<име на степер>.phases`: Общият брой на наличните фази на стъпковия двигател.

source: `last_home.<stepper name>.mcu_position`: The position (as tracked by the micro-controller) of the stepper motor at the end of the last home attempt. The position is the total number of steps taken in a forward direction minus the total number of steps taken in the reverse direction since the micro-controller was last restarted.
bg: `last_home.<име на степер>.mcu_position`: Позицията (проследена от микроконтролера) на стъпковия двигател в края на последния опит за връщане в изходно положение. Позицията е общият брой стъпки, направени в права посока, минус общия брой стъпки, направени в обратна посока, след последното рестартиране на микроконтролера.

source: fan
bg: вентилатор

source: The following information is available in [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) and [controller_fan some_name](Config_Reference.md#controller_fan) objects:
bg: Следната информация е налична в обектите [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) и [controller_fan some_name](Config_Reference.md#controller_fan):

source: `speed`: The fan speed as a float between 0.0 and 1.0.
bg: `speed`: Скоростта на вентилатора като плаващо число между 0,0 и 1,0.

source: `rpm`: The measured fan speed in rotations per minute if the fan has a tachometer_pin defined.
bg: `rpm`: Измерената скорост на вентилатора в обороти в минута, ако вентилаторът има дефиниран tachometer_pin.

source: The following information is available in [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) objects:
bg: Следната информация е налична в обектите [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor):

source: `enabled`: Returns True if the switch sensor is currently enabled.
bg: `enabled`: Връща True, ако сензорът за превключване в момента е активиран.

source: `filament_detected`: Returns True if the sensor is in a triggered state.
bg: `filament_detected`: Връща True, ако сензорът е в състояние на задействане.

source: The following information is available in [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) objects:
bg: Следната информация е налична в обектите [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor):

source: `enabled`: Returns True if the motion sensor is currently enabled.
bg: `enabled`: Връща True, ако сензорът за движение в момента е активиран.

source: The following information is available in the [firmware_retraction](Config_Reference.md#firmware_retraction) object:
bg: Следната информация е налична в обекта [firmware_retraction](Config_Reference.md#firmware_retraction):

source: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: The current settings for the firmware_retraction module. These settings may differ from the config file if a `SET_RETRACTION` command alters them.
bg: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: Текущите настройки за модула firmware_retraction. Тези настройки могат да се различават от тези в конфигурационния файл, ако командата `SET_RETRACTION` ги промени.

source: The following information is available in [gcode_macro some_name](Config_Reference.md#gcode_macro) objects:
bg: Следната информация е налична в обектите [gcode_macro some_name](Config_Reference.md#gcode_macro):

source: `<variable>`: The current value of a [gcode_macro variable](Command_Templates.md#variables).
bg: `<променлива>`: Текущата стойност на променлива [gcode_macro](Command_Templates.md#variables).

source: The following information is available in the `gcode_move` object (this object is always available):
bg: Следната информация е налична в обекта `gcode_move` (този обект е винаги наличен):

source: `gcode_position`: The current position of the toolhead relative to the current G-Code origin. That is, positions that one might directly send to a `G1` command. It is possible to access the x, y, z, and e components of this position (eg, `gcode_position.x`).
bg: `gcode_position`: Текущата позиция на главата на инструмента спрямо текущото начало на G-кода. Тоест позициите, които могат да се изпратят директно към команда `G1`. Възможно е да се получи достъп до компонентите x, y, z и e на тази позиция (например, `gcode_position.x`).

source: `position`: The last commanded position of the toolhead using the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
bg: `позиция`: Последната заповядана позиция на главата на инструмента, използваща координатната система, зададена в конфигурационния файл. Възможно е да се получи достъп до компонентите x, y, z и e на тази позиция (напр., `position.x`).

source: `homing_origin`: The origin of the gcode coordinate system (relative to the coordinate system specified in the config file) to use after a `G28` command. The `SET_GCODE_OFFSET` command can alter this position. It is possible to access the x, y, and z components of this position (eg, `homing_origin.x`).
bg: `homing_origin`: Произходът на координатната система gcode (спрямо координатната система, посочена в конфигурационния файл), която да се използва след команда `G28`. Командата `SET_GCODE_OFFSET` може да промени тази позиция. Възможен е достъп до компонентите x, y и z на тази позиция (например, `homing_origin.x`).

source: `speed`: The last speed set in a `G1` command (in mm/s).
bg: `speed`: Последната скорост, зададена с команда `G1` (в mm/s).

source: `speed_factor`: The "speed factor override" as set by an `M220` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested speed.
bg: `speed_factor`: "Коефициент на скоростта", зададен с команда `M220`. Това е стойност с плаваща запетая, като 1,0 означава, че няма превишаване, а например 2,0 ще удвои заявената скорост.

source: `extrude_factor`: The "extrude factor override" as set by an `M221` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested extrusions.
bg: `extrude_factor`: "Коефициент на екструдиране", зададен с команда `M221`. Това е стойност с плаваща запетая, така че 1,0 означава, че няма промяна, а например 2,0 ще удвои исканите екструзии.

source: `absolute_coordinates`: This returns True if in `G90` absolute coordinate mode or False if in `G91` relative mode.
bg: `absolute_coordinates`: Връща True, ако е в режим на абсолютни координати `G90`, или False, ако е в режим на относителни координати `G91`.

source: `absolute_extrude`: This returns True if in `M82` absolute extrude mode or False if in `M83` relative mode.
bg: `absolute_extrude`: Връща True, ако е в режим `M82` на абсолютно екструдиране, или False, ако е в режим `M83` на относително екструдиране.

source: The following information is available in the [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) object:
bg: Следната информация е налична в обекта [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor):

source: `is_active`: Returns True if the sensor is currently active.
bg: `is_active`: Връща True, ако сензорът в момента е активен.

source: heater
bg: нагревател

source: The following information is available for heater objects such as [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed), and [heater_generic](Config_Reference.md#heater_generic):
bg: Следната информация е налична за обекти за нагреватели като [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed) и [heater_generic](Config_Reference.md#heater_generic):

source: `temperature`: The last reported temperature (in Celsius as a float) for the given heater.
bg: `температура`: Последната отчетена температура (в градуси по Целзий като float) за дадения нагревател.

source: `target`: The current target temperature (in Celsius as a float) for the given heater.
bg: `Target`: Текущата целева температура (в градуси по Целзий като float) за дадения нагревател.

source: `power`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the heater.
bg: `power`: Последната настройка на щифта PWM (стойност между 0,0 и 1,0), свързана с нагревателя.

source: `can_extrude`: If extruder can extrude (defined by `min_extrude_temp`), available only for [extruder](Config_Reference.md#extruder)
bg: `can_extrude`: Ако екструдерът може да екструдира (определено от `min_extrude_temp`), достъпно само за [extruder](Config_Reference.md#extruder)

source: heaters
bg: нагреватели

source: The following information is available in the `heaters` object (this object is available if any heater is defined):
bg: Следната информация е налична в обекта `heaters` (този обект е наличен, ако е дефиниран някой нагревател):

source: `available_heaters`: Returns a list of all currently available heaters by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
bg: `available_heaters`: Връща списък на всички налични в момента нагреватели по техните пълни имена на секциите на конфигурацията, например `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.

source: `available_sensors`: Returns a list of all currently available temperature sensors by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
bg: `available_sensors`: Връща списък на всички налични в момента температурни сензори чрез пълните им имена на секциите на конфигурацията, например `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.

source: The following information is available in the [idle_timeout](Config_Reference.md#idle_timeout) object (this object is always available):
bg: Следната информация е налична в обекта [idle_timeout](Config_Reference.md#idle_timeout) (този обект е винаги наличен):

source: `state`: The current state of the printer as tracked by the idle_timeout module. It is one of the following strings: "Idle", "Printing", "Ready".
bg: `state`: Текущото състояние на принтера, проследявано от модула idle_timeout. Това е един от следните низове: "Idle", "Printing", "Ready".

source: `printing_time`: The amount of time (in seconds) the printer has been in the "Printing" state (as tracked by the idle_timeout module).
bg: `printing_time`: Времето (в секунди), през което принтерът е бил в състояние "Печат" (както се следи от модула idle_timeout).

source: The following information is available in [mcu](Config_Reference.md#mcu) and [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) objects:
bg: Следната информация е налична в обектите [mcu](Config_Reference.md#mcu) и [mcu some_name](Config_Reference.md#mcu-my_extra_mcu):

source: `mcu_version`: The Klipper code version reported by the micro-controller.
bg: `mcu_version`: Версията на кода на Klipper, съобщена от микроконтролера.

source: `mcu_build_versions`: Information on the build tools used to generate the micro-controller code (as reported by the micro-controller).
bg: `mcu_build_versions`: Информация за инструментите за изграждане, използвани за генериране на кода на микроконтролера (както се съобщава от микроконтролера).

source: `mcu_constants.<constant_name>`: Compile time constants reported by the micro-controller. The available constants may differ between micro-controller architectures and with each code revision.
bg: `mcu_constants.<constant_name>`: Константи по време на компилация, докладвани от микроконтролера. Наличните константи могат да се различават при различните архитектури на микроконтролера и при всяка ревизия на кода.

source: `last_stats.<statistics_name>`: Statistics information on the micro-controller connection.
bg: ```last_stats.<statistics_name>`: Статистическа информация за връзката с микроконтролера.

source: The following information is available in [output_pin some_name](Config_Reference.md#output_pin) objects:
bg: Следната информация е налична в обектите [output_pin some_name](Config_Reference.md#output_pin):

source: `value`: The "value" of the pin, as set by a `SET_PIN` command.
bg: `value`: "Стойността" на пина, зададена с команда `SET_PIN`.

source: palette2
bg: палитри2

source: The following information is available in the [palette2](Config_Reference.md#palette2) object:
bg: Следната информация е налична в обекта [palette2](Config_Reference.md#palette2):

source: `ping`: Amount of the last reported Palette 2 ping in percent.
bg: `ping`: Размер на последния отчетен пинг на Palette 2 в проценти.

source: `remaining_load_length`: When starting a Palette 2 print, this will be the amount of filament to load into the extruder.
bg: `remaining_load_length`: При стартиране на печат с Palette 2 това ще бъде количеството нишка, което ще се зареди в екструдера.

source: `is_splicing`: True when the Palette 2 is splicing filament.
bg: `is_splicing`: Вярно, когато палитрата 2 е сплитаща нишка.

source: The following information is available in the [pause_resume](Config_Reference.md#pause_resume) object:
bg: Следната информация е налична в обекта [pause_resume](Config_Reference.md#pause_resume):

source: `is_paused`: Returns true if a PAUSE command has been executed without a corresponding RESUME.
bg: `is_paused`: Връща true, ако е била изпълнена команда PAUSE без съответна команда RESUME.

source: The following information is available in the `print_stats` object (this object is automatically available if a [virtual_sdcard](Config_Reference.md#virtual_sdcard) config section is defined):
bg: Следната информация е налична в обекта `print_stats` (този обект е автоматично наличен, ако е дефинирана конфигурационна секция [virtual_sdcard](Config_Reference.md#virtual_sdcard)):

source: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Estimated information about the current print when a virtual_sdcard print is active.
bg: `име на филма`, `обща продължителност`, `продължителност на печат`, `използвани влакна`, `състояние`, `съобщение`: Очаквана информация за текущия печат, когато е активен печат на virtual_sdcard.

source: probe
bg: сонда

source: The following information is available in the [probe](Config_Reference.md#probe) object (this object is also available if a [bltouch](Config_Reference.md#bltouch) config section is defined):
bg: Следната информация е налична в обекта [probe](Config_Reference.md#probe) (този обект също е наличен, ако е дефинирана секция [bltouch](Config_Reference.md#bltouch) config):

source: `last_query`: Returns True if the probe was reported as "triggered" during the last QUERY_PROBE command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_PROBE command must be run prior to the macro containing this reference.
bg: `last_query`: Връща True, ако сондата е била отчетена като "задействана" по време на последната команда QUERY_PROBE. Обърнете внимание, че ако това се използва в макрос, поради реда на разширяване на шаблона, командата QUERY_PROBE трябва да се изпълни преди макроса, съдържащ тази препратка.

source: `last_z_result`: Returns the Z result value of the last PROBE command. Note, if this is used in a macro, due to the order of template expansion, the PROBE (or similar) command must be run prior to the macro containing this reference.
bg: `last_z_result`: Връща стойността на Z резултата от последната команда PROBE. Обърнете внимание, че ако това се използва в макрос, поради реда на разширяване на шаблона, командата PROBE (или подобна) трябва да се изпълни преди макроса, съдържащ тази препратка.

source: The following information is available in the `quad_gantry_level` object (this object is available if quad_gantry_level is defined):
bg: Следната информация е налична в обекта `quad_gantry_level` (този обект е наличен, ако е дефиниран quad_gantry_level):

source: `applied`: True if the gantry leveling process has been run and completed successfully.
bg: `applied`: Вярно, ако процесът на нивелиране на портала е стартиран и е завършил успешно.

source: The following information is available in the `query_endstops` object (this object is available if any endstop is defined):
bg: Следната информация е налична в обекта `query_endstops` (този обект е наличен, ако е дефиниран някой endstop):

source: `last_query["<endstop>"]`: Returns True if the given endstop was reported as "triggered" during the last QUERY_ENDSTOP command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_ENDSTOP command must be run prior to the macro containing this reference.
bg: `last_query["<endstop>"]`: Връща True, ако даденият endstop е отчетен като "задействан" по време на последната команда QUERY_ENDSTOP. Обърнете внимание, че ако това се използва в макрос, поради реда на разширяване на шаблона, командата QUERY_ENDSTOP трябва да се изпълни преди макроса, съдържащ тази препратка.

source: servo
bg: Серво

source: The following information is available in [servo some_name](Config_Reference.md#servo) objects:
bg: Следната информация е налична в обектите [servo some_name](Config_Reference.md#servo):

source: `printer["servo <config_name>"].value`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the servo.
bg: `printer["servo <config_name>"].value`: Последната настройка на щифта PWM (стойност между 0,0 и 1,0), свързана със сервоусилвателя.

source: The following information is available in the `system_stats` object (this object is always available):
bg: Следната информация е налична в обекта `system_stats` (този обект е винаги наличен):

source: `sysload`, `cputime`, `memavail`: Information on the host operating system and process load.
bg: `sysload`, `cputime`, `memavail`: Информация за операционната система на хоста и натоварването на процесите.

source: temperature sensors
bg: температурни сензори

source: The following information is available in
bg: Следната информация е налична в

source: `temperature`: The last read temperature from the sensor.
bg: `температура`: Последната отчетена температура от сензора.

source: The following information is available in [temperature_fan some_name](Config_Reference.md#temperature_fan) objects:
bg: Следната информация е налична в обектите [temperature_fan some_name](Config_Reference.md#temperature_fan):

source: `target`: The target temperature for the fan.
bg: `Target`: Целевата температура за вентилатора.

source: The following information is available in [temperature_sensor some_name](Config_Reference.md#temperature_sensor) objects:
bg: Следната информация е налична в обектите [temperature_sensor some_name](Config_Reference.md#temperature_sensor):

source: `measured_min_temp`, `measured_max_temp`: The lowest and highest temperature seen by the sensor since the Klipper host software was last restarted.
bg: `measured_min_temp`, `measured_max_temp`: Най-ниската и най-високата температура, отчетена от сензора след последното рестартиране на софтуера на Klipper.

source: toolhead
bg: глава на инструмент

source: The following information is available in the `toolhead` object (this object is always available):
bg: Следната информация е налична в обекта `toolhead` (този обект е винаги наличен):

source: `position`: The last commanded position of the toolhead relative to the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
bg: `позиция`: Последната командна позиция на главата на инструмента спрямо координатната система, посочена в конфигурационния файл. Възможно е да се получи достъп до компонентите x, y, z и e на тази позиция (например, `position.x`).
