Repository: flyer05/klipper-translations
Catalog: locales/*/LC_MESSAGES/Status_Reference.po
Languages: bg

source: `extruder`: The name of the currently active extruder. For example, in a macro one could use `printer[printer.toolhead.extruder].target` to get the target temperature of the current extruder.
bg: `екструдер`: Името на активния в момента екструдер. Например в макрос може да се използва `printer[printer.toolhead.extruder].target`, за да се получи целевата температура на текущия екструдер.

source: `homed_axes`: The current cartesian axes considered to be in a "homed" state. This is a string containing one or more of "x", "y", "z".
bg: `homed_axes`: Текущите картезиански оси, за които се счита, че са в състояние "homed". Това е низ, съдържащ един или повече от символите "x", "y", "z".

source: `axis_minimum`, `axis_maximum`: The axis travel limits (mm) after homing. It is possible to access the x, y, z components of this limit value (eg, `axis_minimum.x`, `axis_maximum.z`).
bg: `axis_minimum`, `axis_maximum`: Границите на преместване на оста (mm) след самонасочване. Възможен е достъп до компонентите x, y, z на тази гранична стойност (например, `axis_minimum.x`, `axis_maximum.z`).

source: `stalls`: The total number of times (since the last restart) that the printer had to be paused because the toolhead moved faster than moves could be read from the G-Code input.
bg: `stalls`: Общият брой пъти (от последното рестартиране), когато се е наложило принтерът да бъде спрян, тъй като главата на инструмента се е движила по-бързо от движенията, които могат да бъдат прочетени от входа на G-Code.

source: The following information is available in the [virtual_sdcard](Config_Reference.md#virtual_sdcard) object:
bg: Следната информация е налична в обекта [virtual_sdcard](Config_Reference.md#virtual_sdcard):

source: `is_active`: Returns True if a print from file is currently active.
bg: `is_active`: Връща True, ако отпечатването от файл в момента е активно.

source: `progress`: An estimate of the current print progress (based of file size and file position).
bg: `progress`: Оценка на текущия напредък на печата (въз основа на размера на файла и позицията на файла).

source: `file_position`: The current position (in bytes) of an active print.
bg: `file_position`: Текущата позиция (в байтове) на активния печат.

source: The following information is available in the `webhooks` object (this object is always available):
bg: Следната информация е налична в обекта `webhooks` (този обект е винаги наличен):

source: `state`: Returns a string indicating the current Klipper state. Possible values are: "ready", "startup", "shutdown", "error".
bg: `state`: Връща низ, указващ текущото състояние на Klipper. Възможните стойности са: "готов", "стартиране", "изключване", "грешка".

source: `state_message`: A human readable string giving additional context on the current Klipper state.
bg: `state_message`: Човешки прочетен низ, който дава допълнителен контекст за текущото състояние на Klipper.

source: The following information is available in the `z_tilt` object (this object is available if z_tilt is defined):
bg: Следната информация е налична в обекта `z_tilt` (този обект е наличен, ако е дефиниран z_tilt):

source: `applied`: True if the z-tilt leveling process has been run and completed successfully.
bg: `applied`: Вярно, ако процесът на изравняване на z-наклона е стартиран и е завършил успешно.

source: `file_path`: A full path to the file of currently loaded file.
bg: `file_path`: Пълен път до файла на текущо заредения файл.

source: `file_size`: The file size (in bytes) of currently loaded file.
bg: `file_size`: Размерът на файла (в байтове) на текущо заредения файл.

source: The following information is available in the `motion_report` object (this object is automatically available if any stepper config section is defined):
bg: Следната информация е налична в обекта `motion_report` (този обект е наличен автоматично, ако е дефиниран някой раздел от конфигурацията на стъпковия механизъм):

source: `live_position`: The requested toolhead position interpolated to the current time.
bg: `live_position`: Заявената позиция на главата на инструмента, интерполирана към текущото време.

source: `live_velocity`: The requested toolhead velocity (in mm/s) at the current time.
bg: `live_velocity`: Заявената скорост на главата на инструмента (в mm/s) в текущия момент.

source: `live_extruder_velocity`: The requested extruder velocity (in mm/s) at the current time.
bg: `live_extruder_velocity`: Заявената скорост на екструдера (в mm/s) в текущия момент.

source: `save_config_pending`: Returns true if there are updates that a `SAVE_CONFIG` command may persist to disk.
bg: `save_config_pending`: Връща true, ако има актуализации, които командата `SAVE_CONFIG` може да запази на диска.

source: `warnings`: A list of warnings about config options. Each entry in the list will be a dictionary containing a `type` and `message` field (both strings). Additional fields may be available depending on the type of warning.
bg: `предупреждения`: Списък с предупреждения за опциите на конфигурацията. Всеки запис в списъка е речник, съдържащ полета `type` и `message` (и двете са низове). Възможно е да има допълнителни полета в зависимост от типа на предупреждението.

source: The following information is available in [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) objects (eg, `[tmc2208 stepper_x]`):
bg: Следната информация е налична в обектите [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) (например, `[tmc2208 stepper_x]`):

source: `mcu_phase_offset`: The micro-controller stepper position corresponding with the driver's "zero" phase. This field may be null if the phase offset is not known.
bg: `mcu_phase_offset`: Позицията на стъпковия механизъм на микроконтролера, съответстваща на "нулевата" фаза на драйвера. Това поле може да бъде нулево, ако фазовото отместване не е известно.

source: `phase_offset_position`: The "commanded position" corresponding to the driver's "zero" phase. This field may be null if the phase offset is not known.
bg: `phase_offset_position`: Командната позиция", съответстваща на "нулевата" фаза на водача. Това поле може да бъде нулево, ако фазовото отместване не е известно.

source: `drv_status`: The results of the last driver status query. (Only non-zero fields are reported.) This field will be null if the driver is not enabled (and thus is not periodically queried).
bg: `drv_status`: Резултатите от последната заявка за състоянието на водача. (Отчитат се само полета, които не са нулеви.) Това поле ще бъде нулево, ако драйверът не е активиран (и следователно не се запитва периодично).

source: `run_current`: The currently set run current.
bg: `run_current`: Текущият ток на изпълнение.

source: `hold_current`: The currently set hold current.
bg: `hold_current`: Текущо зададеният ток на задържане.

source: `Diameter`: The last reading from the sensor in mm.
bg: `Диаметър`: Последното показание на сензора в мм.

source: `Raw`: The last raw ADC reading from the sensor.
bg: `Raw`: Последното необработено ADC показание от сензора.

source: `profiles`: The set of currently defined profiles as setup using BED_MESH_PROFILE.
bg: `profiles`: Наборът от текущо дефинирани профили, настроен с помощта на BED_MESH_PROFILE.

source: angle
bg: ъгъл

source: The following information is available in [angle some_name](Config_Reference.md#angle) objects:
bg: Следната информация е налична в обектите [angle some_name](Config_Reference.md#angle):

source: `temperature`: The last temperature reading (in Celsius) from a tle5012b magnetic hall sensor. This value is only available if the angle sensor is a tle5012b chip and if measurements are in progress (otherwise it reports `None`).
bg: `температура`: Последното отчитане на температурата (в градуси по Целзий) от магнитен сензор на Хола tle5012b. Тази стойност е налична само ако сензорът за ъгъл е чип tle5012b и ако измерванията са в ход (в противен случай се съобщава `None`).

source: The following information is available for each `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]`, and `[pca9632 led_name]` config section defined in printer.cfg:
bg: Следната информация е налична за всеки раздел от конфигурацията `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]` и `[pca9632 led_name]`, дефиниран в printer.cfg:

source: `color_data`: A list of color lists containing the RGBW values for a led in the chain. Each value is represented as a float from 0.0 to 1.0. Each color list contains 4 items (red, green, blue, white) even if the underyling LED supports fewer color channels. For example, the blue value (3rd item in color list) of the second neopixel in a chain could be accessed at `printer["neopixel <config_name>"].color_data[1][2]`.
bg: `color_data`: Списък с цветови списъци, съдържащи RGBW стойностите за даден светодиод във веригата. Всяка стойност е представена като float от 0,0 до 1,0. Всеки списък с цветове съдържа 4 елемента (червено, зелено, синьо, бяло), дори ако светодиодът с подсветка поддържа по-малко цветови канали. Например стойността на синьото (3-ти елемент в списъка с цветове) на втория неопиксел във веригата може да се получи на адрес `printer["neopixel <config_name>"].color_data[1][2]`.

source: `save_config_pending_items`: Contains the sections and options that were changed and would be persisted by a `SAVE_CONFIG`.
bg: `save_config_pending_items`: Съдържа секциите и опциите, които са били променени и ще бъдат запазени при `SAVE_CONFIG`.

source: The following information is available in the [exclude_object](Exclude_Object.md) object:
bg: Следната информация е налична в обекта [exclude_object](Exclude_Object.md):

source: `objects`: An array of the known objects as provided by the `EXCLUDE_OBJECT_DEFINE` command. This is the same information provided by the `EXCLUDE_OBJECT VERBOSE=1` command. The `center` and `polygon` fields will only be present if provided in the original `EXCLUDE_OBJECT_DEFINE`
bg: `objects`: Масив от известните обекти, предоставени от командата `EXCLUDE_OBJECT_DEFINE`. Това е същата информация, предоставена от командата `EXCLUDE_OBJECT VERBOSE=1`. Полетата `center` и `polygon` ще присъстват само ако са предоставени в оригиналната команда `EXCLUDE_OBJECT_DEFINE`.

source: Here is a JSON sample:
bg: Ето една JSON извадка:

source: `excluded_objects`: An array of strings listing the names of excluded objects.
bg: `excluded_objects`: Масив от низове, съдържащ имената на изключените обекти.

source: `current_object`: The name of the object currently being printed.
bg: `current_object`: Името на обекта, който се отпечатва в момента.

source: The following information is available in the `manual_probe` object:
bg: Следната информация е налична в обекта `manual_probe`:

source: `is_active`: Returns True if a manual probing helper script is currently active.
bg: `is_active`: Връща True, ако в момента е активен помощен скрипт за ръчно сондиране.

source: `z_position`: The current height of the nozzle (as the printer currently understands it).
bg: `z_position`: Текущата височина на дюзата (както принтерът я разбира в момента).

source: `z_position_lower`: Last probe attempt just lower than the current height.
bg: `z_position_lower`: Последният опит за сондиране е по-нисък от текущата височина.

source: `z_position_upper`: Last probe attempt just greater than the current height.
bg: `z_position_upper`: Последният опит за сондиране е по-голям от текущата височина.

source: The following information is available in the `Config_Reference.md#bed_screws` object:
bg: Следната информация е налична в обекта `Config_Reference.md#bed_screws`:

source: `is_active`: Returns True if the bed screws adjustment tool is currently active.
bg: `is_active`: Връща True, ако инструментът за регулиране на винтовете на леглото е активен в момента.

source: `state`: The bed screws adjustment tool state. It is one of the following strings: "adjust", "fine".
bg: `state`: Състояние на инструмента за регулиране на винтовете на леглото. Това е една от следните струни: "adjust", "fine".

source: `current_screw`: The index for the current screw being adjusted.
bg: `current_screw`: Индексът на текущия винт, който се регулира.

source: `accepted_screws`: The number of accepted screws.
bg: `accepted_screws`: Броят на приетите винтове.

source: The following information is available for extruder_stepper objects (as well as [extruder](Config_Reference.md#extruder) objects):
bg: Следната информация е налична за обектите extruder_stepper (както и за обектите [extruder](Config_Reference.md#extruder)):

source: `pressure_advance`: The current [pressure advance](Pressure_Advance.md) value.
bg: `pressure_advance`: Текущата стойност на [аванс на налягането](Pressure_Advance.md).

source: `smooth_time`: The current pressure advance smooth time.
bg: `smooth_time`: Текущото време за плавно увеличаване на налягането.

source: For Delta printers the `cone_start_z` is the max z height at maximum radius (`printer.toolhead.cone_start_z`).
bg: За принтерите Delta `cone_start_z` е максималната височина z при максимален радиус (`printer.toolhead.cone_start_z`).

source: `info.total_layer`: The total layer value of the last `SET_PRINT_STATS_INFO TOTAL_LAYER=<value>` G-Code command.
bg: `info.total_layer`: Стойността на общия слой от последната команда `SET_PRINT_STATS_INFO TOTAL_LAYER=<value>` на G-Code.

source: `info.current_layer`: The current layer value of the last `SET_PRINT_STATS_INFO CURRENT_LAYER=<value>` G-Code command.
bg: `info.current_layer`: Стойността на текущия слой от последната команда на G-Code `SET_PRINT_STATS_INFO CURRENT_LAYER=<value>`.

source: The following information is available in the `z_thermal_adjust` object (this object is available if [z_thermal_adjust](Config_Reference.md#z_thermal_adjust) is defined).
bg: Следната информация е налична в обекта `z_thermal_adjust` (този обект е наличен, ако е дефиниран [z_thermal_adjust](Config_Reference.md#z_thermal_adjust)).

source: `enabled`: Returns True if adjustment is enabled.
bg: `enabled`: Връща True, ако настройката е разрешена.

source: `temperature`: Current (smoothed) temperature of the defined sensor. [degC]
bg: `температура`: Текуща (изгладена) температура на определения сензор. [degC]

source: `measured_min_temp`: Minimum measured temperature. [degC]
bg: `measured_min_temp`: Минимална измерена температура. [degC]

source: `measured_max_temp`: Maximum measured temperature. [degC]
bg: `measured_max_temp`: Максимална измерена температура. [degC]

source: `current_z_adjust`: Last computed Z adjustment [mm].
bg: `current_z_adjust`: Последната изчислена Z корекция [mm].

source: `z_adjust_ref_temperature`: Current reference temperature used for calculation of Z `current_z_adjust` [degC].
bg: `z_adjust_ref_temperature`: Текуща референтна температура, използвана за изчисляване на Z `current_z_adjust` [degC].

source: The following information is available in the `screws_tilt_adjust` object:
bg: Следната информация е налична в обекта `screws_tilt_adjust`:

source: `error`: Returns True if the most recent `SCREWS_TILT_CALCULATE` command included the `MAX_DEVIATION` parameter and any of the probed screw points exceeded the specified `MAX_DEVIATION`.
bg: `error`: Връща True, ако последната команда `SCREWS_TILT_CALCULATE` е включвала параметъра `MAX_DEVIATION` и някоя от изследваните точки на винта е надвишила зададения параметър `MAX_DEVIATION`.

source: `z`: The measured Z height of the screw location.
bg: `z`: Измерената височина Z на местоположението на винта.

source: `adjust`: The number of screw turns to adjust the screw, given in the format "HH:MM," where "HH" is the number of full screw turns and "MM" is the number of "minutes of a clock face" representing a partial screw turn. (E.g. "01:15" would mean to turn the screw one and a quarter revolutions.)
bg: `adjust`: Броят на завъртанията на винта за регулиране, зададен във формат "HH:MM", където "HH" е броят на пълните завъртания на винта, а "MM" е броят на "минутите на часовниковия циферблат", представляващи частично завъртане на винта. (Например "01:15" означава да завъртите винта с един и четвърт оборот.)

source: `motion_queue`: The name of the extruder that this extruder stepper is currently synchronized to. This is reported as `None` if the extruder stepper is not currently associated with an extruder.
bg: `motion_queue`: Името на екструдера, с който в момента е синхронизиран този стъпков екструдер. Това се съобщава като `None`, ако стъпката на екструдера в момента не е свързана с екструдер.

source: `name`: Returns the name of the probe in use.
bg: `name`: Връща името на използваната сонда.

source: `results["<screw>"]`: A dictionary containing the following keys:
bg: `Results["<screw>"]`: Речник, съдържащ следните ключове:

source: `sign`: A string specifying the direction to turn to screw for the necessary adjustment. Either "CW" for clockwise or "CCW" for counterclockwise.
bg: `sign`: низ, указващ посоката на завъртане на винта за необходимата настройка. "CW" - по посока на часовниковата стрелка, или "CCW" - обратно на часовниковата стрелка.

source: `is_base`: Returns True if this is the base screw.
bg: `is_base`: Връща True, ако това е базовият винт.

source: The following information is available in the `stepper_enable` object (this object is available if any stepper is defined):
bg: Следната информация е налична в обекта `stepper_enable` (този обект е наличен, ако е дефиниран някой стъпков механизъм):

source: `steppers["<stepper>"]`: Returns True if the given stepper is enabled.
bg: `steppers["<stepper>"]`: Връща True, ако даденият стъпков механизъм е активиран.

source: The following information is available in [gcode_button some_name](Config_Reference.md#gcode_button) objects:
bg: Следната информация е налична в обектите [gcode_button some_name](Config_Reference.md#gcode_button):

source: `state`: The current button state returned as "PRESSED" or "RELEASED"
bg: `state`: Текущото състояние на бутона, върнато като "PRESSED" или "RELEASED".

source: `available_monitors`: Returns a list of all currently available temperature monitors by their full config section names, e.g. `["tmc2240 stepper_x"]`. While a temperature sensor is always available to read, a temperature monitor may not be available and will return null in such case.
bg: `available_monitors`: Връща списък на всички налични в момента температурни монитори по техните пълни имена на секциите в конфигурацията, например `["tmc2240 stepper_x"]`. Докато температурен сензор е винаги наличен за четене, температурен монитор може да не е наличен и в такъв случай ще се върне null.

source: `max_deviation`: Return the last `MAX_DEVIATION` value of the most recent `SCREWS_TILT_CALCULATE` command.
bg: `max_deviation`: Връща последната стойност на `MAX_DEVIATION` на последната команда `SCREWS_TILT_CALCULATE`.

source: `temperature`: The internal temperature reported by the driver. This field will be null if the driver is not enabled or if the driver does not support temperature reporting.
bg: `температура`: Вътрешната температура, отчетена от драйвера. Това поле ще бъде нулево, ако драйверът не е активиран или ако драйверът не поддържа отчитане на температурата.

source: The following information is available in [dual_carriage](Config_Reference.md#dual_carriage) on a cartesian, hybrid_corexy or hybrid_corexz robot
bg: Следната информация е налична в [dual_carriage](Config_Reference.md#dual_carriage) за картезиански, хибриден_corexy или хибриден_corexz робот

source: `carriage_0`: The mode of the carriage 0. Possible values are: "INACTIVE" and "PRIMARY".
bg: `carriage_0`: Възможните стойности са: "НЕАКТИВЕН" и "ПЪРВИЧЕН".

source: `carriage_1`: The mode of the carriage 1. Possible values are: "INACTIVE", "PRIMARY", "COPY", and "MIRROR".
bg: `carriage_1`: Режимът на карета 1. Възможните стойности са: "INACTIVE", "PRIMARY", "COPY" и "MIRROR".

source: The following information is available in [pwm_cycle_time some_name](Config_Reference.md#pwm_cycle_time) objects:
bg: Следната информация е налична в обектите [pwm_cycle_time some_name](Config_Reference.md#pwm_cycle_time):

source: `max_velocity`, `max_accel`, `minimum_cruise_ratio`, `square_corner_velocity`: The current printing limits that are in effect. This may differ from the config file settings if a `SET_VELOCITY_LIMIT` (or `M204`) command alters them at run-time.
bg: `max_velocity`, `max_accel`, `minimum_cruise_ratio`, `square_corner_velocity`: Текущите ограничения за печат, които са в сила. Това може да се различава от настройките в конфигурационния файл, ако командата `SET_VELOCITY_LIMIT` (или `M204`) ги промени по време на работа.

source: `humidity`, `pressure`, `gas`: The last read values from the sensor (only on bme280, htu21d, sht3x and lm75 sensors).
bg: `влажност`, `налягане`, `газ`: Последните прочетени стойности от сензора (само за сензорите bme280, htu21d, sht3x и lm75).
