Repository: flyer05/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Example_Configs.po
Languages: bg

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
bg: Този документ съдържа указания за добавяне на примерна конфигурация на Klipper към хранилището на Klipper в github (намира се в директорията [config](../config/)).

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
bg: Имайте предвид, че сървърът [Klipper Community Discourse server](https://community.klipper3d.org) също е полезен ресурс за намиране и споделяне на конфигурационни файлове.

source: Guidelines
bg: Насоки

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
bg: Префиксът `generic` се използва за платка за 3D принтер, която може да се използва в много различни видове принтери.

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
bg: Префиксът `комплект` е за 3D принтери, които са сглобени в съответствие с широко използвана спецификация. Тези "комплектни" принтери обикновено се различават от обикновените "принтери" по това, че не се продават от производител.

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
bg: Префиксът `sample` се използва за "фрагменти" от конфигурацията, които могат да се копират и поставят в основния конфигурационен файл.

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
bg: Префиксът `example` се използва за описание на кинематиката на принтера. Този тип конфигурация обикновено се добавя само заедно с кода за нов тип кинематика на принтера.

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
bg: Klipper трябва да може да стартира `printer`, `generic` и `kit` примерния конфигурационен файл без грешка. Тези конфигурационни файлове трябва да бъдат добавени към тестовия случай за регресия [test/klippy/printers.test](../test/klippy/printers.test). Добавете нови конфигурационни файлове към този тестови случай в съответния раздел и по азбучен ред в рамките на този раздел.

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
bg: Примерната конфигурация трябва да бъде за конфигурацията "склад" на принтера. (Има твърде много "персонализирани" конфигурации, които могат да бъдат проследени в основното хранилище на Klipper.) По същия начин добавяме примерни конфигурационни файлове само за принтери, комплекти и платки, които са популярни (например, трябва да има поне 100 от тях в активна употреба). Помислете за използването на сървъра [Klipper Community Discourse server](https://community.klipper3d.org) за други конфигурации.

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
bg: Посочете само тези устройства, които са налични в дадения принтер или платка. Не посочвайте настройки, специфични за вашата конкретна конфигурация.За `общите` конфигурационни файлове трябва да се опишат само устройствата на дънната платка. Например не би имало смисъл да добавяте раздел за конфигуриране на дисплея към "общ" конфигуриращ файл, тъй като няма как да знаете дали платката ще бъде свързана с този тип дисплей. Ако платката има специфичен хардуерен порт за улесняване на допълнително периферно устройство (напр. порт за bltouch), тогава може да се добави "коментиран" раздел от конфигурацията за даденото устройство.

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
bg: Не посочвайте `pressure_advance` в примерната конфигурация, тъй като тази стойност е специфична за нишката, а не за хардуера на принтера. По същия начин не посочвайте настройките `max_extrude_only_velocity` (максимална скорост само на екструдиране) и `max_extrude_only_accel` (максимална скорост само на екструдиране).

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
bg: Не посочвайте раздел от конфигурацията, съдържащ път до хост или хардуер на хост. Например, не посочвайте секциите за конфигуриране `[virtual_sdcard]` и `[temperature_host]`.

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
bg: Дефинирайте само макроси, които използват функционалност, специфична за дадения принтер, или за дефиниране на g-кодове, които обикновено се излъчват от нарязващите устройства, конфигурирани за дадения принтер.

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
bg: Където е възможно, най-добре е да се използват същите формулировки, словосъчетания, отстъп и подредба на разделите като съществуващите конфигурационни файлове.В горната част на всеки конфигурационен файл трябва да се посочи типът на микроконтролера, който потребителят трябва да избере по време на "make menuconfig". Той също така трябва да съдържа препратка към "docs/Config_Reference.md".

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
bg: Не копирайте документацията за полетата в примерните конфигурационни файлове. (Това създава затруднения при поддръжката, тъй като при актуализация на документацията ще се наложи тя да бъде променена на много места.)

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
bg: Файловете с примерна конфигурация не трябва да съдържат секция "SAVE_CONFIG". Ако е необходимо, копирайте съответните полета от раздела "SAVE_CONFIG" в съответния раздел в основната област на конфигурацията.

source: Use `field: value` syntax instead of `field=value`.
bg: Използвайте синтаксиса `field: value` вместо `field=value`.

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
bg: Избягвайте да определяте стойности на полета, които са зададени като стойност по подразбиране. Например не трябва да се задава `min_extrude_temp: 170`, тъй като това вече е стойността по подразбиране.

source: Where possible, lines should not exceed 80 columns.
bg: По възможност редовете не трябва да надвишават 80 колони.

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
bg: Избягвайте да добавяте съобщения за атрибуция или ревизия към файловете за конфигуриране. (Например избягвайте да добавяте редове като "този файл е създаден от ...") Поставете атрибуцията и историята на промените в съобщението git commit.

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
bg: Не деактивирайте системата за безопасност по подразбиране в примерния конфигурационен файл. Например в конфигурацията не трябва да се задава потребителски параметър `max_extrude_cross_section`. Не разрешавайте функциите за отстраняване на грешки. Например не трябва да има конфигурационен раздел `force_move`.

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
bg: Файловете с примерни конфигурации се подават чрез създаване на заявка за изтегляне в github. Моля, следвайте и указанията в документа [contributing document](CONTRIBUTING.md).

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
bg: Префиксът `printer` се използва за серийни принтери, продавани от основен производител.

source: Example configurations
bg: Примерни конфигурации

source: Select the appropriate config filename prefix:
bg: Изберете подходящия префикс на името на файла с конфигурацията:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
bg: Всички конфигурационни файлове трябва да завършват със суфикс `.cfg`. Файловете за конфигуриране на `принтер` трябва да завършват с година, последвана от `.cfg` (например, `-2019.cfg`). В този случай годината е приблизителната година, в която е продаден даденият принтер.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
bg: Не използвайте интервали или специални символи в името на конфигурационния файл. Името на файла трябва да съдържа само символите `A-Z`, `a-z`, `0-9`, `-` и `.`.

source: Do not use any deprecated features in the example config file.
bg: Не използвайте никакви остарели функции в примерния конфигурационен файл.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
bg: Когато добавяте `разстояние на въртене` на екструдера, за предпочитане е да посочите `редукторно съотношение`, ако екструдерът има зъбен механизъм. Очакваме разстоянието на въртене в примерните конфигурации да съответства на обиколката на зъбното колело в екструдера - обикновено то е в диапазона от 20 до 35 mm. Когато посочвате съотношение на предавките, за предпочитане е да посочите действителните предавки на механизма (например, предпочитайте `съотношение на предавките: 80:20` пред `съотношение на предавките: 4:1`). За повече информация вижте документа [Разстояние на въртене](Rotation_Distance.md#using-a-gear_ratio).

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
bg: Всички известни платки, които Klipper поддържа, могат да използват серийната скорост по подразбиране от 250000 бода. Не препоръчвайте различна скорост на предаване на данни в примерния конфигурационен файл.
