Repository: flyer05/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/OctoPrint.po
Languages: bg, uk

source: OctoPrint for Klipper
bg: OctoPrint за Clipper
uk: OctoPrint для кліппера

source: Klipper has a few options for its front ends, Octoprint was the first and original front end for Klipper. This document will give a brief overview of installing with this option.
bg: Klipper има няколко опции за предните си части, Octoprint е първата и оригинална предна част за Klipper. В този документ ще бъде направен кратък преглед на инсталирането с тази опция.
uk: Klipper має кілька варіантів для своїх передніх кінців, Octoprint був першим і оригінальним переднім кінцем для Klipper. Цей документ дасть короткий огляд установки з цим варіантом.

source: Install with OctoPi
bg: Инсталиране с OctoPi
uk: Встановлення з OctoPi

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [OctoPi releases](https://github.com/guysoft/OctoPi/releases) for release information.
bg: Започнете, като инсталирате [OctoPi](https://github.com/guysoft/OctoPi) на компютъра Raspberry Pi. Използвайте OctoPi v0.17.0 или по-нова версия - вижте [OctoPi releases](https://github.com/guysoft/OctoPi/releases) за информация за версиите.
uk: Почати установку [OctoPi](https://github.com/guysoft/OctoPi) на Raspberry Pi комп'ютер. Використовуйте OctoPi v0.17.0 або пізніше - див. [OctoPi релізи](https://github.com/guysoft/OctoPi/випуски) для отримання інформації.

source: One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint if needed.
bg: Трябва да се провери дали OctoPi се зарежда и дали уеб сървърът на OctoPrint работи. След като се свържете с уеб страницата на OctoPrint, следвайте подканата за обновяване на OctoPrint, ако е необходимо.
uk: Ви можете перевірити, що завантаження OctoPi і що працює на сервері OctoPrint. Після підключення до веб-сторінки OctoPrint слідувати за запитом, щоб оновити OctoPrint, якщо це необхідно.

source: After installing OctoPi and upgrading OctoPrint, it will be necessary to ssh into the target machine to run a handful of system commands.
bg: След като инсталирате OctoPi и надстроите OctoPrint, ще е необходимо да влезете през ssh в целевата машина, за да изпълните няколко системни команди.
uk: Після установки OctoPi і оновлення OctoPrint, потрібно буде заштовхуватися в цільову машину, щоб запустити зручний системних команд.

source: Start by running these commands on your host device:
bg: Започнете с изпълнението на тези команди на хост устройството:
uk: Після запуску цих команд на вашому пристрої хост:

source: **If you do not have git installed, please do so with:**
bg: **Ако нямате инсталиран git, моля, направете го с:**
uk: **Якщо ви не встановили git, будь ласка, з:**

source: sudo apt install git
uk: sudo apt встановити git

source: then proceed:
bg: след това продължете:
uk: далі:

source: cd ~ git clone https://github.com/Klipper3d/klipper ./klipper/scripts/install-octopi.sh
uk: з git клон https://github.com/Klipper3d/klipper JavaScript licenses API Веб-сайт Go1.13.8

source: The above will download Klipper, install the needed system dependencies, setup Klipper to run at system startup, and start the Klipper host software. It will require an internet connection and it may take a few minutes to complete.
bg: Горното ще изтегли Klipper, ще инсталира необходимите системни зависимости, ще настрои Klipper да се стартира при стартиране на системата и ще стартира хост софтуера на Klipper. Това изисква интернет връзка и може да отнеме няколко минути.
uk: Завантажуйте Klipper, встановіть потрібні залежності системи, налаштуйте Klipper для запуску системи та запустіть програмне забезпечення Klipper. Задовольнить підключення до Інтернету і може зайняти декілька хвилин.

source: Installing with KIAUH
bg: Инсталиране с KIAUH
uk: Установка КІАУХ

source: KIAUH can be used to install OctoPrint on a variety of Linux based systems that run a form of Debian. More information can be found at https://github.com/dw-0/kiauh
bg: KIAUH може да се използва за инсталиране на OctoPrint на различни системи, базирани на Linux, които работят под формата на Debian. Повече информация можете да намерите на адрес https://github.com/dw-0/kiauh
uk: KIAUH може використовуватися для установки OctoPrint на різних Linux базових системах, які виконують форму Debian. Більше інформації можна знайти на https://github.com/dw-0/kiauh

source: Configuring OctoPrint to use Klipper
bg: Конфигуриране на OctoPrint за използване на Klipper
uk: Налаштування OctoPrint для використання Klipper

source: The OctoPrint web server needs to be configured to communicate with the Klipper host software. Using a web browser, login to the OctoPrint web page and then configure the following items:
bg: Уеб сървърът на OctoPrint трябва да бъде конфигуриран, за да комуникира с хост софтуера на Klipper. Използвайки уеб браузър, влезте в уеб страницата на OctoPrint и след това конфигурирайте следните елементи:
uk: Веб-сервер OctoPrint повинен бути налаштований для спілкування з програмним забезпеченням Klipper. Використання веб-браузера, логіна на веб-сторінку OctoPrint, а потім налаштовувати такі елементи:

source: Navigate to the Settings tab (the wrench icon at the top of the page). Under "Serial Connection" in "Additional serial ports" add:
bg: Отидете в раздела Настройки (иконата на гаечен ключ в горната част на страницата). В "Серийна връзка" в "Допълнителни серийни портове" добавете:
uk: Навігація на вкладку «Налаштування». Під "Серійне підключення" в "Додаткові серійні порти" додати:

source: Then click "Save".
bg: След това щракнете върху "Запази".
uk: Потім натисніть "Зберегти".

source: *In some older setups this address may be `/tmp/printer`*
bg: *В някои по-стари конфигурации този адрес може да бъде `/tmp/printer`*
uk: *У деяких старих налаштуваннях ця адреса може бути `/tmp/printer`*

source: Enter the Settings tab again and under "Serial Connection" change the "Serial Port" setting to the one added above.
bg: Влезте отново в раздела Settings (Настройки) и в "Serial Connection" (Серийна връзка) променете настройката "Serial Port" (Сериен порт) на добавената по-горе.
uk: Введіть вкладку Параметри знову і під параметром "Серійне підключення" змінити параметр "Серійний порт" додано вище.

source: In the Settings tab, navigate to the "Behavior" sub-tab and select the "Cancel any ongoing prints but stay connected to the printer" option. Click "Save".
bg: В раздела Settings (Настройки) преминете към подкабината "Behavior" (Поведение) и изберете опцията "Cancel any ongoing prints but stay connected to the printer" (Отмени всички текущи разпечатки, но остани свързан с принтера). Щракнете върху "Запази".
uk: У вкладці «Налаштування», навігація на субтаб «Бегавіор» і виберіть пункт «Перевірити будь-які поточні принти, але залишайтеся підключеними до принтера». Натисніть "Зберегти".

source: From the main page, under the "Connection" section (at the top left of the page) make sure the "Serial Port" is set to the new additional one added and click "Connect". (If it is not in the available selection then try reloading the page.)
bg: На главната страница в раздела "Connection" (в горния ляв ъгъл на страницата) се уверете, че "Serial Port" (Сериен порт) е настроен на новия допълнителен порт и щракнете върху "Connect" (Свързване). (Ако не е в наличния избор, опитайте да презаредите страницата.)
uk: З головної сторінки в розділі «Підключення» (вгорі зліва від сторінки) переконайтеся, що «Серійний порт» встановлюється на новий додатковий доданий і натисніть кнопку «Підключення». (Якщо це не в доступний вибір, то спробуйте перезавантажити сторінку.)

source: Once connected, navigate to the "Terminal" tab and type "status" (without the quotes) into the command entry box and click "Send". The terminal window will likely report there is an error opening the config file - that means OctoPrint is successfully communicating with Klipper.
bg: След като се свържете, преминете към раздела "Терминал" и въведете "status" (без кавичките) в полето за въвеждане на команди и щракнете върху "Изпрати". Прозорецът на терминала вероятно ще съобщи, че има грешка при отварянето на конфигурационния файл - това означава, че OctoPrint успешно комуникира с Klipper.
uk: Після підключення навігація до вкладки «Terminal» та типу «статус» (без лапок) в поле введення команди та натисніть кнопку «Зберегти». Вікно терміналу, швидше за все, повідомляється, що є помилка відкриття файлу налаштування - це означає, що OctoPrint успішно спілкується з Klipper.

source: Please proceed to <Installation.md> and the *Building and flashing the micro-controller* section
bg: Моля, преминете към <Installation.md> и раздела *Създаване и флашване на микроконтролера*
uk: Будь ласка, перейдіть до <Installation.md> і розділу *Створення та прошивка мікроконтролера*
