Repository: flyer05/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Skew_Correction.po
Languages: uk

source: Skew correction
uk: Корекція гасіння

source: Software based skew correction can help resolve dimensional inaccuracies resulting from a printer assembly that is not perfectly square. Note that if your printer is significantly skewed it is strongly recommended to first use mechanical means to get your printer as square as possible prior to applying software based correction.
uk: Програмне забезпечення на основі корекції скелета може допомогти вирішити об'ємні неточності, що призводить до складання принтера, що не є ідеальною площі. Зауважте, що якщо ваш принтер значно спрощує його, рекомендується спочатку використовувати механічні засоби, щоб отримати ваш принтер максимально можливо до застосування програмного забезпечення на основі корекції.

source: Print a Calibration Object
uk: Друк калібрування Об'єкт

source: The first step in correcting skew is to print a [calibration object](https://www.thingiverse.com/thing:2563185/files) along the plane you want to correct. There is also a [calibration object](https://www.thingiverse.com/thing:2972743) that includes all planes in one model. You want the object oriented so that corner A is toward the origin of the plane.
uk: Першим кроком у виправленні шава є друк [об’єкт калібрування](https://www.thingiverse.com/thing:2563185/files) по площині, яку ви хочете виправити. Є також [об'єкт калібрування](https://www.thingiverse.com/thing:2972743), що включає в себе всі літаки в одній моделі. Ви хочете, щоб об'єкт орієнтований таким чином, щоб кут А в сторону виходу літака.

source: Make sure that no skew correction is applied during this print. You may do this by either removing the `[skew_correction]` module from printer.cfg or by issuing a `SET_SKEW CLEAR=1` gcode.
uk: Переконайтеся, що не застосовується корекція шавлії під час цього друку. Ви можете зробити це шляхом видалення модуля `[skew_correction]` з принтера.cfg або випискою `SET_SKEW CLEAR=1` gcode.

source: Take your measurements
uk: Візьміть ваші вимірювання

source: Configure your skew
uk: Налаштуйте свій шашлик

source: Make sure `[skew_correction]` is in printer.cfg. You may now use the `SET_SKEW` gcode to configure skew_correcton. For example, if your measured lengths along XY are as follows:
uk: Переконайтеся, що `[skew_correction]` знаходиться в принтері.cfg. Ви можете використовувати `SET_SKEW` gcode для налаштування skew_correcton. Наприклад, якщо виміряні довжини вздовж XY є наступним чином:

source: Length AC = 140.4 Length BD = 142.8 Length AD = 99.8
uk: Довжина AC = 140.4 Довжина BD = 142.8 Довжина AD = 99.8

source: `SET_SKEW` can be used to configure skew correction for the XY plane.
uk: `SET_SKEW` може використовуватися для налаштування корекції шава для літака XY.

source: You may also add measurements for XZ and YZ to the gcode:
uk: Ви також можете додати вимірювання для XZ і YZ до gcode:

source: The `[skew_correction]` module also supports profile management in a manner similar to `[bed_mesh]`. After setting skew using the `SET_SKEW` gcode, you may use the `SKEW_PROFILE` gcode to save it:
uk: Модуль `[skew_correction]` також підтримує управління профілів в порядку, схожому на `[bed_mesh]`. Після встановлення шавлії за допомогою `SET_SKEW` gcode, ви можете використовувати `SKEW_PROFILE` gcode, щоб зберегти його:

source: SKEW_PROFILE SAVE=my_skew_profile
uk: ПЕВ_ПРОФІЛЕ SAVE=my_skew_profile

source: After this command you will be prompted to issue a `SAVE_CONFIG` gcode to save the profile to persistent storage. If no profile is named `my_skew_profile` then a new profile will be created. If the named profile exists it will be overwritten.
uk: Після цього вам буде запропоновано випустити `SAVE_CONFIG` gcode для збереження профілю до стійких пам'яток. Якщо не існує профілю `my_skew_profile`, то створюється новий профіль. Якщо зазначений профіль існує, він буде перезаписати.

source: Once you have a saved profile, you may load it:
uk: Після того, як у вас є збережений профіль, ви можете завантажити його:

source: SKEW_PROFILE LOAD=my_skew_profile
uk: ПЕВ_ПРОФІЛЕ LOAD=my_skew_profile

source: It is also possible to remove an old or out of date profile:
uk: Також можна видалити старий або з профілю дати:

source: SKEW_PROFILE REMOVE=my_skew_profile
uk: ПЕВ_ПРОФІЛЕ REMOVE=my_skew_profile

source: After removing a profile you will be prompted to issue a `SAVE_CONFIG` to make this change persist.
uk: Після видалення профілю ви підкажете `SAVE_CONFIG`, щоб зробити цю зміну персистентом.

source: Verifying your correction
uk: Перевірити виправлення

source: After skew_correction has been configured you may reprint the calibration part with correction enabled. Use the following gcode to check your skew on each plane. The results should be lower than those reported via `GET_CURRENT_SKEW`.
uk: Після того, як skew_correction було налаштовано, ви можете відредагувати відділ калібрування з ввімкненим виправленням. Використовуйте наступний gcode для перевірки спинки на кожній площині. Результати повинні бути нижче, ніж дані, які повідомляються `GET_CURRENT_SKEW`.

source: CALC_MEASURED_SKEW AC=<ac_length> BD=<bd_length> AD=<ad_length>
uk: CALC_MEASURED_SKEW AC=<ac_довжина> BD=<bd_довжина> AD=<ad_довжина>

source: Caveats
uk: Печера

source: Due to the nature of skew correction it is recommended to configure skew in your start gcode, after homing and any kind of movement that travels near the edge of the print area such as a purge or nozzle wipe. You may use use the `SET_SKEW` or `SKEW_PROFILE` gcodes to accomplish this. It is also recommended to issue a `SET_SKEW CLEAR=1` in your end gcode.
uk: У зв'язку з характером корекції шава рекомендується налаштовувати шавбу у вашому старті gcode, після гоління і будь-який вид руху, який просувається біля краю площі друку, таких як хірург або насадка. Ви можете використовувати `SET_SKEW` або `SKEW_PROFILE` gcodes для виконання цього. Також рекомендується випустити `SET_SKEW CLEAR=1` в кінцевому gcode.

source: Keep in mind that it is possible for `[skew_correction]` to generate a correction that moves the tool beyond the printer's boundaries on the X and/or Y axes. It is recommended to arrange parts away from the edges when using `[skew_correction]`.
uk: Впевнений, що це можливо для `[skew_correction]`, щоб створити корекцію, яка переміщує інструмент за межі принтера на X і / або Y осі. Рекомендовано влаштувати частини з країв при використанні `[skew_correction]`.

source: The `[skew_correction]` module requires 3 measurements for each plane you want to correct; the length from Corner A to Corner C, the length from Corner B to Corner D, and the length from Corner A to Corner D. When measuring length AD do not include the flats on the corners that some test objects provide.
uk: Модуль `[skew_correction]` вимагає 3 вимірювань для кожної площини, яку ви хочете виправити; довжина від Corner A до Corner C, довжина від Corner B до Corner D, а довжина від Corner A до Corner D. При вимірюванні довжини AD не включають квартири на кутах, які забезпечують деякі тестові об'єкти.
