Repository: flyer05/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Slicers.po
Languages: uk

source: This document provides some tips for configuring a "slicer" application for use with Klipper. Common slicers used with Klipper are Slic3r, Cura, Simplify3D, etc.
uk: Цей документ надає деякі поради щодо налаштування програми "slicer" для використання з Klipper. Звичайні скибочки, які використовуються з Klipper, Slic3r, Cura, Simplify3D і т.д.

source: Set the G-Code flavor to Marlin
uk: Набір аромату G-Code в Марлін

source: Many slicers have an option to configure the "G-Code flavor". The default is frequently "Marlin" and that works well with Klipper. The "Smoothieware" setting also works well with Klipper.
uk: Багато скибочок мають можливість налаштувати "G-Code аромат". За замовчуванням часто "Марлін" і що добре працює з Klipper. В налаштуваннях "Smoothieware" також добре працює з Klipper.

source: Klipper gcode_macro
uk: Кліппер gcode_macro

source: Slicers will often allow one to configure "Start G-Code" and "End G-Code" sequences. It is often convenient to define custom macros in the Klipper config file instead - such as: `[gcode_macro START_PRINT]` and `[gcode_macro END_PRINT]`. Then one can just run START_PRINT and END_PRINT in the slicer's configuration. Defining these actions in the Klipper configuration may make it easier to tweak the printer's start and end steps as changes do not require re-slicing.
uk: Шліфери часто дозволяють налаштовувати "Start G-Code" і "End G-Code" послідовності. Часто зручні для визначення користувацьких макросів у файлі налаштування Klipper замість - наприклад: `[gcode_macro START_PRINT]` та `[gcode_macro END_PRINT]`. Потім можна просто запустити START_PRINT і END_PRINT в конфігурації скибочка. Захищаючи ці дії в налаштуваннях Klipper може зробити його легше віджимати початок принтера і кінцеві кроки, оскільки зміни не вимагають повторного нарізання.

source: See [sample-macros.cfg](../config/sample-macros.cfg) for example START_PRINT and END_PRINT macros.
uk: Перегляньте [sample-macros.cfg](../config/sample-macros.cfg) для прикладів макросів START_PRINT і END_PRINT.

source: See the [config reference](Config_Reference.md#gcode_macro) for details on defining a gcode_macro.
uk: Див. [Налаштування посилання](Config_Reference.md#gcode_macro) для деталей з визначення gcode_macro.

source: Large retraction settings may require tuning Klipper
uk: Великі параметри відкликання можуть вимагати від Тюнінг Кліппер

source: The maximum speed and acceleration of retraction moves are controlled in Klipper by the `max_extrude_only_velocity` and `max_extrude_only_accel` config settings. These settings have a default value that should work well on many printers. However, if one has configured a large retraction in the slicer (eg, 5mm or greater) then one may find they limit the desired speed of retractions.
uk: Максимальна швидкість і прискорення ретракційних рухів контролюються в Кліппері `max_extrude_only_velocity` і `max_extrude_only_accel` налаштування. Ці налаштування мають значення за замовчуванням, яке має добре працювати на багатьох принтерах. Однак, якщо один налаштовував велику віддачу в скибочках (наприклад, 5мм або більше), то можна знайти, що обмежують потрібну швидкість відбиття.

source: If using a large retraction, consider tuning Klipper's [pressure advance](Pressure_Advance.md) instead. Otherwise, if one finds the toolhead seems to "pause" during retraction and priming, then consider explicitly defining `max_extrude_only_velocity` and `max_extrude_only_accel` in the Klipper config file.
uk: Якщо використовується велике відведення, натомість подумайте про налаштування [випередження тиску](Pressure_Advance.md) Klipper. В іншому випадку, якщо ви побачите, що інструментальна головка «зупиняється» під час відтягування та заправки, тоді розгляньте можливість явного визначення `max_extrude_only_velocity` і `max_extrude_only_accel` у конфігураційному файлі Klipper.

source: Do not enable "coasting"
uk: Не увімкнено "коастування"

source: The "coasting" feature is likely to result in poor quality prints with Klipper. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
uk: Функція «вибігу» може призвести до низької якості друку за допомогою Klipper. Замість цього подумайте над тим, щоб використовувати [pressure advance](Pressure_Advance.md) Klipper.

source: Specifically, if the slicer dramatically changes the extrusion rate between moves then Klipper will perform deceleration and acceleration between moves. This is likely to make blobbing worse, not better.
uk: Зокрема, якщо скибочка різко змінює швидкість екструзії між переміщеннями, то Klipper буде виконувати розщеплення і прискорення між переміщеннями. Це, ймовірно, зробити баббінг гірше, не краще.

source: In contrast, it is okay (and often helpful) to use a slicer's "retract" setting, "wipe" setting, and/or "wipe on retract" setting.
uk: На відміну від того, це океї (і часто корисними) для використання скибочка "відновити" налаштування, налаштування "wipe" та/або "попередня на відлік" налаштування.

source: Do not use "extra restart distance" on Simplify3d
uk: Не використовуйте "віддаленість перезаряджання" на Симпліфікуйте3d

source: This setting can cause dramatic changes to extrusion rates which can trigger Klipper's maximum extrusion cross-section check. Consider using Klipper's [pressure advance](Pressure_Advance.md) or the regular Simplify3d retract setting instead.
uk: Цей параметр може спричинити різкі зміни швидкості екструзії, що може викликати перевірку максимального поперечного перерізу екструзії Klipper. Подумайте про те, щоб натомість використати [pressure advance](Pressure_Advance.md) Klipper або звичайне налаштування Simplify3d retract.

source: Disable "PreloadVE" on KISSlicer
uk: Вимкніть "PreloadVE" на KISSlicer

source: If using KISSlicer slicing software then set "PreloadVE" to zero. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
uk: При використанні програмного забезпечення KISSlicer slicing потім встановити "PreloadVE" до нуля. Розглянемо, використовуючи Klipper's [Налаштування заздалегідь](Pressure_Advance.md) замість.

source: Disable any "advanced extruder pressure" settings
uk: Вимкніть будь-які налаштування екструдера

source: Some slicers advertise an "advanced extruder pressure" capability. It is recommended to keep these options disabled when using Klipper as they are likely to result in poor quality prints. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
uk: Деякі скибочки рекламують можливість "розширити тиск" Рекомендовано зберігати ці параметри відключені при використанні Klipper, оскільки вони, швидше за все, можуть призвести до низьких показників якості. Розглянемо, використовуючи Klipper's [Налаштування заздалегідь](Pressure_Advance.md) замість.

source: Specifically, these slicer settings can instruct the firmware to make wild changes to the extrusion rate in the hope that the firmware will approximate those requests and the printer will roughly obtain a desirable extruder pressure. Klipper, however, utilizes precise kinematic calculations and timing. When Klipper is commanded to make significant changes to the extrusion rate it will plan out the corresponding changes to velocity, acceleration, and extruder movement - which is not the slicer's intent. The slicer may even command excessive extrusion rates to the point that it triggers Klipper's maximum extrusion cross-section check.
uk: Зокрема, ці налаштування скибочка можуть інструктувати прошивку, щоб зробити дикими змінами до швидкості екструзії надії, що прошивка приблизить ці запити і принтер буде грубо отримати бажаний екструдерний тиск. Кліппер, однак, використовує точний кінематичний розрахунок та терміни. Коли Klipper призначено для внесення значних змін до швидкості екструзії, він плануватиме відповідні зміни до швидкості, прискорення та руху екструдера - що не є інтенсивом скибочка. Зрізка може навіть керувати зайвими показниками екструзії до точки, що він запускає максимальну екструзію Кліппера.

source: Slicers
uk: Слайсери

source: START_PRINT macros
uk: СТАРТ-ПРИНТ макроси

source: When using a START_PRINT macro or similar, it is useful to sometimes pass through parameters from the slicer variables to the macro.
uk: При використанні макросхема START_PRINT або аналогічного, корисно іноді пропускати через параметри з змінних скибочка до макросу.

source: In Cura, to pass through temperatures, the following start gcode would be used:
uk: У Cura, щоб пройти через температуру, використовується наступний запуск gcode:

source: START_PRINT BED_TEMP={material_bed_temperature_layer_0} EXTRUDER_TEMP={material_print_temperature_layer_0}
uk: СТАРТ-ПРИНТ BED_TEMP={material_bed_color_layer_0} EXTRUDER_TEMP={material_print_color_layer_0}

source: In slic3r derivatives such as PrusaSlicer and SuperSlicer, the following would be used:
uk: У slic3r похідних, таких як PrusaSlicer і SuperSlicer, наступні будуть використані:

source: Also note that these slicers will insert their own heating codes when certain conditions are not met. In Cura, the existence of the `{material_bed_temperature_layer_0}` and `{material_print_temperature_layer_0}` variables is enough to mitigate this. In slic3r derivatives, you would use:
uk: Також зверніть увагу, що ці скибочки вставять власні нагрівальні коди при певних умовах не відповідають. У Cura, існування `{material_bed_color_layer_0}` і `{material_print_color_layer_0}` змінні достатньо для пом'якшення цього. У похідних slic3r ви будете використовувати:

source: M140 S0 M104 S0
uk: М140 С0 М104 С0

source: before the macro call. Also note that SuperSlicer has a "custom gcode only" button option, which achieves the same outcome.
uk: перед макрозв'язком. Також зверніть увагу, що SuperSlicer має параметр кнопка "схема gcode тільки", що досягається того ж результату.

source: An example of a START_PRINT macro using these paramaters can be found in config/sample-macros.cfg
uk: Приклад макросу START_PRINT за допомогою цих параматерів можна знайти в конфігурації / sample-macros.cfg

source: START_PRINT EXTRUDER_TEMP=[first_layer_temperature] BED_TEMP=[first_layer_bed_temperature]
uk: START_PRINT EXTRUDER_TEMP=[перший_шаровий_температурний] BED_TEMP=[first_layer_bed_температурний]
